[
  {
    "chunk_id": "chunk_1",
    "text": "Hey guys, Terrick here, your instructor and mentor. And I want to introduce you to this bonus lesson on habits. And this is such an important lesson here. Because without habits, when good habits, you're going to be set up for really failure. Because both success and failure are largely the results of habits. So let's talk about that for example. In this book that I read called High Performance Habits, it really is summarized in six habits that you have to master in order to achieve any type of high level success and creating a high level success. Like who wants to be at the peak high performance level like throughout, like consistently, right? All of those, right? So this is going to help you do that with balance, without burnout, without fatigue, things like that.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Habits",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "like that. So I'm going to go through each kind of habit and then what, basically going to make it some quick Q&A. So one, seeking clarity, right? Seeking clarity is super important because without purpose or without a dream, you're going to lack the motivation, right? And motivation begins also with ambition. So seeking clarity, for example, a moment that I see clarity was when I knew that I was at the bank and I wanted to go work for Cisco. I see clarity. I got really ambitious and I see clarity. I had this vision that I was going to be a system engineer at Cisco Systems and I was able to make that dream come true. So always seek clarity, find that purpose because when times are tough and you're trying to hit your goals, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Motivation",
      "content_type": "Advice",
      "timestamp": "01:09 - 02:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "to hit your goals, right? You can always dig into that purpose. And if you have that clarity, everything becomes clear. So one, seek clarity, two, is generating energy. How do you generate energy? Well, with everything you need to do or any obstacle or challenge your facing or goals you want to achieve in life, especially if you want to land your dream IT job, right? You need to generate energy by developing the mental stamina, right? By the physical endurance, for example, I need eight hours of sleep to be optimal. So don't kid yourself. If you're not part of the 1% that can run on four or five hours of sleep, don't try that. That's going to mess you up. So make sure that you're taking care of yourself, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Goal Setting",
      "content_type": "Advice",
      "timestamp": "02:07 - 03:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "So make sure that you're taking care of yourself, right? Whether it's through exercise, sleep, and also having mental clarity, right? Mental stamina is going to do wonders for your career. So generating energy, bringing the energy, eating healthy, like if you're on fast food 24 7, it's going to bring down your energy, right? And if you don't have the right energy throughout your day, it's going to affect how you perform, regardless, okay? I mean, it's just a proven fact. So, and also understand that hitting any of these habits, you know, like a rising tide lifts all boats, right? They say, well, if you focus on any of these habits, you'll notice that it affects other areas of these habits that we're about to cut.",
    "metadata": {
      "domain": "Mindset",
      "topic": "SelfCare",
      "content_type": "Advice",
      "timestamp": "03:05 - 04:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "areas of these habits that we're about to cut. And I think number two is the most important thing is what energy I bring into the room, what energy you bring to your family, what energy you bring to try to learn something, having the right sleep, eating healthy, or having the right exercise, on a weekly basis, making sure you take care of those essentials is going to allow you to bring the energy everyday consistently. Three, raising necessity. Like raising necessity is really around like, what's the motivation? Like what's the why? Like, is it to take care of your family? It's putting states in the ground, right? Raising necessity, achieving a goal is super important, like for, you know, this life class I raised in necessity, I came in one day, I said, guess what?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Energy Habits",
      "content_type": "Advice",
      "timestamp": "03:57 - 04:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "class I raised in necessity, I came in one day, I said, guess what? I got a big surprise for you. I'm going to actually deliver a live course on Friday, like I raised necessity of putting states in the ground, right? And I had to get it done, right? So sometimes when you have deadlines or goals or like you want to pass an exam or you want to get into this particular job, like having a deadline, putting states in the ground, raising the bar, like raising necessity is super important, okay? And it really drives and moves the needle forward. Number four, increasing productivity. There's ways to increase productivity, but this is a very good habit to instill. So for example, if I am focusing on taking care of my body, getting the seven to nine hours",
    "metadata": {
      "domain": "Leadership",
      "topic": "productivity",
      "content_type": "Advice",
      "timestamp": "04:52 - 05:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "of sleep, whatever is in your range, right? That's going to bring optimum performance, right? Like preparing, like the 94. And what you're going to do the next morning and day is going to build momentum, especially owning your horning. I was really bad about that. But understand if you start off your morning, right, with the right amount of sleep and the right amount of nutrition in the morning, and whether it's like stretching, doing some yoga moves or doing some cardio, whatever, that you need to get the blood rushing and wake up, meditating, doing whatever you need to start off that morning, right? And giving yourself that good self-talk, whatever you need to do is going to help you increase productivity. And it's these, it's like habits are also rituals.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Productivity",
      "content_type": "Advice",
      "timestamp": "05:45 - 06:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "productivity. And it's these, it's like habits are also rituals. So you know, it's important to have good habits as you see, these are all good habits. And you'll see how your productivity increases dramatically. One thing I'd like to do is also to increase productivity is have focus work, like carving it out on the calendar, right, and having focus work. And also not like going too long without getting up and doing some jumping jacks or breathing, like doing a reset, right? And in this book, they talk about, you know, also like high performance, like, you know, low set of tension, you know, before they go into an activity, right? And doing a reset, right? And that's very important as you go from one activity to another activity, because we're",
    "metadata": {
      "domain": "Leadership",
      "topic": "productivity",
      "content_type": "Story",
      "timestamp": "06:30 - 07:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "always busy throughout the day doing so much different types of work. So it's important to do those resets and taking those breaks will also ensure that you have an increased productivity. There's so many other hats, but I would say the biggest things is, you know, getting proper sleep, getting good exercise, eating good, and owning your mornings, planning the night before on what you want to do. And once you do that, you can use the morning as a momentum to build into the afternoon. Like, I remember when I went to boot camp in the military, they made us, you know, do these perfect folds, you know, getting the bed all ready. Like, first thing, you know, drill sergeant comes in like, wake up, I'm bringing the doorbell and it's like 4.30 in the morning, you know, you're like, oh, what is going on?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Productivity",
      "content_type": "Story",
      "timestamp": "07:32 - 08:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "and it's like 4.30 in the morning, you know, you're like, oh, what is going on? And you've got like literally two minutes to get your bed ready, two minutes, and then you have to jump in the shower, right? But what's something intriguing about that is that it's like, they do that on purpose. So you make that perfect bed, and I wouldn't say, I would recommend for all of you, I don't know if you do that, but what makes it is that you start the day off, right? You accomplish something. You make that perfect bed, right? It sets off the day with intention, you know? What I like to do personally is I like to do visual meditation. So instead of just meditating and just focusing on breathing, like some people do, which is still good because breathing exercises is what I'm getting into now.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Morning Routine",
      "content_type": "Story",
      "timestamp": "08:20 - 09:07",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "is still good because breathing exercises is what I'm getting into now. But I like to just visualize, do visual meditation like in the morning for five to ten minutes. And think about what I plan for the day, think about all the good things that are about to unfold for the day. And I visualize my day with positivity, and it does wonders for my productivity as well. And then also you can use visual meditation to even think about obstacles that you may have to face throughout the day and how you're going to overcome it. Number five, developing influence. Without with any challenge or mountain you want to climb, it's important to have the right infrastructure, whether it's from your family, your spouse, girlfriend, loved ones to support you, right?",
    "metadata": {
      "domain": "Mindset",
      "topic": "Meditation",
      "content_type": "Story",
      "timestamp": "09:03 - 09:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "to support you, right? Or also to influence the people that you need to get that promotion, that dream job, right? Does that make sense? So understanding how to develop influence is very important, habit, to have as well. And then lastly, if demonstrating courage, courage to actually make ambitious goals, right? To really have the courage to believe in oneself, to tap into more potential, to not be afraid of new challenges, to embrace challenges, right? And to be able to take massive action, not afraid to put into work, right? So being having courage, this is super important, you know, habit, right? So that's six habits that the book really recommends, and I'll leave it up for Q&A. Thanks, sir. All right.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Influence",
      "content_type": "Story",
      "timestamp": "09:52 - 10:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "Thanks, sir. All right. So any Q&A on just habits overall, we can talk about good habits, bad habits, go ahead. Can you develop a little more on number five, developing influence? So developing influence, developing influence, like, is very important throughout your career. And really we'll talk about even social networking and personal branding. But imagine if you had this audacious goal of, for example, me, I'll give you an example, just myself, like, I want to move my entire family from Atlanta to Silicon Valley to do a tech startup, right? And disrupt tech education, because this big audacious goal, right? Like, never done a tech startup company. And I need to build the team, I need to do all this, and be able to learn, manage the system, like, it's a lot of overwhelm, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "10:48 - 11:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "manage the system, like, it's a lot of overwhelm, right? But imagine if I don't have the influence to convince my family, imagine if I don't have the influence to, like, get to support from my wife or my parents or my kids, like, how is that going to affect me performing at the highest levels? Right? If I didn't have that, right? Or what if I didn't have, like, I didn't develop the influence to convince our investors, or potential investors, that next gen is a game changer, right? It's going to generate the next generation of bad ass engineers, right? What if I couldn't influence them, right? To keep the company afloat, right? To raise capital. Because to disrupt some industry, look at Uber, right? It would provide a lot of venture capital.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Influence",
      "content_type": "Story",
      "timestamp": "11:55 - 12:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "It would provide a lot of venture capital. And that's where eventually capital, I believe, is so powerful. It can disrupt certain industries. And so developing influence is so crucial, having to work on, throughout your career, or throughout in life in order to reach high performance. Does that make sense? Yeah. Yeah? All right. Great question. Next. Yeah. Come on. So, I know these things, at least to me, sound like common sense, you know, like, if you help, you get them up to the, all those things. So, what do you think we don't apply those things on a more normal basis? Why do we need someone like the author of this book to tell us, oh, this is what you need to name it? Yeah.",
    "metadata": {
      "domain": "Leadership",
      "topic": "High Performance",
      "content_type": "Advice",
      "timestamp": "12:51 - 13:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "need to name it? Yeah. So, great question. So, it's because of bad habits. So, you need to replace your bad habits with good habits. For example, the way I look at habits is that we all have these habits, right? So, both success and failure are largely the results of the habit. So imagine if you're like, man, I've got all these ambitious goals. I want to like, you know, go work for Cisco one day. And I have this bad habit of playing Counter Strike to three in the morning. Cheers to her, right? Right? It's just such a bad habit, but like, I love it, you know? And then, I'm on five hours, you know, asleep. I go to work. I'm like, I'm a zombie. I don't perform at the highest peak. Now, do I?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Habits",
      "content_type": "Story",
      "timestamp": "13:35 - 14:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "I don't perform at the highest peak. Now, do I? I have this bad habit that's making me set up, setting myself up for failure. So I fail. So like, you know, it's about practitioners, it's about actually applying. And we're, you know, most people are lazy. Human nature is just, you're lazy, right? And we may think there's all these things that's common sense, but you'll be shocked on like, people won't implement them. They won't implement them. It's really the ambition. They don't have the ambition. They dream, they did, but they have to fix mindset or they don't want to put in the effort, they don't want to put into hard work. Because a good habit, believe it or not, it's harder than doing the bad habits.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Productivity",
      "content_type": "Story",
      "timestamp": "14:25 - 15:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "Because a good habit, believe it or not, it's harder than doing the bad habits. It's easy to eat a big glazed donut that's sitting in front of you. You know? It's easy to do that. But versus like, you know, grinding up some kale and spinach and making a green smoothie, right? I mean, so that's why people will go for the easy path. And that's why I showed you that slide with success and all the other things people don't see. They don't want to put in that. And that's what it is. So to even elaborate on that, because that's a great question, is in order to implement all these good habits, it has to start with clarity. It has to start with ambition, right? And if that is strong enough, like for us, at next year, like the why is so strong to",
    "metadata": {
      "domain": "Mindset",
      "topic": "Habits",
      "content_type": "Story",
      "timestamp": "15:11 - 16:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "disrupt tech education, to be able to impact millions of potential lines. That why is so strong so the late nights doesn't bother. The mentoring one-on-one, doing like everything we need to do doesn't bother because I could see how much good it's doing, right? So finding that purpose, finding that why is super important because that's going to plow you through all the hard stuff. Cool? Any other questions? On habits? Can you let me borrow a raised necessity? Raising necessity. Raising necessity is really important. It's really digging deep into almost your purpose, like your clarity. But raising necessity is like, why do you have to do that? We have, I forget what module, module one or two, where you set up your vision board,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "16:09 - 17:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "and we'll talk about that. I'll show you with my actual personal vision board. And how it's actually come to life, which is pretty cool, some aspects of it. Raising necessity is like, maybe you need to take care of your sick mom, right? Is that a necessity? Are you raising necessity of why you need to get somewhere or comfort something? That's powerful, right? So you need to bring something to the table where it's like, it's so powerful, it moves you, right? It's a necessity. It's like, I said, like this Friday, I'm going to teach a lot of class, you know, that raised necessity. I had to, I couldn't let you guys down, right? So raising necessity is super important, and also putting states in the ground, right?",
    "metadata": {
      "domain": "Mindset",
      "topic": "Raising Necessity",
      "content_type": "Advice",
      "timestamp": "17:04 - 17:58] is super important, and also putting states in the ground, right?",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "A lot of people, you know, will find more success if they go to the gym with a partner for accountability. Hey, we're going to meet up for 30 over here, hit the gym, and you do that and brings accountability and raise necessity, you know? So you can use it around your life. Makes sense? All right. Any other questions on habits? Good habits, bad habits? I would say like some good habits that I could share with you is, you know, making sure that your habits are actual, like, like a ritual, like, like just like you're going into the gym, making a routine, and then it's easier to do. So instead of trying to get a good eight hours of sleep, figure out like a routine, and this word discipline comes in.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Habits",
      "content_type": "Advice",
      "timestamp": "17:55 - 18:44",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "this word discipline comes in. And I think on our team, like the biggest person that has the most discipline is my CT of dyke. From Japan, this dude's got, like, he owns the word discipline. And then actually, I was surprised when it was BAMS, number one on his top five strengths. You know? He has a routine, like, he has a specific way he works, he sleeps, like, everything is routine. He has a routine, like, he has a specific way he works, he sleeps, like, everything is routine. And if you can get your body into that, it becomes like second nature, right? So it's like my meditation, like, making that a routine, making your breakfast and a routine, my healthy breakfast, you know? Like, going to the gym, exercising routine, like, you know, taking those breaks when you need to.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Discipline",
      "content_type": "Story",
      "timestamp": "18:42 - 19:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "need to. Doing whatever to increase your productivity, finding those good habits, and then trying to do it, and finding what works for you. Because we're all different. I'm not going to say, hey, just need a meditate, or, Juan, you need to, you know, eat a green smoothie, drink a green smoothie every day. But, no, you find what works for you, but you know, you all know what's what you're doing bad, where you can take out, where you can do good, like, you know? And raising necessity is also important, because, like, imagine if you're, like, needed to do some, so much stuff, but you're procrastinating, which is a bad habit, right? You procrastinate, never get things done, and you're like, binging on Netflix or whatever, what is that going to do for you, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Productivity",
      "content_type": "Advice",
      "timestamp": "19:25 - 20:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_24",
    "text": "what is that going to do for you, right? You're going to be wasting time, you know? And I'm a culprit, like, I've done that, binging on Netflix and watching, you know, like, next season, next season, you know? So replace good habits with bad habits, replace bad habits with good habits, and then you'll find that, wow, you'll see some of your goals getting accomplished a lot quicker, right? And setting deadlines, setting aggressive goals, I think, is super important too, as part of habits and rituals. So this is, like, sub-edite, how extraordinary people become the way they are, right? They have these, they did research on hundreds of thousands of people, and, like, the top 3,000, like, they found these patterns across the top 3,000 highest performers, you know, in the world.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Habits",
      "content_type": "Story",
      "timestamp": "20:05 - 20:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_25",
    "text": "in the world. And they do it without burnout to tea, you know, things like that, because they focus on these six areas. So, see, so what stops us from achieving our goals, you know, bad thinking, bad habits, bad relationships, like, you know, kind of touches up on a lot of these areas as well. All right. Any other questions? One thing that I want to share with you really quick is, when I was reading this book, and also, I actually went to the high-performance academy seminar with Jacob. It was kind of our reset for our team, just, you know, the founding team to go and recharge. But what one thing that struck, according with me there, is when he said that people sent ambitious goals, is that they don't want to sit in ambitious goal due to fear.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "20:56 - 22:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_26",
    "text": "ambitious goals, is that they don't want to sit in ambitious goal due to fear. Like, that's the number one thing that stops us. Isn't that crazy? Fear. Fear of loss or fear of this pain or suffering. They don't want that, you know? So I think once you just shift your mindset then and embrace that, like, the hard work, like, like, the struggle, they have a great, um, slogan called, honor the struggle. I got one of the t-shirts and then bring the joy with another team that they had throughout the event. But it's so underutilized people underestimate, you know, where instead of embracing a day, like, look at it as, like, you know, a setback or failure, you know? So, all right. That's a wrap.",
    "metadata": {
      "domain": "Mindset",
      "topic": "ambitious goals",
      "content_type": "Story",
      "timestamp": "21:55 - 22:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522032",
      "source_type": "Course"
    }
  }
]