[
  {
    "chunk_id": "chunk_1",
    "text": "Let's talk about social networking. Now social networking, very untapped opportunities here. One is recruiters. Workers get paid 20% of the first year salary. In our career field, as we work our way up, that's a lot of money. They're incentivized to push you into this role. Especially if there isn't a strong pool of candidates. You're the best person. You're the best person that they've seen. They want to close that commission check. Why? Because they're going to make $10,000 to $20,000 to $30,000. Really building relationships with certain IT recruiters, there's so many IT recruiters in agencies. Every other week there's one poppin up. I remember in Atlanta, Georgia, there were 200 IT recruiters in agencies.",
    "metadata": {
      "domain": "IT",
      "topic": "Recruiters",
      "content_type": "Story",
      "timestamp": "00:00 - 01:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "I remember in Atlanta, Georgia, there were 200 IT recruiters in agencies. That's all they do is make money off those commissions, placing people in all of these unfilled jobs. Why? Because hiring managers, they don't want waste time finding candidates or like we need 300 applicants or 1,000 applicants. There's so many people just applying. So they become the filter. They say, hey, I've got top three candidates I think you'll like. And they do the filter. So if you're on the top of their radar, the next opportunity that they feel like you're a bit more, they're going to call you. So I highly recommend building a relationship with at least, you know, three to four IT recruiters and keeping that door open as you work on your career.",
    "metadata": {
      "domain": "IT",
      "topic": "Recruiters",
      "content_type": "Story",
      "timestamp": "01:10 - 02:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "as you work on your career. Next is Cisco Live. So Cisco Live, you know, I highly recommend, you know, for social networking. And you don't have to purchase the entire Cisco conference pass. If you're on a budget, you can buy what we call the social pass. It'll get you to all the keynotes. It will get you to all the networking cocktail and even the customer appreciation. Right? So that's where they'll have like this last year or this year at Bruno Mars. Right? It'll go have a concert with Bruno Mars, you know, 10,000 plus people in the stadium, all people in your world. Network system engineer managers, CIs, like they have a management track. Right? So every person you meet at Cisco Live could be one entryway,",
    "metadata": {
      "domain": "IT",
      "topic": "Cisco Live",
      "content_type": "Advice",
      "timestamp": "02:02 - 02:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "So every person you meet at Cisco Live could be one entryway, one connection away to your dream job. Does that make sense? And people don't take advantage of this. They'll go to these conferences and then do their thing, eat by themselves, like on their phone, like, don't be that guy. No. Okay? Don't be that guy. Look for opportunities. Like, hey, Joe, what's going on, man? What brings you to Cisco Live? Like, meet people. Every day, meet people. Take up, get all your business cards out, go there, and just network like crazy. All the opportunities that I've found, like at these events. Like, from recruiters here to here. Like, I'm giving you basically my playbook of aha moments.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "02:54 - 03:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Like, I'm giving you basically my playbook of aha moments. I've realized what created so much jobber's opportunity for me. Like, last few years, you know, when I was in the workforce, like, I had, I would get job offers where I would actually have the entire salary base all day, recruiters would send me that, because I'm already qualified. And they know, like, I'm a strong enemy. And like, how awesome is that? Right? When you have, you know, LinkedIn and recruiters working for you. Saying, hey, man, you need to take this job as super hot. You're a super stale startup in the valley. You're going to get these stop-compashes, blah, blah, blah, blah. Like, you know, they'll sell you on it.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "03:36 - 04:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "Like, you know, they'll sell you on it. And that's the point you want to get into your career, where this is all working for you. And how you do that is you need to start to serve in your career. So we talked about conferences. Interop is another big one for IT. Cisco Live Interop, I would say those two are the biggest ones. And then like, if you want to specialize in a particular vertical or technology like Palo Alto, they'll have their own conference, Nutanix, all these manufacturers have one of their own conferences as well. Meetups, local meetups go there. It could be maybe around, let's say, DevOps, right? Or IT automation, or it could be around Cisco DNA. Maybe you can spearhead a meetup. All right? You get passionate about something.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:20 - 05:12",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "All right? You get passionate about something. Now, you're the thought leader. With that meetup, you spend it up. You get people to come. You get Cisco dispensable. And then meetups, you could meet people that have connections. One connection away into your dream job as well. Right? Lastly is technical training. Whether you fly out for global knowledge or any of these kind of corporate IT training companies. It's not. We know it's not for the practical hands-on. Right? It's not. You know, I love going to that for like really taking a vacation in a spot where I've never been, but mainly for networking. It's a network amongst some type group of people like in this classroom, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Thought Leader",
      "content_type": "Story",
      "timestamp": "05:10 - 06:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "It's a network amongst some type group of people like in this classroom, right? You can network because you never know who you're going to meet. Might not be today, might not be tomorrow. I met people here where like a year later, I kept in touch with them like Terry Man, we really need of the Nessie on our team. You want to move to Virginia? Like, no, I don't. You know, but like that opportunity was there. Or meeting someone like at Cisco line. And now he gave me an opportunity to make, you know, I remember back in the day, this was maybe 10 plus years ago. I got offered like 120 something thousand to come work for safety like the grocery store. Right? That's a lot of money back in the day.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Story",
      "timestamp": "05:58 - 06:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Right? That's a lot of money back in the day. So over 10 years ago, you know, like that all came from these type of opportunities. A risk to networks came from a recruiter pounding, you know, to look at this opportunity. So lots of opportunities are very untapped potential. So take advantage of that. Here's a recap. What we talked about in this module, three lessons starting off with research and studying and really conducting that recon work across those two major tools, Glassdoor and LinkedIn. And preparing your application, your resume, hitting on those projects, right? Making sure you can hack your way into the top of the pile, right? And then social networking.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "06:42 - 07:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "And then social networking. And that's another way to rise to the top of any pile of applicants is social networking. You can actually bypass entire HR teams or even hiring managers so to speak. Because guess what? If a colleague says this guy is good enough, that boss is going to take that really seriously. Right? Because usually the person that's not doing that's going to be doing a technical interview is that peer. And if your friends with that peer, he's going to be walking apart. Like, hey, let's jump on a 30 minute and it's going to be more like casual. You don't have to be like how do you know? Because managers do not ask technical leaveers out. They try to go on personality questions. Right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "07:26 - 08:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "They try to go on personality questions. Right? It's very rare that hiring managers at least in our world are going to ask you the real deep dive technical question. You bring your passion and your energy and enthusiasm for the job. That's going to be the checkbox for you. All you need. Okay? So, show you how to network in different opportunity environments, how to tap into recruiters, different events. And that really finishes up. Module four, guys. Hope you guys enjoyed it. And we'll move into some Q&A.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "08:07 - 08:47",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073178",
      "source_type": "Course"
    }
  }
]