[
  {
    "chunk_id": "chunk_1",
    "text": "Alright, so guys, Q&A, let's get at it. Who's got the first question? Alright. You mentioned the fundraising rule between manufacturers and bars, not picking up each other. Yes. If you are in a bar of a certain vendor, is that still seen as a no-no if you are looking for a position in another manufacturer? Actually not, that's a great question. So if you're working on the partner side and you're trying to get into the manufacturing side, so let's say you're here as a senior engineer and you're working with, let's say, Cisco a lot. You're here as a senior SC on the partner side and you're trying to get into the manufacturing side. You're playing in the major links basically. But sometimes I would consider the bar SC here and the manufacturing SC here.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Q&A",
      "content_type": "Example",
      "timestamp": "00:00 - 01:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "But sometimes I would consider the bar SC here and the manufacturing SC here. The only reason it's not the skill level is the prestigiousness. When you're at a bar of hardware site, you're like, man, I want to go work for Cisco or I want to go work for Palo Alto or Amazon. It's a big logo. Versus a partner name you've never heard of. Or it's not branding wise noticeable on a resume. So from that perspective, let's say you're at a Cisco Go partner and you want to jump and go work for a McCaffee as a systems engineer. You can do that and it won't be a big no-no. The only problem is that you may not get the exposure and experience working on that manufacturer's product. So if you're on the partner side, how are you going to be qualified for this manufacturing",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "01:05 - 02:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "SC position if you've never installed, designed, figured that product? Whereas on the customer side and you're not at a bar, you may be working on that latest firewall and that manufacturer has opened SC-slaps and you apply for it. You've got a full project under your belt. Maybe you've rolled out a thousand phones. Now you're qualified to do that project. Does that make sense? So you can still qualify and apply, but I think the lack of experience and exposure to that product set might be the thing that hurts you. Yeah. So, the third goal, would you recommend, say, working at a bar that has partnership with Cisco? You want to get up that ladder, but if you do a ladder roll to another manufacturer and",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:03 - 02:56",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "come back to try and apply with Cisco and saying no, I was with this bar for so many years  and I had this experience for a while, reason I decided to work overheard, but I want  to apply for this opening at the manufacturer.  Absolutely.  So, once you get to the manufacturing side, no one usually goes back to the partner side,  right?  And let's do the big opportunity.  So I did that when I had a little job gap when I went from Cisco.  I quit Cisco to get into the tech startup space where I built a web app and then I had  to go look for a job.  So I went join the partner side, even though I was hesitant.  I wanted to, I was applying to Palo Alto or Ruben.  I was looking at all these other job opportunities, but the best offer was in the partner side.  So I took that, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "02:56 - 03:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "So I took that, right? Because it was the same job. But at the same time, I went from that partner to go join a RISTA networks. And it's because that partner, they didn't sell a RISTA networks, right? And so you can go from partner to manufacturer. You just have to have, you know, search and expertise in a particular technology set. It doesn't always have to be their product, but if it's another product, a competitive product, they will still hire you. And as long as you have that domain expertise, if that makes sense, like data center and virtualization, I use Cisco's product inside of now, which allowed me to go to a competitor's manufacturer side. And then you can leapfrog, you can jump from manufacturer to another manufacturer, keep doing that. Great question.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "03:50 - 04:41",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "doing that. Great question. So kind of following on what Wilder was talking about, how do you decide, is it just prestige, whether you want to be in a bar as opposed to a manufacturer or in terms of like salary wise? Yes. You know, you said the easiest way is probably through a bar, right? But what's the advantage of working at a manufacturer then? So if you're at a, and we'll talk about the ecosystem in the next module, I believe, but I'm going to touch upon a couple of things. So here's this ecosystem of manufacturers and then bars, right? So let's say if here, like when you're working up the pyramid, to work for a bar is going to be a lot faster, because you can actually accelerate up within like two years, maybe even three, like to go to a bar.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Example",
      "timestamp": "04:37 - 05:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "even three, like to go to a bar. For example, one of our students, Kevin Lee, he was living with his parents and one thing to go from foundation to first job, I had to do an internship at a bar, right? So if you intern at a bar and break into a bar, get your foot in the door, you can climb rank pretty fast if you get project, that project, that project, and you become an expert in rolling out a project. Because imagine if you shadow someone and learn how to do a wireless Iraqi project and you learn that like in two weeks and you just do it over and over again, you get 10 projects. Now you're competent, you can roll that project out. So you become a full systems engineer and your pay comes along with that. So within two years.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "05:48 - 06:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "So within two years. The problem here is if you want to be in SC, they're looking for some of more experience, like four minimum, but preferably eight plus, right? So it's like, they require a lot more experience, because why? They want the Roth stars. They want the A players. The insight into this industry is that, manufacturing, they don't look down upon, but it's like they're like, we're the bomb, we're the Roth stars. You know? Because why? They mentor the partner community, they teach them about them. And they have to do, they're the manufacturer, right? So SC has to know a lot more than the partners, but at the same time, like a manufacturer, like Cisco, will have advanced services.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "06:36 - 07:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "like Cisco, will have advanced services. Like they'll have like consulting SCs that they actually are Cisco-based employees. And they will do professional services on new technologies where there's a lot of ours that are doing the post-immigmentation work. So you could be an engineer working on what we call post cells or even pre cells. The manufacturing side, most in most cases, you're actually a pre cells engineer. You're planning designing. You may do some troubleshooting and configuring, because if the partner needs some help, you're like, okay, you're missing this, you know, config or whatever, and you have, you know, back in support, right? As well, and you can escalate things with the dev team or whatever on the product side,",
    "metadata": {
      "domain": "IT",
      "topic": "Services",
      "content_type": "Story",
      "timestamp": "07:24 - 08:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "with the product manager, is that on the manufacturing side, you're going to be mostly pre cells, and the bar is going to be a combination of pre cells and post cells, but most of the time is just post cells. So there's prestigiousness here, because it may take longer, like my career, I wanted to go work for a manufacturer, right? You also get stock and commissions. You're just missing other bar side as a stock, right? And the prestigiousness to go work for the next, you know, company. Now there's pros and cons of both worlds. Here you're going to work on one product set. On the bar side, you get to work on a bunch of different products, which is cool, right? You can work across the stack. So does it ever make sense whether you're in the manufacturer world or the bar world to",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "08:24 - 09:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "go to a customer? Work at a customer. Only if the customer side, like the opportunity on the customer side is huge, like meaning if it's like an architect world, you're going to manage like a team of 10 or 15, and it's like maybe I got offered a solution architect world, or a Coca-Cola. And there's the pay that comes with it, yeah. But it's very rare, like small side cases where you would do that, because you're going to make more money on this side and this side. Why? Because there's a professional services that typically turns to 25 to 275 an hour, like the centers of the world dimension data, like all these partners. And they're able to pay a lot more, right? Because they're doing the biggest projects. Roll out, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "09:30 - 10:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "Because they're doing the biggest projects. Roll out, right? So for that reason, your pay goes way up. And if you're on the partners manufacturing side, you could also, there's millionaires that came about when Palo Alto went IPO, right? So you joined a private company. It's like, you know, they just raised their CERYC round. They got, you know, 100 million in the bank and they're hiring and expanding like crazy across the US. And then you join and then you get, you know, several thousand in stock options, company IPs, oh, boom, you just became a millionaire. I knew several people that have become millionaires literally because they had stock at a manufacturer in the early stage. That's upside. That's where it gets a little fun, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "10:22 - 11:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "That's upside. That's where it gets a little fun, right? You get the base, you get the commission bonuses and you get the stock upside. Yep. Oh, yes. So, okay, let's say you already got your foundation all set up, you have your certification, you're familiar with the technology, a lot of stuff. And you're trying to land your, maybe your first down, right? Now I noticed I mentioned that the fastest way to get to, you know, a good level is to go in a bar, right? But I'm also going to assume that it may be correct me from wrong. Getting a job out of bar as a junior, how do you know level is harder than maybe a customer side? So, would it make sense then to wait for the bar job opportunity or should I just jump",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "11:11 - 12:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "into anything that will get me into the industry? Like, I help this job, I customer or a tech job just anywhere. Yeah. So, I think getting a tech job, like getting that first job anywhere is very crucial because if you can survive off that pay, like getting that job to build up the resume is crucial, right? Because like getting one year to, like those to add up, right? So, the faster you get that first job, it's great. Now, if you look depending on what city you live in, if there's only like one bar in the entire city, like it's going to be hard to find maybe vacant positions, but if you're living in a major, major metropolitan area, then there might be like, you know, a dozen bars or more, right? And you can actually look for an opening position.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Story",
      "timestamp": "12:10 - 13:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "And you can actually look for an opening position. But the key to getting into an opening position in a bar site is actually so what I would consider is wholesale. So, thank you a lot of projects, bars, right? That's how they make their money, right? So with projects, there's these basically junior roles. You could be the guy rack mounting stuff, you can be pulling the cable and like doing all the grunt work, so to speak, right? And you can be the guy that does all the grunt work. And in order to land that kind of position, what I recommend is with like Kevin's case is actually networking. So we'll talk about social networking later, but networking and having coffee and basically not asking for a job, but asking for career advice and like being passionate and really",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "13:03 - 14:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "intrigued about the bar space, right? And from there, it could lead to opportunities where you could say, hey, I want to volunteer for free, right? And from there, it becomes an opportunity to actually go into a junior role and work your way up and it's suit. Then it becomes super fast because the career progression from a bar is a lot faster because what else is up here? Like what's the next level up, right? It's an engineering. First is if you're on a help desk, what's the level up? It's like, it's very broad, you know? Does that make sense? Yeah, I think there's so many roles you could. And so I would say if you have the opportunity to break into a bar, then I would highly recommend going that route.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "14:00 - 14:49",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "going that route. Yeah, because you could also go from a bar to a customer and then to a manufacturer, right? So those would let that scare me, right? Because once you get an engineer title, now it's like free game. All right. You're live, right? Number eight, how about the IT budget? What's your question on around IT budgeting? I don't know, I'm just having it anyway. So basically, in an IT department, there's going to be these projects, right? So a project, there might be like, you know, depending on how big the company is, they have been allocated like $3.5 million to spend in the next year. In the government or the DOD space, like militaries, like IT budgets, they will spend like always",
    "metadata": {
      "domain": "IT",
      "topic": "IT budget",
      "content_type": "Story",
      "timestamp": "14:47 - 15:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "more or like everything they've been budgeted so they don't cut down the budget the following here. Remember, I was like in the military, as funny as in the Air Force, like they started like, this is like in 2001, like they just loaded up like on like 50 inch plasmus and these were expensive. They were like, man, I forget like 7,000 a pop or something like that. And they bought like, you know, 50 plus of them, like we had them everywhere in the network operations and everyone had like a, you know, two plasmus on their wall. So departments will budget a certain amount of money for IT projects for the year. So it could be like, this building, they will budget wireless because wireless gets faster with speeds, right? So maybe they'll upgrade from wireless, $82.11b to G or N, right?",
    "metadata": {
      "domain": "IT",
      "topic": "Budgeting",
      "content_type": "Story",
      "timestamp": "15:43 - 16:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "So maybe they'll upgrade from wireless, $82.11b to G or N, right? And they will need to upgrade that and they use the money allocated from the IT budget or at the beginning of a calendar year, whether it's October or December, a lot of people have like October or December. And then before the New Year kicks off, the CIO or the head of the IT department will budget accordingly for the new year. What projects do they need and how much money do they need for each project? Does that make sense? Yeah. Yeah. Yeah. Go for it. All right. I got one more question about ask away. You talked earlier about whether you can be a generalist or it's kind of dive deep into an area.",
    "metadata": {
      "domain": "IT",
      "topic": "Budgeting",
      "content_type": "Story",
      "timestamp": "16:28 - 17:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "an area. How do you decide is that more personality based or how do you decide what you want to do? Yeah. So I would say don't do it for the money, right? Don't just jump to an opportunity because it just pays more. So one is I always recommend learning across the stack because if you don't understand like security, which isn't umbrella for any products set, it's like you're shooting yourself in the foot, right? So it's very crucial to become a generalist first before you become a specialist. And then how do you decide to become a specialist is based on passion? You find something that you were like, whoa, and you want to immerse yourself. You want to start your next chapter in your career in your life learning that, right? And you're just super passionate.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "17:15 - 18:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "And you're just super passionate. For example, when I got passionate about UCS, Cisco going into the server space competing with Dell and IBM, I was just like, whoa, this is so awesome. Like UCS, the main thing that made it unique was like a SIM card. It's like a SIM card for your phone. They made a SIM card for basically server like DNA. So with an XML config, just basically a file, you could actually boot up a computer, like a unified computing system or a server, a blade server, and it would retain all the information just like your phone. I can move my SIM card to the next phone. It was stainless computing. It fascinated me. I got so immersed, I got so passionate about it. So Joe, it's like you have to find something where you get so passionate about and you",
    "metadata": {
      "domain": "IT",
      "topic": "UCS",
      "content_type": "Story",
      "timestamp": "18:04 - 19:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "want to specialize. And then everything else starts working for you. Because you become the snee, you become passionate about, you level up really fast. You find clarity. Because that why that purpose, that passion is key to driving that growth. Otherwise if you specialize in something you just hate, it's going to be the wrong move for your career. But it's also personal, too. Sometimes you want to keep your feet wet and across the field, be a journalist, and that's okay. Or you specialize in two options. You'll come across that, and you'll know if it's right based on, are you passionate about this? Ask yourself, can I do this for the next couple years? All right. Cool. All right. All right. Any other questions?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Specialize",
      "content_type": "Advice",
      "timestamp": "19:01 - 19:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "Cool. All right. Any other questions? All right. It's a wrap. All right. Thanks, guys.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Meeting",
      "content_type": "Story",
      "timestamp": "19:54 - 20:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416209",
      "source_type": "Course"
    }
  }
]