[
  {
    "chunk_id": "chunk_1",
    "text": "Hey, what's up guys? Terry Kim here, your instructor and mentor. And I want to congratulate you for actually enrolling into this course. This course will change your life. And I really mean that if you trust the process and follow through every module and also complete the homework and work sheets. So let's just dive right in. So here's what we're looking at. We're looking at seven modules for the entire course. So starting in module one, we're going to start off with self assessment and growth and self assessment and growth. We're going to actually dive into how to actually shift your mindset, right? And we're going to actually look for your strength and your weaknesses. And we'll also dive into really self realization of learning how to discover oneself. And most importantly, I'm going",
    "metadata": {
      "domain": "IT",
      "topic": "Land your dream IT job",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "to finish off this with a bonus lesson with habits and teach you how to become a high performer. And habits are super important. We're going to move into the next module, which is shortcuts to six figures. And in this module, I'm going to teach you the five step framework that I've used throughout my career that really propelled my career. We're going to go through all the phases and go through some real life case studies. And I'm hoping that you get a lot of aha moments, depending on if you're just starting your career out or if you're actually looking for that next breakthrough and trying to level up. And then we'll also dive into five steps. So I'm going to bring it down and I'm actually going to reveal my top two favorites, which is the quickest way what I believe to achieve financial freedom or to get to that",
    "metadata": {
      "domain": "Leadership",
      "topic": "High Performer",
      "content_type": "Advice",
      "timestamp": "01:05 - 02:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "six-figure mark in your career, which is very important as well. And then we're going to dive into my top 13 ways to actually get promoted. And this is a very important lesson and lesson where you can actually apply these strategies over and over again, right, throughout your career. So it's super important. I've used these tactics and strategies throughout mentor sessions with my students and also with just applying it myself and getting those promotions after promotion. We'll dive into that with real case studies. And then next is, well, the bonus lesson for module two, which will be about leveraging trends and that's very important as well. And I'll teach you on how to leverage that throughout your career. And then we'll move into module three where you actually can now discover that dream",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Advice",
      "timestamp": "02:01 - 02:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "job. So this is a super exciting module. In this module, I'm going to teach you how to understand the big picture of the IT ecosystem. And then we'll actually whiteboard the entire ecosystem so you understand and inside and out from an industry perspective and you'll be able to understand where all the opportunities lives within the ecosystem. So that's super important. And then we'll actually talk about all the different career paths. Maybe you want to go down the technical track. Maybe you want to become a manager or CIO one day, okay? Right? So we're going to talk about all the different career paths available to you and break them down. And then we'll also do some actual activities together or you can follow along in your homework",
    "metadata": {
      "domain": "IT",
      "topic": "IT ecosystem",
      "content_type": "Example",
      "timestamp": "02:52 - 03:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "or your worksheets as well. Now we'll finish off this module after we build out your vision board. So we'll talk about I'll share with you my five step kind of framework to be very successful in anything you do. I'm going to share that with you in this module. It's going to be super exciting because I think you'll have a lot of aha moments when we cover and dive deep into this module. And then we're going to finish off module three by setting your vision board. So I'm hoping that you guys will be able to take enough notes or sketch out some ideas on finding your purpose, finding your dream job and getting really amped up. And I'm going to show you how we can do that together to build your future. And that's going to be exciting.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Vision Board",
      "content_type": "Story",
      "timestamp": "03:35 - 04:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "And that's going to be exciting. This is moving into module four where we actually start the preparation process. And this is very important before we actually start looking for the jobs. This is where we're going to research and use a study framework to find the employers that we want to land a job at. This is where we're going to also prepare your application. We'll talk about resumes, cover letters, and then I will also be rebuilding a secret kind of tactic that I use that actually is different from using just a typical boiler point resume and cover letter. So that's going to be very cool. And then we're going to also talk about social networking strategies that you can implement to find opportunities that don't exist on a job board.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Story",
      "timestamp": "04:23 - 05:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "to find opportunities that don't exist on a job board. And also finishing off with personal brand, teach you the strategies that you can elevate your brand so you can be in demand, in the field. So that's super, super important. That's a bonus lesson for that module. Then moving into async the interviews. Super important, guys. We're going to learn how to practice, learn, and master the entire interview process. We're going to learn how to practice the general study questions, also like the technical interview process. We'll actually do practice interviews here. Right? We're going to put you in some hot seats. And we're going to roleplay with Jacob and I to kind of give you a good understanding of how these interviews work.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interviews",
      "content_type": "Example",
      "timestamp": "05:05 - 05:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "of how these interviews work. But also we're going to show you how different interview styles are conducted within the ecosystem, if you may. This is super important because I believe each and every one of you are going to play a vital role in different parts of the ecosystem. And it's very important to understand how these interviews process work. And then making an impression, we're going to cover that as well. So you will be able to close that basically job or nail it right there in the interview. Because nine times out of ten, the interviewer knows if they're going to hire this person, right there on the spot. I can't even not. It's rare that they make the decision. They don't know if you're in the top three immediately. So that's the goal.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interviews",
      "content_type": "Advice",
      "timestamp": "05:51 - 06:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "So that's the goal. You want to be in the top three. And you want to be hopefully, you know, on the number one spot or at least run it up. Because sometimes things can happen. And just being a runner up could get you the job as well. So we'll talk about all that as well. So once you ace the interview, we're going to move into module six, the job offer and negotiation. Once you get that job offer, I'm going to actually give you a screenshot of one of my job offers. And we're going to walk through kind of what areas you can actually negotiate on. And I'm going to teach you everything I know on how to negotiate, how to accept or decline that offer or how to leverage certain situations for your favor to get even more opportunities. So we'll talk about all that.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "06:42 - 07:29",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "So we'll talk about all that. And then is finishing off the course was how to become a rock star engineer. This is super important because the game's not over guys. Just because you make it into your dream job or your next kind of phase, right, in your career. It doesn't mean it's over, right? You need to continue to grow. And I'm going to show you how to just rock it the first 90 days on the job. And then we're going to show you how to grow and stay sharp in the field. And really no matter what field you're in, and we're going to show you how to network for new opportunities. And that's going to finish off the course. You guys excited? Yeah. Yeah. Yeah. Yeah. All right.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Growth",
      "content_type": "Advice",
      "timestamp": "07:27 - 08:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "Yeah. Yeah. Yeah. All right. So let's get started.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Getting Started",
      "content_type": "Example",
      "timestamp": "08:05 - 08:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246748046",
      "source_type": "Course"
    }
  }
]