[
  {
    "chunk_id": "chunk_1",
    "text": "Welcome back guys to Module 6. Terry Kim, your instructor and mentor here and I'm super excited to get into Module 6 because this is all about that job offer and getting into the negotiation phase which is super interesting. So let's see the breakdown of this module. We've got three amazing lessons here starting off with getting the offer, right? Learning about the process and taking that offer and understanding what to expect after that interview is done is very crucial and we're going to dive into looking at an actual offer and basically breaking that offer down so we can understand what to negotiate and how to do it properly and professionally. And then we're going to also talk about how to accept and decline that offer wrapping up this module, how exciting is this.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Module 6",
      "content_type": "Story",
      "timestamp": "00:00 - 01:02",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "up this module, how exciting is this. All right, so let's dive right in. So getting the offer, I mean this is probably one of the best moments in my career, right? Can you imagine getting that job offer via verbal or via email saying, hey, we want to hire you, right? It's an amazing feeling. I remember when my vision was to land that Cisco and I got that job. I remember I was driving in my expedition. I got my phone call from my hiring SC manager is like Terry, want to let you know that you've been selected because it's always like nerve-racking, right? You know you made it in the top three. In the manufacturing one, it's like you know that you're in the top three, like hey, you're in the top three, we're going to move you to round three, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "00:59 - 01:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "you're in the top three, we're going to move you to round three, right? And then when you get that job offer, it's like this amazing feeling. You can't, you know, explain it. So this is what a real job offer looks like. You get an either verbal, like I mentioned, and then the paperwork happens, right? This is when it's official. So I've got to a job offer verbally and didn't get the official because they actually put another guy in and it's a long story, but there was some kind of favor done and this other guy that I believe was less qualified got the job through a networking, basically, relationship. And that can happen. So one thing to make sure is, you know, it's never done until you get the actual official letter. But once you get an official letter, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Offers",
      "content_type": "Story",
      "timestamp": "01:43 - 02:31",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "letter. But once you get an official letter, right? You know, I'm Terry, I kind of blurbed out, you know, the company just for privacy sakes, but you know, I am pleased to extend the offer for you as a systems engineer assigned to Alfredo, this is when I'm in Georgia in 2014 and I live for blah, blah, blah. And it's like just this kind of opening, you know, welcome, right? And then it's going to go into the details, right? The salary offer, right? Salary offer, base salary, $135,000. Now this is the salary that's negotiable, right? Why? Because when you get a job offer, now you have leverage and I'm going to talk about that in the actual next lesson. But understand this process is verbal, like over the phone with the hiring manager, usually",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Offer",
      "content_type": "Story",
      "timestamp": "02:28 - 03:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "that lets you know, or the IT recruiter or the HR department. So it's that verbal and then you get the actual official, okay? Official is when it's delivered electronically. Now you have, like sometimes though, though it's not an exploding offer meaning it doesn't terminate like within a period, but there is actually a date, like you have to actually accept, like by X-Day, or the offer can expire and they can pull it. Does that make sense? So there's usually a date, like it could be a week, it could be three days, it depends on the company. So salary is something you can negotiate. Now here's what's cool. I have kind of auto allowance, $3,600 annually. How awesome is that, right? So being in SC, I was getting paid $69.24 every week, you know, whether I drive",
    "metadata": {
      "domain": "IT",
      "topic": "Job Offers",
      "content_type": "Story",
      "timestamp": "03:16 - 04:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So being in SC, I was getting paid $69.24 every week, you know, whether I drive my car or not, you know, I have that auto allowance.  And as SCs, you work from home most of the time, but at the same time you also commute to client sites within your area, right?  So they give you that auto allowance.  Next is incentives.  So as a pre-sell systems engineer, I also had a variable bonus, $25,000.  So if you kind of tack on $135, another $36, we're looking at $140,000 give or take, another  $25,165, right?  OTE, that's the on-tarly earnings.  Now this can fluctuate, meaning if we crush our numbers and we sell a lot more stuff,  my actual MBO, or they call, can actually go up.  So this bonus can go up.  And then we have what we call a sign-on bonus.",
    "metadata": {
      "domain": "IT",
      "topic": "Salary",
      "content_type": "Story",
      "timestamp": "04:00 - 04:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "And then we have what we call a sign-on bonus. But now this was actually my second, my final offer. So I negotiated, right? I negotiated a couple key things and I want to show you how to negotiate properly.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Negotiation",
      "content_type": "Advice",
      "timestamp": "04:56 - 05:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181178",
      "source_type": "Course"
    }
  }
]