[
  {
    "chunk_id": "chunk_1",
    "text": "Terri Kim here and I want to personally welcome you to Land your Dream IT job course. Thank you for taking action and rolling into this seven week course that is going to change your life forever. All I ask of you in return is to be committed and to trust the process. This is not some course where you'll just magically see results by daydreaming about it. You will need to take action every week and if you do so you will see results guaranteed. Why? Because this is a proven system that I've used personally along with many of my students who've gone from making as little as 28,000 a year to making over 170,000 a year in salary plus bonuses using the methods and tactics you will discover in this course. You will see results within months, not years from taking this course and you'll be able",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247547532",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "to continue to use the system to get promotion after promotion and transform your life. Now let's go ahead and break down the modules for the next seven weeks and we'll go over what you can expect. We'll be covering one module per week along with specific action items you need to execute every week before moving forward. Each module may consist of worksheets, action item to do's, templates and scripts that you can use. And the goal is to complete all seven modules within seven weeks and then you'll be able to execute the plan for that promotion or dream job within months after completing this course. How awesome is that? So let's go ahead and break it down. We'll start off in module one, self assessment.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Promotion",
      "content_type": "Advice",
      "timestamp": "01:00 - 01:44",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247547532",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "We'll start off in module one, self assessment. This module is all about self discovery and will help you find your key strengths that make you unique and powerful. We'll also teach you how to change your mindset to help you fuel your growth and transformation and ultimately unleash your full potential. Next is module two, shortcut to six figures. In this module you'll learn the minimum requirements that are necessary to break six figures in salary and the most optimum path to get there without wasting time and energy in all the wrong places. And I'll show you my advanced tactics to get promotion after promotion that you can use throughout your career and moving into module three. You'll discover your dream job by first learning about the entire IT ecosystem.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Growth",
      "content_type": "Advice",
      "timestamp": "01:41 - 02:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247547532",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "You'll discover your dream job by first learning about the entire IT ecosystem. We'll go over the importance of IT architectures, trends and how you can take advantage of these huge opportunities to give you an edge against your peers. Then build out your vision board and set up a tool that you'll use to crush your goals throughout the program. Next, in module four, preparation and networking. In this module will help you build out your personal brand, will help you how to hack researching, studying along with preparing that ultimate application and everything you need to start networking for the best jobs. Then we'll go into module five where you'll learn how to master the interview process and just nail it. In module six, you'll learn how to get the job offer and negotiate.",
    "metadata": {
      "domain": "IT",
      "topic": "IT ecosystem",
      "content_type": "Framework",
      "timestamp": "02:25 - 03:20",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247547532",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "In module six, you'll learn how to get the job offer and negotiate. We'll go over the advanced tactics you need to ace the interview. And lastly, finishing the course with module seven and where I will teach you how to become a rock star engineer once you land that promotion or dream job. You'll plan out your post 90 days on the job and how you can stay sharp and continue to grow personally. I hope you are as excited as I am to start your transformation. So let's get at it.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "03:15 - 03:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247547532",
      "source_type": "Course"
    }
  }
]