[
  {
    "chunk_id": "chunk_1",
    "text": "Hey, welcome back. Terry Kim, your instructor and mentor here. And today, in this module, we're going to talk about short cuts to six figures. And we're going to break down the five step guide framework that I've used personally throughout my career. And we're going to also talk about the five path to six figures and my top two choices that I would recommend. And we'll finish things off with introducing or teaching you the 13 ways you can actually get promoted within the job. And we'll finish off with a bonus lesson on how you can actually leverage IT trends to have job security and also create more demand for you in the field. So let's jump right in. So short cuts to six figures. So starting off, we're going to break down the five step guide blueprint.",
    "metadata": {
      "domain": "Leadership",
      "topic": "short cuts",
      "content_type": "Example",
      "timestamp": "00:00 - 01:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "So starting off, we're going to break down the five step guide blueprint. We're going to deep dive into this. And I'm going to go ahead and go on the flip chart and show you how this works. And we're going to move into the five path to six figures, discover all the different options. And we're going to talk about different career rules as well. And then we're going to talk about the 13 strategies for promotion. So let's dive in. So the five step pyramid. We're going to talk about the five step pyramid. So how do you get to the major leads or your dream job? That's the ultimate kind of end goal here, especially with this course. So we're going to start off with step one. Step one is really building your foundation.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Framework",
      "timestamp": "01:05 - 02:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "Step one is really building your foundation. So building your foundation as if you were building a house so important, right? Having that perfect slab concrete board where every crack, every line is just perfectly covered, right? So building a foundation is super important because I see so many people in the field. They actually have cracks. They actually have holes in their foundation. And you can see it in the job interview process when they come up for a job interview and they can't even explain the difference between layer two and layer three. Or they can't even do simple sudden name. So there's certain things in the foundation that is super important and you'll know that it's important to route your career. Because guess what?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Building Foundation",
      "content_type": "Story",
      "timestamp": "02:19 - 03:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "it's important to route your career. Because guess what? When I even made it to the major leads, I found out in my interview process, they were still going back to the foundation for more than 50% of the questions. Actually, true story interviewing with I got a job offer at Aruba Networks. They were acquired by HP, but back then Aruba was disrupting this few years back the wireless space. And Aruba Networks, my friend went from Cisco to Aruba. And when I interviewed with them, they said, this is going to go rapid fire. I said, what do you mean? I'm going to ask you like 50 questions. And it was interesting that my first interview after getting past HR was 50 plus questions that covered up fundamentals, foundation. Same thing when I went to go interview with Amazon.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "03:08 - 04:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Same thing when I went to go interview with Amazon. Super important. So you don't want to miss on that. And how do you lay down the rock solid foundation? Well, we recommend getting your comption network plus. Why? Because it's very broad and very general. Even if you don't want to get the exam, maybe you already have your CCNA knocked out, well, I recommend it because it's vendor-neutral and agnostic. So therefore, we built that with the GAR program. So in our Zero to Engineer program, you get access to the full comption network plus, learning from the number one instructor, the network engineering in the world, Jacob Hess. Right? So he's going to teach you the fundamentals. IT essentials.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "03:57 - 04:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So he's going to teach you the fundamentals. IT essentials. He's going to help lay down that rock solid foundation. And those that have been through ZTE, module three, does that for you. And now you want to subscribe to the network world. That's what I did when I first started, got my career going, is subscribing to network world, keeping up to date with all the latest trends, the news, listening to podcasts such as Rockstar SC. I don't know if you guys heard of that. But listening to podcasts such as that is going to help you have good habits and still and also help you have a rock solid foundation in place as you move up in your career. Now step two, this is if you have zero experience, right? This is you at level zero.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "04:41 - 05:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "This is you at level zero. Now we move into step two, which is breaking into your first job. Now at this level, you know, you could be working at Best Buy Keeks Quad. You could go actually sell phones for Apple or AT&T, it doesn't matter. The goal is just to get into some type of technical job that is decent on a resume. Now if you can get into an IT team, that would be the preference. Okay? Going into an IT department, ways to break in is once you built that foundation, all you need is one cert, one cert that will actually get you job interview for that entry level job, thick help desk, thinking, interning for a value added reseller, technology, you know, consultant provider. And then breaking into that job and staying there just one to two years, max, learning as",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "05:32 - 06:39",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "much as you can and growing every day on that job. So the goal is to break into their first job, help desk, technician, being a sales rep on the Best Buy floor. It doesn't matter fixing PCs, but that's your first job, getting your foot in the door. Once you get your foot in the door, Step 3 is, so I'm actually going to say Step 1, Step 2, Step 3 is going to get into a network, role. So my first job was to help desk. When I joined the military, when I joined the Air Force, I worked on the help desk for six months, but I knew I didn't want to be stuck there. So I went from help desk to help desk supervisor and then I became a SIS add-in managing exchange and active directory. And eventually I moved into the network world.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "06:39 - 07:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "And eventually I moved into the network world. But I want to give you perspective as I came out from the military into the civilian world. So when I got out of the military into the civilian world, my first IT job was a network technical. So technician role, making $13 an hour. So any entry-level job, making $10, $15 somewhere in that range is what you can expect. California, probably a little bit higher, minimum wage. And then ultimately moving into a network role where you can go into a network admin, the network actually in your title would be ideal. Because a lot of people get stuck in different roles like doing SIS admin or things like that. They get too comfortable and they get stuck. So it's like, ideally you want to hurry up and go into the infrastructure side.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "07:42 - 08:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "So it's like, ideally you want to hurry up and go into the infrastructure side. Getting promoted to admin or engineer and that role is going to be crucial. And then this is where you want to work on your first projects. So getting a full project under your belt is crucial once you get into the network position, volunteering for the project. And you want to work on as many projects as possible. And then here is where you need to learn as much as you can through the projects. Forget troubleshooting or forget like maintaining and troubleshooting is definitely essential skills to have. But I want you to be focused on learning about projects, deploying new projects and learning the whole lifecycle of planning, design everything you did in module six and zero to engineer.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "08:38 - 09:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "So and everything you did in this class, like getting that experience is very crucial. So getting as much projects under your belt. And then I will learn from tech support and partner SIS. So learning from tech is your technical assistant center. So here's the thing here. Talk about leveraging tech and SC. So what do I mean by that? So with every project, there's going to be support. So you're rolling out a voice over IP project. There's technical assistant that comes with that. So guess who man's that technical assistant? It's engineers, technical support engineers. They really know their stuff. Now when you're rolling out a project and you have an issue or you can't figure something",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "09:33 - 10:27",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "out, you can make a phone call the Cisco TAC or let's say you're working on a firewall It doesn't matter. Whatever manufacturer you call that technical assistant and I've always leveraged the crap out of those guys. And they're all around the world sometimes. I think the best tech engineers I talked to when I was doing a call center project at the bank was talking to the team in Australia. Super smart guys. And you learn from them. You know, don't be like, hey, fix this issue. Call me when it's time. Play. No. Say, hey, can you screen share? I like to learn what, you know, where the problem is. That's what I did. Like every chance I got.",
    "metadata": {
      "domain": "IT",
      "topic": "Technical Support",
      "content_type": "Story",
      "timestamp": "10:27 - 11:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "That's what I did. Like every chance I got. Hey, screen share, can you tell me? How do you fix it? What do you do? Can you show me? This means shot. You see how that is very useful? So now you're leveraging on the job, you know, leveraging resources around you. Think of everyone around you as resources level you up. That's what people make all the mistakes. They make the mistakes like, oh, this is just a job. I can't wait till this ticket is done. I can't wait till it's out of my off my plate. And they don't treat it as a learning experience. Does that make sense? So that's tap. Leverage to crap out of that. SCs.",
    "metadata": {
      "domain": "IT",
      "topic": "Leadership",
      "content_type": "Story",
      "timestamp": "11:07 - 11:49",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "So that's tap. Leverage to crap out of that. SCs. Systems engineers come from the managed backroom world, Francisco, or also on the partner world. So whenever you're working on the project, you have systems engineers helping you want to tap into those engineers money. All right, shadow them. Look over the shoulder. All right. Don't just open up the data center and say, hey, you know, call me when you need me. I said, it happens so many times. Wouldn't you rather be there with them and try to learn from what they're doing just by looking over the shoulder is going to be so powerful. Okay. So a lot of people make that mistake when they're working on the job for the first time. They just do what they're told to do.",
    "metadata": {
      "domain": "IT",
      "topic": "Leadership",
      "content_type": "Advice",
      "timestamp": "11:42 - 12:29",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "They just do what they're told to do. So get very proactive, leverage those resources. Very key. Now once you get a project under your belt, get as many projects under your belt, and how you get tapped into those projects by the way is going to be understanding what projects are planned out for the year. So it's having that conversation with your manager, your boss saying, hey, what's the top priorities for this year? You know, maybe the bank got audited. Maybe there is a new network detection, IPS project coming about. Maybe there's an infrastructure refresh. Maybe everyone's trying to, you know, the teams trying to virtualize the teleline. Who knows, right? But if you understand what projects are coming about, you could one, maybe lead one eventually,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Advice",
      "timestamp": "12:26 - 13:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "or two, you can volunteer and assist with any of those projects. That's how you get really true, awesome experience. Now in step four, this is what I call the senior role, and getting your full stack experience. And in this step from here, once you're in a network role, you want to go into a senior role. The goal is to break into a senior role. So when I went from technician to an engineer, I went from making 13 to 25, and then I jumped to making, you know, $50 an hour. So going from like 50k to 100k. Now there wasn't, I got to 100k, but I went from 50 to 80, then to 100 actually. And there's a lot of key insights that made that happen that I just shared with you. Okay, what are the projects, right? Tapping into those resources, tax.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "13:21 - 14:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "Tapping into those resources, tax. And then leveraging those engineers, right? Leveraging tax, growing, learning. And then in between steps three and four, you're going to want to go after some type of mid-level certification, a higher certification, you know, that is usually in the Cisco's world is the NP. An NP in voice, data center, routing and switching, security, right? In my case, every time I did a project in a particular, you know, technology across the stack, I identified, okay, I need to refresh the firewalls, I'm going to get, I'm going to just immerse myself in security, okay? Got my CCSP at the time, now it's revamped to CCNP security. But I got my CCSP, Cisco certified security professional, knocked out four exams, man, got CCSP.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "14:32 - 15:31",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "got CCSP. Now I move on to another stack, right, of technologies. And then you can go across professional service. Maybe you want to get into cybersecurity. And then you go after a mid-level, start from ISC square like CISSP, right? Something that's mid-level to advance. And that's very crucial in order to go from network engineer to a senior role, a senior network engineer or team lead. Now you don't have to be a team leader per se, but I want by step four you to be, you know, at a senior level, if that makes sense, right? You actually can lead a project by yourself, okay? You're not going to be able to go from step three to step four without being able to lead a project, period, okay?",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "15:29 - 16:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "a project, period, okay? That means you're still stuck at three and you're still learning and you still have to level up. Once you get comfortable it's going to click, you're going to be like, whoa, I know how to lead a project. And guess what? Once you lead a project, you don't even have to know everything. You can understand how to plan, how to get quotes, how to leverage SCs from the partner and we'll talk about the ecosystem later, but SCs from the manufacturing world, the consulting world, and leverage them to learn from them and let them educate you, right? And that's going to help you be able to basically get a project and lead a project. So more projects, more certs, try to break into a senior role as possible. And from here, I was able to go from 80 to 100, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "project lead",
      "content_type": "Advice",
      "timestamp": "16:20 - 17:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "And from here, I was able to go from 80 to 100, right? Or I went from 50, 80, 100, like in between here, right? And that all happened within like 10 months. Now from here, what I saw is the actual drain jobs and we'll talk about the ecosystem a little bit later, but this is where I saw the SC positions in the architects. So when you're in this role and you're leading a project instead for, now you get to work with the vendors, the manufacturers, the consultants, you have direct line. For the champion in the customer account, right? And you're basically being able to work side by side with them. And that's when my light bulb moment went off, where I was making 80 and I saw an engineer on the partner side making 150.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Growth",
      "content_type": "Story",
      "timestamp": "17:07 - 18:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "on the partner side making 150. I was like, whoa, you just work on projects after projects and you make double when I made it. I was like, how do I get to where that guy is at? I want to beat this guy. I know I can beat this guy. That's that whole mindset comes in, right? And now I believe I have the potential because I saw him do it. I saw him, I looked over his shoulders. When he was setting up a remote branch, we had to set up 15 more remote branches throughout the Gulf Coast. He set up the first branch. It was in the state and it worked. We had bought like 50,000 professional services, right? Because customers pay these consultants like 225 and hour to get these advanced projects done.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "18:10 - 19:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "done. So what if you could learn that? Would that give you leverage to level up or get promoted within the company? Absolutely. Because you know, I could be making 50 bucks or even 60 bucks or 70 bucks an hour and still it's a lot less than a company having to pay to 25 and hour. Does that make sense? So you know, when I saw that opportunity, I said, hey, show me how you're rolling out this branch. So it's like branching the box. I saw G2 sitting in all up, getting up and running and what I found is that it wasn't that hard. I looked over his shoulder, saw, configured the switch, the wireless, the phone, the QOS policies. Actually QOS was done with auto QOS like, whoa, that's actually cool.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Story",
      "timestamp": "18:59 - 19:50",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "Actually QOS was done with auto QOS like, whoa, that's actually cool. There's all these things that can be learned. Any skill can be learned, right? The repetition. So after he set up one branch, long story short, is that I felt confident that I believed that I had the potential to learn. So I took massive action, learning it, and then I rolled out the remaining 12 branches. I said, I'm going to do this. Sorry, I don't need you, Mr. Consultant. I'm going to do this. So understand that there's this whole world of the major leagues that comes into play. So once you're ready, right? But don't be premature about it. Learn as much as you can. And that's due projects and getting multiple certs.",
    "metadata": {
      "domain": "IT",
      "topic": "Learning",
      "content_type": "Story",
      "timestamp": "19:45 - 20:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_24",
    "text": "And that's due projects and getting multiple certs. In the multiple certs, I'll talk about the five paths to get to six figures. But ultimately, you can get two. We'll talk about the ecosystem later. You can make six figures being on the customer side. There's only 350 employees at this bank. They never thought they were going to pay anyone six figures. I think at the time, the VP was shocked at how he was trying to make six figures, because he wasn't making it. Right? But it doesn't matter. It doesn't matter if someone's not making something. It's how much value you break to an organization. That's the end, right? Because for you to get a raise, you have to get a raise. Absolutely. You know?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "20:29 - 21:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_25",
    "text": "Absolutely. You know? And that's a great point. Jacob makes, because what's important in your environment is if you can, and I'll talk about this as another lesson, I'll talk about a point under a lesson is that if you make the manager successful, you become successful. And that's one thing I'll talk about when you land your first 90 days on the job. So break into the senior role. And now, we'll talk about this ecosystem a little bit later, which is going to be some aha moments for you. Step five, join the major leagues, right? And here is when you join the major leagues, you can, out of two options, you can become a generalist like I was. So I can go walk into a room, I can whiteboard UCS unified computing systems and talk about",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Advice",
      "timestamp": "21:06 - 21:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_26",
    "text": "hyperconvergence and I can talk about virtualization and server technology. And then the following next week, I can walk into a room and another client and talk about voice over IP. So you can become a generalist across the stack, which is perfectly fine. And you can design and create solutions for your clients across the stack, which is awesome. Or you can really deep dive into specializing in one area. Maybe it's intrusion detection. Or maybe it's collaboration, voice and video systems. You're an expert in that. So two ways to go about that in your career. Specialize or generalize. Can't go wrong with either case, but if you do specialize, make sure you specialize in a hot sector. Don't specialize in something that's kind of like dying.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "21:57 - 22:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_27",
    "text": "Don't specialize in something that's kind of like dying. I want to specialize in routing and switching when SD and ST is super hot. I specialize in SD and technologies. Versus just learning BGP and OSP, and unless I'm going to go to a service provider and they really need a lot of those skill sets around that particular set of technologies. But if you're going to specialize in something hot and you'll learn about why that's important when we talk about IT trends and how to leverage that. In step five, to really leap frog like I went from, you know, let's say, here 80 to 100K, in a senior role. And here, you're looking at anything from like 40 to 60. Or even a little bit higher, 40 to 60 in a junior role as you move up, 80 to 100. And then what I found is wow.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "22:54 - 24:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_28",
    "text": "And then what I found is wow. At this advanced level, you can actually make on the 100K to like 300K. Like, it's not uncommon. It's crazy in our field, right? You don't have to be a spine surgeon or a brain surgeon to make 300K. You could actually be a dead work engineer. Crazy is that, right? So, you know, if we look at Fortune 100 companies in this range, they have an engineer's head down level. They're usually called architects. The systems engineers are usually known for more, that job title is more popular and used in the manufacturing world and the actual value added reseller world, the partner world. Okay? So, if you go work for a Fortune 100 company, that's going to be like a Coca-Cola, the Home Depot's of the world, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "24:02 - 25:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_29",
    "text": "Home Depot's of the world, right? Why? Because that Fortune 100 company has a massive IT department. And the bigger the IT department, the bigger amount of employees are go by employee size, right? They're going to have massive projects for you to be able to bring value and work on an architect and design. Why? Because you become that in-house architect that the team trust on you. Sometimes these IT teams that Fortune 100 companies, they don't trust the vendors. But there's always a champion inside an account. So that's another key insight. We talk about projects, is that when it comes to projects, there's a champion. The champion is someone that leads the project, or is an insight man, right? That works with the vendors and whatnot.",
    "metadata": {
      "domain": "IT",
      "topic": "IT teams",
      "content_type": "Story",
      "timestamp": "25:04 - 25:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_30",
    "text": "That works with the vendors and whatnot. So you could be that champion as you go into a senior role in your leading projects, because ideally you want to be there and you want to learn the ropes. Because if you want to make that shit, whether you want your own consulting company one day, has an IT consultant agency, or maybe you want to become an SC or an architect or specialized, working for a manufacturer like Cisco, Amazon, Uname it, or working for a Fortune 100 company, you're going to see that salary, no doubt about it. 100K, 300K. And we'll talk about a little more about, well, I think this is a good topic to talk about. So if you do work for a manufacturer, you will also get bonuses, right? And I'll show you one of the job offers later, but bonuses and also commission, especially",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "25:50 - 26:42",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_31",
    "text": "if you become a systems engineer on the pre-sell side. So that's super important to understand, because there's a lot of upside by moving into this world. Now, manufacturers, Cisco, Amazon, and then we'll talk about the ecosystem, but lastly is a partner side. The partners are the ones that actually sell the manufacturing products, like all this gear over here, you know, to telephone systems, the infrastructure, right? All that is being packaged and designed from the partner side. And there's going to be an engineer, like when I used to work at Dimension Data, when a Cisco's largest global partners in the world, they sold over a billion dollars to Cisco stuff. So when you're going into client meetings, what happens?",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "26:42 - 27:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_32",
    "text": "stuff. So when you're going into client meetings, what happens? An account manager has an account and tied to them is an SC, a systems engineer architecting, designing a solution for that client, okay? So that's the five step pyramid to join the major leagues. And I went from customer operations, working my way up, ultimately to senior, this could be at one company or it could be at many companies, okay, depending on your career path. Now from there to get to what I call the major leagues, all of you guys can get there. Anyone can get there, right? It's not that hard to get there, guys. All you have to do is understand projects and understanding technologies. And then it becomes really cookie cutter here, but you're still always learning new stuff.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Path",
      "content_type": "Advice",
      "timestamp": "27:26 - 28:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246822580",
      "source_type": "Course"
    }
  }
]