[
  {
    "chunk_id": "chunk_1",
    "text": "So starting off with the girls mindset, right? Girls mindset is not about how good you are. It's about how great you want to be. Think about that for a moment, right? It's not about how good you are. It's about how great you want to be. So it's not that current state, right? And I love this quote right here. The only limitation is that which one sets up in one's own mind, right? We've all been there, right? I've been there. I'm not good enough, man. I don't think I can do this. It's a self-doubt creeping in your mind, right? And you want to eliminate, you want to zap that, zap those negative thoughts. And we'll talk more about that when I go into fixed versus gross mindset, which is very polarizing. And this is super important. So let's look at another quote.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Girls Mindset",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "Whatever the mind can achieve, whatever the mind of, whatever the mind of man can conceive and believe it can achieve, right? Another important kind of concept here, right, is that you have to believe in your mind first before you can shift your mindset, okay? And you have to imagine, we're going to talk about how you can visualize things and how you can shift your mindset before like new opportunities starts just opening up in your reality, in your own world, right? So this is super important. So let's go into the whiteboard, the flip chart, and talk about first, I want to talk about fixed, first, gross mindsets. So if we look at someone that has a fixed mindset, versus a gross mindset. So there's some key things I want to talk about. So some key things I",
    "metadata": {
      "domain": "Mindset",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "01:05 - 02:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "want to talk about is challenges, okay? When we see challenges, what comes to mind if someone has a fixed mindset? So for example, if they look at a challenge, what do you think someone would think if they have kind of a fixed or negative mindset? Anyone? I'm not prepared. Yeah, I'm not prepared. They feel like that challenge is just not doable maybe, right? That, you know, it's too hard. So let's talk about, I'm going to go ahead and write down some key things that if you look from a perspective of someone that has a fixed or gross mindsets and we're going to cover challenges, we're going to cover obstacles, effort, criticism, and success of others. So this is our box of five things that we want to identify when we talk about having a fixed or gross mindset. And if we look at someone that has a fixed mindset, they're going to look at that",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "02:09 - 03:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "challenge and they're going to, you know, doubt that challenge. They're just not ready for it. They're going to be like, you know, I'd rather not do it, you know, they're not looking forward to it, right? So maybe it's like, too hard versus someone that has a growth mindset is going to actually look at that challenge and embrace it. Like all of you that came here and that has actually, you know, you're looking forward to the new challenges, the new projects, the new hands-on, the new labs, right? It's all new to you but you embrace that, right? So that's super important. Now if we look at obstacles, right? If you have a fixed mindset, what's some thoughts that come to mind? Someone that has a fixed mindset, doubt, you know? How up fear? And how about someone with a gross mindset? How would they",
    "metadata": {
      "domain": "Mindset",
      "topic": "challenge",
      "content_type": "Story",
      "timestamp": "03:32 - 04:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "look at that obstacle? Open? They can open to it. Optimistic? Right? They look at that obstacle as just another obstacle. They look forward to it, right? And this is so important. If we look at whether it's challenges, obstacles, there's a huge difference between a person that has a fixed mindset versus a gross mindset. Now how about effort, you know? If we look at effort, what's someone that has a fixed mindset? What would they imagine in their head? Minimal effort. Minimal effort, right? They want to do the minimal. Minimal effort? Minimal effort? They want everything handy to you. Yeah, they want everything on the silver platter, right? Yep. How about someone with a gross mindset? Proactive? Do whatever it takes. Right? So having a gross mindset, they look at effort as the amount of work they're not afraid to",
    "metadata": {
      "domain": "Mindset",
      "topic": "fixed mindset",
      "content_type": "Advice",
      "timestamp": "04:48 - 06:20",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "put in the work, right? Because they know that if they put into extra work that they're going to get the actual results. So super important as we think about, you know, having a fixed mindset versus a gross mindset. So if we look at criticism, right? Someone with a fixed mindset is going to take criticism as harsh. They're going to be like, whoa, why is this kind of telling me this? Right? And they have this kind of negative, you know, notion of like, oh man, this guy is trying to teach me this or tell me about this. And you know, like the fixed mindset is like, you know, I don't need to, I don't need to be open to this. Right? And it's such, you know, as such as negative thing towards when you want to grow, because with a fixed mindset, you're not being open to people actually giving you criticism so you can improve on your weaknesses.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "06:20 - 07:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "Right? So like someone with a gross mindset is going to like really want criticism. Right? They want to take constructive criticism. Right? They want to improve. Right? How about successive others? Someone with a fixed mindset versus a gross mindset, they may Right? How about successive others? Someone with a fixed mindset versus a gross mindset, they may look at the success of others and they really fear the success of others. You know? Right? Versus like someone with a gross mindset will look at someone that's super successful and get Right? Versus, you know, in your workplace, like you see someone successful in your fear, your fear of them taking your job or whatever, right? The case. Like someone with a fixed mindset is going to see the success of others and be like, oh, that person, you know, was born rich or born successful with it. They were handy them something or, you know, it's this kind of negative,",
    "metadata": {
      "domain": "Mindset",
      "topic": "fixed mindset",
      "content_type": "Advice",
      "timestamp": "07:16 - 08:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "kind of judging almost, right? Which is crazy. But people do this all the time. And if you think about people that have a fixed mindset, you probably can already, you know, picture some people that you've crossed in your life, right? That had this fixed mindset, you know? Or they're like, oh, man, that person was born with a higher IQ. That person, you know, is white, you know? Like, can you imagine if you went to someone and said, hey, you know, can you be a little more white or a black or Hispanic? Right? I mean, you would never tell someone like that, right? But it's so funny how people have this fixed mindset of like just judging people's situations and things like that. And they don't want to grow because they think it's, you know, it's, they're in some type",
    "metadata": {
      "domain": "Mindset",
      "topic": "fixed mindset",
      "content_type": "Story",
      "timestamp": "08:30 - 09:19",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "of situation that handcuffs them, right? So we need to kind of shift our mindset, you know, from going from anything that's fixed to a growth mindset. And with a growth mindset, this is super important. Success of others, you can find mentors throughout your career in your life and find the success of others and get inspired by them, get motivated by them and then actually learn, learn from someone that if you want to get anywhere in life, whether you want to be a systems engineer architect, CEO, like, it doesn't matter, right? Like, whatever profession finds someone that's, you know, in that spot and then learn from them, right? And it's being about humble and being, you know, open minded, right? And that will entirely change the world. So I want to talk about",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset Shift",
      "content_type": "Advice",
      "timestamp": "09:19 - 10:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "what next is, so guys, does that make sense? The fixed versus growth mindset? Yeah. Awesome. So what's important here is, I'm going to actually talk about kind of what really I've used throughout my career and throughout my life is that if we look at mindset here, okay? I want to talk about potential. Okay? So once you have that growth mindset, you know, understand that you all have potential. You have amazing potential that's hidden, unlocked, all of us, okay? All of us? I mean, who in the room is perfect and leveled up to the highest degree? No one, right? Right? So, you know, we can all improve and we can always all level up, so we have this potential inside of us. So if we have this potential inside of us, what do we need to do? We need to take action, right? And I'll tell you a story. I think it's from the 1950s. There's a",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "10:08 - 11:29",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "guy named Roger Bannister that was training to break the first, be the first man on earth to break the four-minute mile, right? And he had, he knew he had the potential for whatever. Maybe he dreamed it. He just, like, that was his ambitious goal. No one's done it, right? And there's always someone that hasn't ambitious goal. So he took massive action, right? He took massive action training every day, every day, until he could break that four-minute mile. Because he wanted that result. So he took massive action, got trained, got trained for it, and he got the result. He broke the four-minute mile. And that creates a belief system where you get confident, you know? This is super important. Because anything we do, you know, we're learning something,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "11:29 - 12:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "we get confident. And now, you know, our self-esteem grows, our self-realization grows, like we start understanding our strengths now. And you are able to build upon that. And this is super important. Why? Because that allows you to tap into more potential and level you up. So Roger Bannister, after he broke that guess what? Everyone else said that was, you know, into running, said, wow, if Roger Bannister could do it, I could do it. So they believed because they saw someone else do it. And this is important because once you believe that you can do it, after quotes said earlier, right? Your mind can't conceive and you believe you can achieve. So therefore you tap into more potential, you're hitting potential, you take action. And it has to be the appropriate action. You don't, again, you don't want to try to learn from someone that",
    "metadata": {
      "domain": "Leadership",
      "topic": "Self-Esteem",
      "content_type": "Advice",
      "timestamp": "12:28 - 13:27",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "hasn't done what you're trying to do, right? So with anything in life it's important to follow someone or learn from someone that has done what you want to do, right? So it's taking their appropriate action and then getting the results. So after that, you know, Roger Bannister broke the four-minute mile, like 30 plus runners started breaking the four-minute mile, right? So how crazy is that? Well it's not crazy because they see someone do it, do it. They tapped into their potential, they took action and they got their results. Now if you think about this for a second, like in your career, imagine if you saw the potential that, you know, your dream job is you want to be a network architect, you know, for Coca-Cola, right? Or maybe you want to go work for Cisco,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Potential",
      "content_type": "Advice",
      "timestamp": "13:27 - 14:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "right? And you know you have that potential, right? To reach that dream job of yours. You need to take massive action, right? And this is very important. A lot of people won't take massive action because they have a fixed mindset, let's say, they will try something and they will give up. Why? Because the effort level is minimal. They think that they can just do a little bit of work and then get the results. But someone that has a growth mindset is going to look at that effort level and say, I need to put in 10x the effort in order to achieve. But I know I can get there. So if you take massive action and the right action, you can get the results, right? But the action always is is variable depending on what time, what place, what environment you're in. So it's important to understand that this is a spiral and hopefully it's a spiral upwards,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "14:17 - 15:23",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "meaning this could be a negative spiral as well. So we want this to be a positive spiral mindset which allows us to tap into potential, take action, get results. So it's baby steps, for example, when I actually got solved my potential that I could be a network engineer, I started off, tapping into my potential, taking action, getting that first job at 13 bucks an hour which was negotiated from like 10 bucks or something like that. And going from 13 bucks an hour, getting that result, now believing in myself. But I knew I had more in the tank, right? So I tapped into more potential. And then I went from $13 to $25 an hour going from a technician to now as network specialist. So how this works is that once you get some type of result, you keep believing",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "15:23 - 16:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "in yourself and you tap into more potential and it becomes a positive spiral that keeps going up. But how do you do that? And we'll talk about how you continuously do that by performing on based on good habits that you instill so you can be a high performer throughout your life, throughout your career without burnout, the teeth, things like that. And we'll talk more about that. But this is when you get so zoned in and everything is just working and you're going into that positive spiral. And therefore you keep tapping into more potential. Whereas imagine if you thought there you had some potential, you wanted to be a network engineer and you're like, man, let me just get to CCNA. I'm going to pass the CCNA, I'm going to get my first networking job. So you study",
    "metadata": {
      "domain": "Leadership",
      "topic": "Potential",
      "content_type": "Advice",
      "timestamp": "16:35 - 17:27",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "in three months and you take all the quizzes, you go through a bunch of material, you take a course somewhere and then you pass a CCNA and you don't get the result. No job. What happens? Your police system might diminish and without the right support system, mentoring or anything, you might just shut off your brain into a fixed mindset. It's like, man, this is not possible. And what happens is you say no job, no result, instead of putting in more effort and actually getting criticism or getting feedback or fixing, why can I get a job? I thought this certification would just open up doors like crazy and you don't get the result, your police system diminishes and then guess what, you don't tap into potential. You just stay in your job, you keep doing what you're doing and you're just complacent. And this becomes a negative",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "17:27 - 18:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "spiral. You see the dramatic difference and this is so important having a fixed mindset versus the gross mindset and then tapping into the blue and making a positive upward spiral, right, by going into this. All right, so that's fixed mindset versus gross mindset and then the formula to actually tap into this and shift your mind into the gross mindset. So now let's talk about the gross mindset with another quote. There is no substitute for persistence. The person who makes persistence his watchword discovers that old man failure finally becomes tired and makes his departure. Failure cannot cope with persistence. Super strong, right? And if we think about that here for a second, we understand that that someone that gives up and doesn't have persistence, they can go into that negative spiral",
    "metadata": {
      "domain": "Mindset",
      "topic": "fixed mindset",
      "content_type": "Story",
      "timestamp": "18:37 - 19:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "and they just suck, right? Versus for example Juan, he could have gave up, he was like man, came to his boot camp, this is not me, I don't think I can do this. He could shut off his mind or he can think, you know what, there's a lot I've learned here. All these failures are, you know, because I'm not good enough, it's because maybe I wasn't prepared, you know, but I'm going to take these failures as learnings, right? And then you take those learnings and come back to persistence, you're able to actually go into a positive loose spiral again, right? And then you start leveling up. Does that make sense guys? So super important persistence is so key when I got my first job at the bank at 13 bucks an hour, my boss told me that there was no opportunity for promotions here because they've been around for it like 20, 30 years like, you know,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "19:53 - 20:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "there's no engineering positions and there was no one had the title of engineer in their job title. How crazy is that, right? So with this persistence, you can go from 1325 and we'll talk about how to create your own opportunities in this course, right? But it all starts with mindset. So this is why it's so important I just want to really pound that in you guys to understand that it starts with the mind. It really does. And I just want all of you guys to understand that is the foundation, that is where we're going to build upon and build everything, right? So both success and failure are largely the results of habit, okay? So once you have that gross mindset set and you're in your pumped up and you're motivated, right? I'm taking this course. How are you going to get the",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "20:54 - 21:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "results post in a learning, right? You're going to have to set up some really good habits. So I've got two good book recommendations that's really instrumental to everything that I'm teaching, okay? The first book I actually finished from start to finish, right? I never ever finished a book in my life. And this was when I was super depressed in one state where I was going into that negative spiral, right? Where I was getting really depressed, having all this self-doubt. And I remember this book, my one of my best friends growing up told me that changed his mindset, changes his mind, changes world. This is a book called Thinking Real Rich, right? I just read like a few pages and just put it down. And in that depressed moment, I thought, let me go and then check out this book again. And",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "21:52 - 22:44",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "I finished it. Thinking, Real Rich will actually change your mind completely. And if there's one book in the world that I would recommend starting off with this book, okay? So highly recommend this book. Once you finish that book, that really covers really all around growth and mindset. And next is High Performance Habits. And we'll talk about this in the bonus lesson. But High Performance Habits is a book that I just picked up recently. And this book is going to teach you all the right habits. And when I started reading this book, I realized, wow, there's a lot of awesome stuff here that I've been applying. You know, have good habits, bad habits, right? And it talks about all that. It talks about how to be a high performer consistently, okay? And without burnout, without fatigue, right? Because",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "22:46 - 23:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "you know, sometimes we think like to be a high performer, we have to just like go crazy, all in without any type of balance, right? And it's not true, right? There's a way you can perform high at a high peak level with consistency. And we'll talk about that. And I'll summarize actually this book in the bonus lesson. So highly recommended, but not completely required.",
    "metadata": {
      "domain": "Leadership",
      "topic": "High Performance",
      "content_type": "Advice",
      "timestamp": "23:46 - 24:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246540549",
      "source_type": "Course"
    }
  }
]