[
  {
    "chunk_id": "chunk_1",
    "text": "Welcome back guys, Terry Kim, your instructor and mentor here and I've got a bonus lesson here about personal branding. So let's dive right in. So the number one way to work on your personal brand is working on your lead to profile if you're not. So let's dive right in on how you can make this happen and get immediate results like immediately literally. So one is uploading a great picture. Don't upload a picture where you're like, I don't know, in the bathroom and beach. I've seen such like awkward pictures on LinkedIn and it's just not professional. This is not your Facebook, right? This is a professional place of where you actually put up your digital resume and you don't want others estimate the power of your LinkedIn. And make sure that you can actually do all the things that LinkedIn recommends for you to hit all star level. And you can see like throughout my career I can see like 200, 87 people viewed me.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Branding",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "And you can see like throughout my career I can see like 200, 87 people viewed me. Like I mean, it's a lot of eyes on you, you know, when you become an all star meaning you've got a great picture, you've got your shirts in there, you've got your projects in there, you've got a lot of connections. There's all these things that happen on the back end to make your rise to the top in your network. Strong summary statement. So an opening liner, whatever you want to emphasize, this is kind of the matching summary statement that you would put on your resume on your third kind of bullet point, right? Recommendations very crucial. So you want to always never burn bridges, especially before you even like leave a job, get those recommendations because those recommendations is going to tie into a time period where you worked at a company in a specific role and getting those recommendations can be your colleague, could be your manager and so on.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "01:10 - 02:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "could be your manager and so on. So getting recommendations, I've got one from Cisco, Keesler, like all like make sure you have at least three to five good rock solid recommendations. And then making sure that your skills endorsements are aligned to your dream goals, to your career goals. So maybe you want to be known as an expert and wireless, right? You want to have that skill. You want to be known as the guide in cybersecurity or information security or disaster recovery or Cisco technology, which is a broad one I like to use versus like spitting out, you know, 10 different acronyms. Something I would recommend is starting there at Cisco Technologies. That's what you, most of you guys will learn as a base foundation, building your career. Getting as many skills endorsements as important as you build your personal brand, I did this exercise with someone that had nothing at no account, Kevin Lee, never even heard of",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:03 - 03:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "LinkedIn, you know, we started from zero. Now if we pull up this profile and some amazing, you know, and a recruiter noticed that too. And then he got to get an interview with Samsung, long story short, you know, that's the two years he's working for Samsung, right? All these are the power of personal branding, very important, okay? Getting to certifications such as SSNA or CCNA and getting all that under your profile is super important. And then listing out your projects, you could even list out the full stack network project that you all worked on, right? And put that on your actual LinkedIn profile. It will stand out, right? So let's move into beyond your LinkedIn tool using that to elevate and work on your personal branding, which ties into the last one of the last lessons where you usually LinkedIn as a tool to social network is building, you know, upon a platform. So how do you build brand?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Branding",
      "content_type": "Advice",
      "timestamp": "03:06 - 04:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "So how do you build brand? You could create a blog that's focused on talking about just DevOps or talking about cyber security or talking about wireless technologies, talking about blog computing. Whatever niche area you want to talk about, building upon a platform where you can own the content, you can be the thought leader, right? Building up your website or the type of social like platform, this is all tied to personal branding. Next is leveraging your strengths. Now in Module 1, you know, you identify your strengths and weaknesses. Now it's being able to use those strengths and building up your personal brand is going all in and becoming better and better and trying to become world class actor. That's also Jacob. We are required to communicate, to speak, right? A lot by training and communicating. So it's one definitely area that we always are striving to improve.",
    "metadata": {
      "domain": "IT",
      "topic": "branding",
      "content_type": "Advice",
      "timestamp": "04:09 - 05:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So it's one definitely area that we always are striving to improve. So we're going to next week, attend, you know, world's best speaker training where we get to hone our skills. So doubling and going all in and your strengths and leveraging that to build a stronger person of brand is super important. And then becoming an expert, becoming a subject matter expert, right? In a particular area, right? So there's maybe an emerging trend and you want to jump on that trend while it's early. Well the chance of you becoming an expert on that is going to be super high. Why? Because it's so new. There's not a lot of people that have like, you know, mastered that for the 10, 10, for 10 years. And DevOps was completely new or when SD went technology was new, like you could become an expert. When Cisco came out with UCS, it was very new, the beta stage.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Improvement",
      "content_type": "Advice",
      "timestamp": "05:06 - 06:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "When Cisco came out with UCS, it was very new, the beta stage. So catch stuff at the beta stage, and that's the fastest way to become an expert in particular area. Give back to the community, right? So building personal brand, like there's so much karma wrapped around giving back, giving value to others, right? And that will open up a lot of doors for you. Start a meetup group or like using meetups, right? Creating your own group, talked about earlier, is going to really help you establish you as a thought leader. And you don't have to be the expert even in that space. You can be the organizer, right? But you bring all the people together, you know? So there you have it. That is the lesson for personal branding, hope you found it helpful, and I'll see you in the next lesson.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Branding",
      "content_type": "Advice",
      "timestamp": "06:02 - 07:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247216146",
      "source_type": "Course"
    }
  }
]