[
  {
    "chunk_id": "chunk_1",
    "text": "And then the last lesson for this course is discovery. This is a self-realization part. This is super important. Right? Self-discovery is when we go from fixed to growth mindset and then understanding our strengths and weaknesses and going through all that activity. And then you're getting able to have self-realization. This is what it is ultimately about in this module is and I want you to understand. So let's let me read this. Remember self-awareness is having a clear perception of your personality, which includes your strengths and weaknesses we talked about. Your thoughts, your beliefs, your motivations, your emotions. These are all critical to self-awareness. So people don't talk about this enough. I've realized it's really late, but my intuition really allowed me to",
    "metadata": {
      "domain": "Mindset",
      "topic": "self-discovery",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "understand myself awareness that really allowed me to accelerate in certain aspects of my life. Because if you're not self-aware, you're going to be lost. And here's the perfect exercise you can do to basically build self-awareness and discover oneself. Identify ten people in your life. Personal, professional could be co-workers, colleagues, your friends, family, it doesn't matter. But I would have some diversification actually. So it doesn't matter. Once you identify ten people, ask them to share a moment as they would remember you at your best and at your worst. Ask them for honest feedback. And once you do that, look for patterns that is repetitive. And once you look for patterns, you'll be able to see what other people's perception of you is from a strange perspective and",
    "metadata": {
      "domain": "Leadership",
      "topic": "Self-Awareness",
      "content_type": "Advice",
      "timestamp": "01:11 - 02:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "also maybe some of your worst moments. And open to that. Because this is an exercise where you're going to now build more self-awareness and you're going to be able to hone down on your strengths and weaknesses and really level up your game. So here's a quote I really love. Watch your thoughts before they become worse. Watch your words before they become actions. Now watch your habits before they become character and watch your character for it will become your destiny. So it's very important to understand your thoughts and we'll talk about that more even when we talk about discovering your dream job. About dreaming. And this is very important. And like what you say or what you do, like very important too. When you wake up in the day or remember we talked about Jacob mentioned negative self-talk is a bad thing. It could be a weakness.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "02:17 - 03:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "And what you want to do is flip that. You want to talk good about yourself. Look at them and say whatever words you need to cheer you up. You got this. You can do this. Really. Self-talk is so important because we all have this negative little bus that come in and this negative talk you might even talk to yourself in third person. We've all done it. So watch your words right because they will become your action and then we'll talk about habits too because that does become your character. And here's a canvas that I bought recently. Got it in my office. And what I see a lot of people see success you know and they don't see all the things that other people have done to get through that success achieved that success. So this is a great kind of check box to see ask yourself did I put into work?",
    "metadata": {
      "domain": "Mindset",
      "topic": "Self-talk",
      "content_type": "Advice",
      "timestamp": "03:24 - 04:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "So this is a great kind of check box to see ask yourself did I put into work? Did I put into effort? Was I persistent or did I give up? There's see there's opposites of teeth right? Like did I put into late nights that was required. It's a sacrifice right? Did I get rejected over and over? I remember when I passed my CCNA I was so thrilled. But people don't understand it is all the late nights and all the failures and the self you know doubt I had. It felt it three times. It almost gave up. So like what would have that done right? I would have never got my CC my three CCNPs across the tech stack you know because that was a requirement right? How about the discipline? Having the discipline you know taking the criticism from people. I remember when I was",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Growth",
      "content_type": "Advice",
      "timestamp": "04:20 - 05:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "young in my 20s like I hated criticism. Kid you're not. Like someone said something like Terry you need to fix it like I just hated like whatever. I didn't want to hear it you know who's been there right? So doubt failure risk like this is super important so I thought I'd throw that out there. So here's a recap today in this module we talked about having a growth mindset versus a fixed mindset and this is going to change everything and like in your world if you can adapt a growth mindset. Now in lessons 2 we talked about identifying your strengths and your weaknesses and being able to go all in and all the activities and things you can do to identify that is going to be super crucial for self-discovery where you can actually understand and build self-awareness.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Growth Mindset",
      "content_type": "Advice",
      "timestamp": "05:16 - 06:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "Okay so that's it folks I hope you guys enjoyed this module and I hope you guys can take all this lessons and apply it and I'll see you in the next module.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Module",
      "content_type": "Story",
      "timestamp": "06:13 - 06:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246633500",
      "source_type": "Course"
    }
  }
]