[
  {
    "chunk_id": "chunk_1",
    "text": "Hey guys, welcome back. Terry Kim, your instructor and mentor here. And right now I have a bonus lesson for you is around IT trends. So as you guys and Gals may or may not know is that leveraging IT trends can be crucial in your career. And let me explain. So when there is a trend that's happening, let's say for example software defined anything, meaning software defined, WAN, software defined storage. And something happens like Internet of Things or Cloud Networking. And you can be the first one in your organization or company to jump on that trend and become a subject matter expert. You actually gained so much more knowledge and confidence than all your peers because you're the first one to move into it. Does that make sense?",
    "metadata": {
      "domain": "IT",
      "topic": "IT trends",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416302",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "you're the first one to move into it. Does that make sense? And if you move into that space soon as you can, meaning when it's just a trend, when it becomes mainstream, you guess what happens? You've got job security. You've done it for four years where other people just are jumping on it. So you're way ahead of the path. And that's why it's important to understand and leverage IT trends because they come about like every few years you're going to see big trends that come into the marketplace. My recommendation is get on that trend that you find that is super early. For example, several times in my career, voice over IP was pretty much mainstream but in 2005 it was still hot. Why?",
    "metadata": {
      "domain": "IT",
      "topic": "trends",
      "content_type": "Advice",
      "timestamp": "01:02 - 01:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416302",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "it was still hot. Why? There were a lot of phone systems that were still legacy on PBX, old traditional systems. So picking up that trend created a valuable skill set and expertise that was super valuable. So next is cloud networking. So when Maraki came about, Maraki was super hot and everyone wanted to learn this new technology. And as soon as I learned it, a few years later when it got mainstream, I was in demand. So very important lesson here is pick up on the trends and we're going to go behind the scenes into the actual lesson. I'm going to talk about multiple trends as examples on how you can ride that wave of innovation and be most in demand for your next career. All right? Thank you.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "01:49 - 02:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247416302",
      "source_type": "Course"
    }
  }
]