[
  {
    "chunk_id": "chunk_1",
    "text": "So lesson three is how to build your future, okay? And this is where I want to actually, you know, emphasize the importance of the build the future you have to start with a dream, okay? And remember, one of the six important habits of high performers, they all had this pattern, this recognition of that everyone had clarity, they had really absolute clarity. If you look at it, you know, when I had all my promotions, is I had clarity. I knew I wanted to be a specialist, and then I knew I wanted to leapfrog my manager, who wasn't that much specialist, because he was in that role for like 15 years, and I knew I didn't want to be that, right? So I had absolute clarity that I wanted to be a network engineer. I knew that was me, so I acted like an engineer, I did stuff like an engineer, I thought like",
    "metadata": {
      "domain": "Leadership",
      "topic": "Building Future",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "an engineer, I breathed like an engineer, right? So you have to have that absolute clarity and starts with a dream, and this is very important because you can dream anything, and you one of you guys can dream to be anything you want in the world, literally, seriously, right? And once you dream of what you want to be, you can then, you have to actually believe. So this takes me to, I'm not sure if you guys saw this before, but I actually have a canvas in my office, and before you guys go, I'm going to give you some magnets for this, we just printed out. But it's what I call, you know, TK-5 set formula for success, and you could apply it directly in, you know, landing your dream I teach off, or just in life in general, for any kind of big, that ambition's goal, you set, you can apply this.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Dreams",
      "content_type": "Advice",
      "timestamp": "01:09 - 02:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "big, that ambition's goal, you set, you can apply this. So let me kind of break it down, and I'll show you, I'll show you with you my personal vision board, outside of my career kind of journey, because you want one for maybe your career, and then like you do in zero to engineer a program where you set up that truller board, and then you also want to set one up maybe for your life, for, you know, personally as well. So it starts with a dream, right? Anything, like, you know, I want to be an networking engineer, I'm like dreaming, I'm working on these projects, before I go to bed, I'm going to leave this project, next project, right? So it starts with a dream, well I'm dreaming that I'm going to work at Cisco, you know,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "02:04 - 02:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Cisco badge, like, I've got my Cisco polo shirt on, I'm like dreaming it, right? Then it becomes a reality, like Jacob knows, like we were at Cisco campus when we came  Then it becomes a reality, like Jacob knows, like we were at Cisco campus when we came  here as a San Jose way back, and we were going to Cisco campus, 17 building here, buildings  here, and I was taking picture, we were taking picture like this in front of Cisco building,  like this. Like, that all becomes your reality, like if you absorb it and you dream it, it is possible  that you can work there one day, if that's your dream, right?  So dreaming, dreaming that I would run a network operations team, I'd imagine, I would  have, you know, like, he's sort of, I was a network specialist, point to the guy, can  you imagine me, like, I'm dreaming, I'm like, honey, I'm going to one day, like, run a network  team, like, what?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "02:51 - 03:44",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "team, like, what? Do they have a network team? No, but I'm going to create one. It's like dreaming that you're going to have this knock, right? And you're going to have people reporting to you. Super important. So it all starts with there. And then going into that growth mindset, very important, once you actually dream, this is where people mess up. Everyone can dream, right? It's the easiest thing to do. You dream all day, right? But then do you believe? This is where you have to believe. No one else, it doesn't matter. Imagine if I started next gen, and I didn't believe, and I had this doubt, and I tried to convince Jacob to join me to disrupt tech education.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "03:43 - 04:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "to convince Jacob to join me to disrupt tech education. Imagine if I didn't believe, would that show in my communications, in, you know, my energy? Like imagine if I didn't believe, how would that affect me trying to get investors to invest in our company, right? It starts with you. You have to believe in yourself before you try to convince anyone else. Does that make sense? So you dream and then you believe. Once you believe, you can tap into that potential, to that mindset, right? Or you start taking action. So dream, believe, and then you can now create. Now once I believe that I could actually be a network engineer, I was able to look at my environment, my resources around me, and I didn't say, oh, I live in Beluxi, there's no jobs here for engineers.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "04:22 - 05:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "no jobs here for engineers. Or I'm in rural Beluxi, there's like, I need to be in Chicago and lay or New York, there's no one. no one. My fix, my sick, it could have been closed down, I could shut it off right there, right? Or I can say no, it is possible, right? And have that open growth mindset and create opportunities that I desire. I created the jobs at the bank, no one created that for me. My manager didn't create it for me. He was like, we don't have engineering positions, Terry, I'm sorry. But I created that through the tactics and strategies that I shared with you, right? So it is possible. So it's an excuse if you say, oh, I've heard this so many times, Terry, there's no job opportunities where I work. There wasn't any opportunities where I had worked.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "05:19 - 06:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "where I work. There wasn't any opportunities where I had worked. No one made above $60,000 unless you were a VP, right? So you can create your opportunity once you believe. Once you create that opportunity, you need to execute. That's that action. You take that massive action, okay? So executing is super important. A lot of people will create something like a plan, like in your case, in Module 1, I tell you how to build a trouble board and create an action plan, right? What's your 69-day game plan look like? So creating opportunity, creating the action plan, super important. Once you create that, you can now execute on that plan and you can start seeing it to come to life. You can get the results.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "06:01 - 06:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "come to life. You can get the results. But in order to get the results, this is so important. You do have to focus. So there's so many things like the next shiny object, the next thing, once you make a game plan, you have to have persistence and you have to have commitment and dedication and focus. Focus on that one thing that's going to make the impact that will give you the results you desire, right? This is the next job, next promotion. Absolutely focus, right? And I like the word focus to finish off with because I use the acronym of Follow On Course until successful. Okay. Because a lot of people give up along the way, right? So follow on course until successful and never give up on your dream. Cool?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Focus",
      "content_type": "Advice",
      "timestamp": "06:49 - 07:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "Cool? All right, guys. Hopefully that makes sense and I'm going to go into finishing off this actual module with sharing my 2015 Epic Year planned out my vision board. I have a digital vision board and I've actually had a vision board that I use court, a court board. There's two ways you can do it digitally. You can do it on trellow.com, which I recommend for digital. And then getting the court board, go to state boards, right? Office Depot, buy a court board, print out a bunch of pictures and then just pin it on your court board and create your vision of your future. Where do you want to be? Maybe you want to be at Cisco Amazon, like where you want to be at this Fortune 500 company, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "07:45 - 08:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "right? Print out their company logo, put it on your court board or your vision board. So what's interesting is in 2015, I wanted to get a thousand true fans meeting. With next year, I wanted to impact and inspire over a thousand people, right? And the funny thing is I'm able to accomplish that not only with CTA, but you to me. Put it, of course, on Udemy started doing thousands and thousands of students and I was getting hundreds of reviews. I would get emails literally saying, Terry, I'm like across the world, you know, impact center, Indian, you change my life. Like blah, blah, blah, help me find clarity, purpose on what I want to do in IT. And like that was a goal of my, you know, like in 2014, I set up this vision board. I wanted to focus, because I knew that I had this lack of focus.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "08:39 - 09:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "I wanted to focus, because I knew that I had this lack of focus. I always try to have ADD trying to spin up 10 projects at a time. So having focus, I wanted to get in. I put, you know, guy with agent dude with like six pack apps, you know, I wanted to launch a course online and I wanted to make $10,000, make $3,000, but never gave up. Ended up doing $60,000, like ways to pass my expectations, right? Wanted to get NSX certified from VMware, right? So software defined data center, like virtualization was getting really hot. So I wanted to learn that way. So NSX is another way gateway into that, which was a trend, right? What Cisco has their ACI and then VMware has their NSX play and they compete head to head in that virtualized software defined data center world.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Focus",
      "content_type": "Story",
      "timestamp": "09:29 - 10:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "in that virtualized software defined data center world. I run it, wanted to run my first 5K, but I hate running. So I found this thing called Spartan race. Who's heard of that? Anyone done that? No? Like, man, my leg cramped up so much, like it went into like a hard knock on my cat and I was like crying like a baby and I guess it was from all the exercises. Because it's like 22 obstacles. You have to go through the 5K and it was crazy, but it was amazing. So I actually put that as a challenge and I signed up for it. And what else? I'm not a lost focus. So I'm not a, I don't consider myself a gambler, but I love playing poker tournaments. Very competitive, right? It's my competitive side of me.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "10:26 - 11:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "Very competitive, right? It's my competitive side of me. So I had this vision that I would go win a poker tournament, right? So I put that on there, right? Lost focus. Crazy things. I did this tournament not in the summer, but in the fall on my birthday. And you can see like I wanted to go to the Bahamas, never into the Bahamas, never to the crews. Like planned all this, man. 2014, kid, you're not. So I go play this poker tournament not in the summer in Las Vegas, but in my hometown in Bluxy at the Boer Vodge on my birthday weekend and I take down $50,000. In a $350 tournament. You know, because I was like visualizing, I would win this tournament. And it had over 1,300 players, 1,300.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Competitive",
      "content_type": "Story",
      "timestamp": "11:19 - 12:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "And it had over 1,300 players, 1,300. And in two days, you know, 15, 18 hour days, it was crazy. It played some long poker. But I took down the tournament, $150,000. Funny thing is I actually put the entire Bahamas trip on credit card. But with the money that I want from the tournament, I was able to pay all that off. And I took my entire family, including my parents on that cruise. One of the best moments I've had in my life. And it was amazing. And it was setting this kind of vision board of building my future, right? Setting intention. And you know, as who this may sound, this stuff really does work. So consciously your brain starts working towards seeking clarity and also setting yourself up for the necessity, right? Raising that necessity.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "12:07 - 13:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "up for the necessity, right? Raising that necessity. I raised my necessity. These are all the things I wanted to do, right? Finding financial freedom. Launching a podcast. Launch that whole year. I wanted to do some charitable stuff. So ran a fundraiser for charity water. What's crazy is two years now, I would have never imagined just a few weeks ago, ran in Scott Harris in the CEO and found their charity water. Now we're running a campaign promoting that work plus and giving 100% of those donations to building wells, right? So crazy things, looking back how things all connect, right? Getting rid of all my credit card debt was huge. Going to Cisco Live, I had a, on there.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "13:03 - 13:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "Going to Cisco Live, I had a, on there. But as you can see, like your board, your kind of reality of, could come up with a live based on the intentions you set and the dreams that you set. And this is very important, you can't just do it in your head, you know? It just doesn't work. You have to use something like this or a port board and it will, the universe will start talking and listening to you, right? Literally. And you'll see that. Like every year I might not hit everything on my vision board, but I will hit majority of it, right? So I highly recommend setting up your vision board, build your future, right? With the right intention, with the right ambition, and then you'll see it come to life.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Vision Board",
      "content_type": "Advice",
      "timestamp": "13:48 - 14:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "So there you have it, that's module three and here's a quick recap. So we talked about the big picture of the IT ecosystem. We broke down the manufacturers, the value added resellers and the customer operations. We also talked about all the different jobs that are available in this ecosystem and the different career path that is available for you, whether it's a technical track or the management track. And then last, when we talked about, you know, the five step formula framework that you can apply to your big dreams and your big goals and apply that directly and to build a vision board that actually can come to life, right? And it is so powerful and I would recommend all of you to take the strategies and tactics. Make sure you do your homework and work sheets. Inside this module, apply it.",
    "metadata": {
      "domain": "IT",
      "topic": "IT Ecosystem",
      "content_type": "Example",
      "timestamp": "14:37 - 15:31",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "Inside this module, apply it.  I promise it will give you the results.  And that's it.  Thank you guys.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "15:29 - 15:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073311",
      "source_type": "Course"
    }
  }
]