[
  {
    "chunk_id": "chunk_1",
    "text": "Let's move into preparing your application. So application consists of resume cover letters and one of my secret weapons I use is presentations and I will give you the actual template. Swipe file for this, you know, your presentation audits, right? We're preparing application that you can just use at your own will. So let's look at the resume. The resume, you know, you want to start off with your education followed by your certifications. And once you do that, I like to have an opening statement, a strong executive summary, right? As my third name, from top down. And then I go into my experiences. But their experiences, a lot of people make the mistake of making the experiences too long. They'll have one job title and they'll talk about like 50 things that they did under that",
    "metadata": {
      "domain": "Leadership",
      "topic": "Application",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "job, right? You don't want to do that. So if you're thinking on which job you apply for, you list the things that is relevant to that other next job that you're going to apply for. So whether it's a management track position or a technical track, I'm not telling you to lie or mislead, but I'm telling you to use certain things that is more closely tied to making that impact, making that resume be relatable to the position you're applying. If you're applying for a technical role, you know, it's not good to list all the places where you started waiting tables, for example. You know, it's just irrelevant, right? You don't have to go that far in history, you know? Like my resume, I don't list that I used to be a bell hop. I used to bust tables.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Search",
      "content_type": "Advice",
      "timestamp": "01:10 - 02:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "I used to bust tables. I used to, you know, you know, be in construction, like, right, irrelevant. So keep it simple, keep it clean. Lots of hiring managers work in the state, a lot of people think, oh, I need to make a three-page resume. No, further from the truth. The longer your resume or thicker the resume is, if people are just going to just toss it, it's just too much, right? You want to, like, one, two pages max, right? Try to bring it to one page if you can. Two pages max. Now, after your experiences, this is what's missing in a lot of resumes. This is a big insight here in projects. People care about projects. We emphasize that from a experience learning perspective, but also when hiring managers,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Resume",
      "content_type": "Advice",
      "timestamp": "02:03 - 02:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "they see that you actually deploy a $1.5 million project and you are able to leave that for a disaster recovery, like that for mission-critical, like, those are keywords, right? And then actually save the company $X. Huge. For example, you know, this is a disaster VR, like, recovery project, I can talk about that even in the job interview process because what's important to know is what you put on here can be used as a reference in your interview process. So when you're in that hot seat later, we'll kind of mock up the interview kind of environment, is that hiring managers will be like, hey, this guy knows me and I will talk about BGP. Well, if you wrote WGP, you'd rather know it inside and out, like, the back of your hand, right? So never put something on your resume.",
    "metadata": {
      "domain": "IT",
      "topic": "Resume",
      "content_type": "Advice",
      "timestamp": "02:58 - 03:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "hand, right? So never put something on your resume. You can't dive really deep into and understand really thoroughly or explain it. So back to the projects. If I'm working on a voice project, right, and I was able to save the company $8,000 in maintenance costs monthly, you think it's important to highlight that versus just saying, I did all these ex-curticals and configured all this stuff, like, no one cares, right? A lot of people want to, like, you know, they have this ego thing and they make the resume and I have to do this, it doesn't matter. What matters is, like, did you make impact? Wow, this guy knows how to do projects. He knows how to talk in terms of ROI, total cost of ownership, like things that bring, you know, impact to the business.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Resume",
      "content_type": "Advice",
      "timestamp": "03:50 - 04:41",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "you know, impact to the business. Because a hiring manager wants to bring on people on his team that's going to make him shine and make him successful. The project's key. Next is the presentation. I've got this template that you can swipe, but I tested this, right? There's so much noise out there, everyone's doing resumes and cover letters. Now, the highlight there is making it simple, right? Clean and bringing in the projects, highlighting that. That kind of may take away on the resumes. Same thing you can do on the cover letter, which I didn't talk about, but in the cover letter, instead of saying, like, how awesome you are, talk about a project that's related to the job you're applying for. Right? Highlight that.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Hiring",
      "content_type": "Advice",
      "timestamp": "04:39 - 05:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "Right? Highlight that. Tie that together. Right? Like, you know, I think I'm best fit for this role because I've done X project that lead blah blah blah. Benefit value. Highlight all that. Right? And then here's kind of how I like to break my way into the top of the staff. So if there's 300 applicants, how do you rise to the top? Right? How can the interview all 300 people? So we're going to end it, you know, I might as an hiring manager, I'll interview five to 10 people in max, you know, but more on the five person side. Then when I was at Cisco, we'll talk about this in the next module is interview styles. And I was on the bottom interview panels like when I was at Cisco because not only do",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Story",
      "timestamp": "05:26 - 06:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "you interview with hiring managers, but with peers as well. So this is a great way to actually rise to the top of the staff is, you know, creating a beautiful, simple presentation like saying like, and this is one way you can hack this to your own low where you can just copy this straight out. Like I would say here's the top seven reasons you should hire me, put their logo over here. Like, so they're imagining like, yeah, I want to hire this guy. Like, so they're imagining like, yeah, I want to hire this guy. They're already like, you're sitting in their head. This is my next candidate. You see how clever this is? It's breaking from the noise. It's going through your strengths or your value. That's aligning to their mission to whatever that job you're applying for. Using some big visual elements here.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "06:17 - 07:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Using some big visual elements here. Maybe it's, you know, a consulting job and it requires 50% travel. I might put here like one of my strengths is I love travel, you know. So get creative and then put in a strong statement. And then you can actually finish off with I am your best candidate and here's my top 35 reasons. It just kind of sticks in your brain. But I've used this to get interviews I kidn't know at big manufacturing companies like before even applying. Now they're like interested, hey, I want you to apply. And now guess what? What happened? You're at the top of the stack. Yeah? I want to mess with 300 people. So it's about social networking, social engineering, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Story",
      "timestamp": "07:02 - 07:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "So it's about social networking, social engineering, right? And using that second tool LinkedIn to get you the contact emails to the right person. That's looking for a particular person.",
    "metadata": {
      "domain": "IT",
      "topic": "Social Engineering",
      "content_type": "Example",
      "timestamp": "07:53 - 08:07",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073230",
      "source_type": "Course"
    }
  }
]