[
  {
    "chunk_id": "chunk_1",
    "text": "And then the last lesson, right? The wrap-up this module is becoming a subject matter expert. Now this is very important in the later stages of your career as you really want to become a thought leader or carve out your own niche, right? So remember I talked about picking up on trends? Well, it's a particular niche, right? Or it's a new trend that's come out to market, right? So find something you can get really passionate about that's niche and that's new, right? And that's also, you know, it's going to go mainstream, right? It can't be something that, you know, only a certain size of the market will get involved. You want to bet on something that's a huge trend. But grab it early on, you know, we knew software defined anything was huge when that happened.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198680",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "So CISCO started going from a hardware center company to a more software center company. With the latest acquisition of app dynamics, $3.2 billion, I believe, right? Huge, right? Plays at the software side. Once you find, identify that trend or niche area that you can become a smear, learn it, and master it, right? And do it early on, that way you become a thought leader in that space. And then you become a subject matter expert. And that's going to give you so much leverage and so much, like, in demand skills where there's not enough qualified people in that particular category, you're going to get all the job opportunities. You're going to be able to go work for any company you want, right? Because there's not going to be any competition.",
    "metadata": {
      "domain": "IT",
      "topic": "Software",
      "content_type": "Story",
      "timestamp": "01:06 - 01:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198680",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "Because there's not going to be any competition. So that's key right there, right? You want to avoid competition, become a smear, and become a smear in a rising trend that's soon about to come out and go mainstream. All right, there you have it, folks. Yes, Module 7, and here's a recap on how to become a walk-star IT engineer. And we talked about the first lesson on the first 90 days on the job, right? And then, the importance of that. And to really crush it. And that's going to make a huge difference in your first job and give you tons of opportunities for your career. And we talked about ways to actually stay sharp in the industry, how to grow personally. And I also gave you my personal book recommendations that really has changed my life.",
    "metadata": {
      "domain": "IT",
      "topic": "Walk-Star",
      "content_type": "Example",
      "timestamp": "01:56 - 02:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198680",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "And I think it's very important outside of the technical learnings of this role and in this career. And then lastly, we talked about how to take and spot identifiables trends we talked about in earlier lessons and how to pick a niche and become a smear, a subject matter of expert that you can really create your own opportunity, your own be in demand, right? Where you have zero competition where you can look for and apply for certain jobs that where you know you're going to be the best qualified candidate. And that's going to be an amazing opportunity for you. I hope you guys enjoyed this course and I hope you enjoyed this last module. And you know what time it is. It's time for you to level up and be coming and walk through IT engineer. See you guys.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:46 - 03:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198680",
      "source_type": "Course"
    }
  }
]