[
  {
    "chunk_id": "chunk_1",
    "text": "So, you know, one of my classic movies, the Negotiare, who's watched that. Oh, wow! Alright? So, awesome movie, you know, Samuel and Kevin Spacey, right? Remember at the ending scene, you know, I think I'm in a very good position to negotiate, right? Is what Kevin said, to Frost, right? Detective Frost or whatever at the ending scene, and he had this floppy disk too, so I got leverage, you know. That leverage is that offer, right? If you got a verbal offer, whatever offer, now you have leverage to negotiate, okay? Same thing when I went into that entry-level job, they said, hey, you're the best candidate. Why did they hire you? Understand that you're the best candidate. You wrote, you beat everyone, right? It's competitive, think of it as a competition.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Negotiation",
      "content_type": "Story",
      "timestamp": "00:00 - 01:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "It's competitive, think of it as a competition. And once you get that job offer, now you have leverage to guess what? Negotiate all the different terms, okay? So, that's how I went from 13 or 10 to 13. Think about it this way. If you don't have the courage to actually go after, to go negotiate, is think about it. You have nothing to lose, right? The worst they can say is no. They're not going to say, oh, let's give this job to somebody else. No, they offered it to you, right? You're the best candidate they want you. So now you can ask for a better salary. So, one thing that I asked with my last job here is I said, you know, here's some things that I think I can bring to the table.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Negotiation",
      "content_type": "Advice",
      "timestamp": "01:02 - 01:45",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "That would really help expand the business because I've worked at Cisco Systems, blah, blah, blah. And I kind of highlighted, you know, my strengths and asked for a salary bump from 125 to 135, right? So I can actually ask for that grace and see what happens. Your hired manager says, you know what, Terry, I'm going to go ahead and run this by my boss and get back to you. Can I get back to you in about two days? Absolutely. So, asking, but you don't want to go back and forth, back and forth multiple times. You want to get your demands and then go ask for it. Now, if you have another opportunity, so I'd like to also, when I'm job hunting and searching, have two offers. Line it up. When you're good job, always try to get two offers.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Hunting",
      "content_type": "Advice",
      "timestamp": "01:45 - 02:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Line it up. When you're good job, always try to get two offers. Why? Because then you have this whole, don't be cocky now, but you have nothing to lose. You have leverage and you have two job offers, right? So, very important. Sign on bonus, I actually went from, you know, living in the Gulf Coast like New Orleans area and moving to Atlanta, right? So I was super stoked about that, but I also leveraged it as a way to ask for a sign on bonus bonus for relocation. I actually said, hey, can I get a relocation assistance package? And that could be anywhere from like 10K to 20K or 5K. It doesn't, like, companies, they have this policy in HR for relocation assistance, right? So, this company, they didn't have relocation assistance for at least engineers for maybe executive teams? Yes. But, guess what?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Offers",
      "content_type": "Story",
      "timestamp": "02:28 - 03:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Yes. But, guess what? I got a sign on bonus. They said, hey, we can't do relocation package, but how about if we do a 5K sign on bonus? Will that work for you? Where you can say, yeah, that worked for me, you know? It's like, yeah, perfect, you know. Got an extra $5,000 sign on bonus right here, right? Negotiating that, negotiating car allowance will actually bring your own computer, right? Hey, what's the computer policy? Bob, I'm up. I have my own MacBook. Can I, like, oh, guess what? If you bring your own computer, we're going to give you an allowance. And I forget how much it was. It's like, you know, 50 bucks a day extra. Like, how awesome is that, you know? So, I've got that, BIOC allowance, car allowance, all that.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Negotiation",
      "content_type": "Story",
      "timestamp": "03:20 - 04:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So, I've got that, BIOC allowance, car allowance, all that. You can see it up my OTE package and why is that important? Now that I have, you know, 10K, 5K, like, I've got all these allowances that allow me to go from like maybe $150,000 packet, $150,000. Now, make it look like a 170 package and super important is to climb the ranks in your career. Because that will also level you up for other offers and other opportunities. So, that's how you actually negotiate.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:00 - 04:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181218",
      "source_type": "Course"
    }
  }
]