[
  {
    "chunk_id": "chunk_1",
    "text": "Welcome back guys, this is module 5 and I'm super pumped. We're going to actually dive into async the interviews and in this module we're going to talk about how to actually practice, learn and master the different kind of processes and topics that you will need in order to ace the interview. Next we'll talk about how you can make an impression in that interview and we're going to do some practice interviews here live. So here's a deeper breakdown. We're going to go into learning about the interview process, learn about how to make a standing impression. So you rise to the top of the actual stack of the all the applicants and then ultimately we're going to go into class seats. And we're going to actually practice and practicing interviews like beyond this class with",
    "metadata": {
      "domain": "IT",
      "topic": "Interview Prep",
      "content_type": "Story",
      "timestamp": "00:00 - 01:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "your family, friends, what not, is going to be crucial. With the more preparation, the less intimidating the interview will be and then also it will give you a lot more confidence when you actually practice and practice and practice. So let's dive right in. So these are some general questions that someone on the HR side or a higher manager side will ask you. So you need to really perfect your elevator pitch. Within 20 seconds you should be able to tell me about yourself and you don't want to rattle off a bunch of stuff that is way too personal. At the same time you don't want it to be too short. So tell me about yourself. Really practice that. It's your elevator to pitch to really show the hiring manager the person that you're",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "01:03 - 02:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "a good prime candidate for the job and you're interesting too. There are some of your career goals. So this is to see if is this a job that you're just trying to fulfill for the short term or is this a job that you're looking for the long term? There can be some trick questions during the interview process to see where you're at and what your intentions are. But keep in mind you don't want to actually give away like too much like that's far fetched from the current job you're applying. What I mean by that is you don't want to apply for like an engineering job and then tell them you want to be a CIO like two years from now. Like it's just too far fetched. So talk about your career aspirations from how it relates to the current job and show",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "02:05 - 03:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "your passion enthusiasm for the current opportunity at hand. So I wouldn't go too much into the future because you might be shooting yourself in the foot literally for that. And what do you know about our company? And as people ask you these questions like the more you can articulate and answer these questions like better than other candidates it's going to put you up you know high on the pedestal basically right? Because you want to aim for the number one position you want to get into the top three that's your goal always right? Top number one ultimately runner up and then third but try to take advantage of lastdoor.com learn about a company learn about why they're expanding like what their culture is all about understand the products and solution offerings.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "03:01 - 04:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "about understand the products and solution offerings. Why do you want to work here is commonly sometimes asked. And now give or take all these questions will be asked so I've got more of these questions from a general perspective and a technical perspective in your homework work sheets. So you're going to get a copy of this and a lot more that you're going to practice on and practice on over and over. So what questions do you have for me? I think this is very important is prepare to actually ask them questions because you don't want to be going to room and then you're just getting drew with questions right? You don't want to show that you're doing due diligence to see if it's a mutual fit right? Because you don't want to look desperate at the same time you want to feel confident and",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "03:55 - 04:41",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "you want to ask intelligent questions and they're like wow this person really cares like you know. So salary is more negotiation you can go with the range if they ever ask you that now step on module one we talked about identifying your strengths and weaknesses. So here you want to really highlight strengths but then show some key examples that's going to make you stand out. Okay. Strengths by examples right? And then weaknesses you don't want to sabotage yourself by saying certain weaknesses that is going to make you look attractive for example like I'm lazy you know or I can never get to work on time like you don't want to say stuff like that so be careful about your weaknesses but frame it in a way where it actually could also be a strength but it's something",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "04:41 - 05:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "that you're you're looking to work on right? So let's see tell me something impressive you've done at work so this is really your highlight real where you're going to explain a moment where you've done something very impressive where you can impress the interviewer like well he went up loving beyond that's what you so as you go do these questions you always want to ask yourself what are the objections what's going to disqualify me for this job if I don't answer in a certain way right and come up with the best answers to enthusiasm, passion, confidence and preparation okay. And there's these like trivial questions explained to me at time when you did X or you had a conflict with a coworker or you were you were missing you were tied on a deadline there's going all these scenario related questions okay.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "05:33 - 06:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "going all these scenario related questions okay. Now these are kind of general questions but what how about some technical questions okay. Now what's on the job application is going to be super important okay. Now whatever you put on your job application your resume they're going to want to use it as a reference. Some higher managers are so lazy that they're very unprepared and they actually just read off certain things on your resume which should be in your favor because you wrote that resume right now you should be able to leverage that and go all in and make it make it shine right. But if you're going through a hiring manager and there's this multiple step process where you're interviewing with three or five people you're going to go into a technical interview okay.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Application",
      "content_type": "Advice",
      "timestamp": "06:31 - 07:29",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "okay. So I've got in the homework basically terminology is keywords that you want to master. It is over probably you know 30 plus kind of areas that you want to master beyond this but these are kind of some basic ones that I see over and over and over again that come up right. Explain to me what Spanish is as a network engineer super important to be able to articulate that. And then with any of these like you want to be able to dive deep until almost they're like at a point where they're like okay I got it you know your stuff right. So you know don't drag it out but at the same time don't give like a one-liner answer okay. Go really deep into answering that question. And you can frame it in a way well here's the basic subspanion tree and I'm going to",
    "metadata": {
      "domain": "IT",
      "topic": "homework",
      "content_type": "Advice",
      "timestamp": "07:28 - 08:25",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "explain these kind of components let me know if you need me to go deeper and then you can start with that and that is okay tell me about this. It shows your intellect right around that topic and you know how does a three-way handshake for TCP protocol being able to explain that is very important and what's cool is with any of these actual technical new recessions like most nine times out of ten there's going to be a whiteboard inside the room. Now it's your opportunity to leverage that whiteboard and go right into the whiteboard it's like I see you have a whiteboard here can I I'm better at illustrating than I love to kind of just diagram this out. Some interviews have gone to a point where like when I was at Amazon they will say hey",
    "metadata": {
      "domain": "IT",
      "topic": "interview",
      "content_type": "Story",
      "timestamp": "08:25 - 09:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "can you go to the whiteboard and explain you know how the technology works when I actually pull up a web browser on my computer open up google.com explain what happens there and I have to explain that right a lot of things that happen DNS translation like there's a bunch of stuff like that's being captured and all the technologies I'm being able to explain that entire process the more deeper die I can do the better so whiteboarding is very crucial when you want to really highlight and I think you can do that to go above and beyond and then how do I master you know learning all this is a lot of stuff right flashcards that's what these are so what I like to do is on the I go by three by five index cards I've used this throughout my career works like match so on the front of the card you just write down",
    "metadata": {
      "domain": "IT",
      "topic": "whiteboarding",
      "content_type": "Advice",
      "timestamp": "09:16 - 10:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "all the things that you want to master that might come out in the in it okay so spanning what is a network and then basically you know you'll have like your friend or if you're doing it by yourself it's fine if you're doing with someone else they can just hold the hand what is you know what is the number let me explain and then at the back of the card you write basically three to five bullets to wrap up that topic so it's basically how it triggers your brain to be able to talk about it for five ten minutes or even beyond and that's very powerful so with spanning tree it could be like three bullets where it could be a diagram TCP handshake it could be a diagram right but something that's going to trigger your brain to be able to talk about it for a long period of time and you create a flash card you know like three fifty you know to a hundred",
    "metadata": {
      "domain": "IT",
      "topic": "network",
      "content_type": "Story",
      "timestamp": "10:15 - 11:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "flash cards on different things and you can do this with your non-technical questions as well so\nnow you have you know fifty to a hundred flash cards and you're just practicing over and over and\nover again you know and do that repetitively what happens is that you become so good at it and so\nconfident at it when you're actually explaining it that they're going to see that you're super confident\nyou know because what happens is if you unprepared most people are unprepared for this like what's\nthe OSI model you know right if you're unprepared you're going to stumble you're going to like\nphysical network like you might like skid some stuff right and then they're going to see that\nversus if you're just like on it you know they're going to know that you're super confident",
    "metadata": {
      "domain": "Leadership",
      "topic": "Public Speaking",
      "content_type": "Advice",
      "timestamp": "11:13 - 12:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073114",
      "source_type": "Course"
    }
  }
]