[
  {
    "chunk_id": "chunk_1",
    "text": "Next lesson, let's talk about how to grow and stay sharp. This is very important because once you get that job and maybe your dream job or it might be a job that's going to be a stepping stone to your dream job is you need to be able to stay sharp and also continue to grow. And how you can do that is several things. One is we talked about in previous lessons it's going to conferences. Going to conferences, what's the number one objective for going to conferences? That work. That work. Awesome. You guys pay attention. It's the network. That's going to benefit you and then you expand that network. When you meet someone, LinkedIn requests. Hey, can I link the request? I've been doing a business card. LinkedIn, you can get their email, phone number, all that. Networking. Then when you're actually in your",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Growth",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "dream role or you want to stay sharp, you go to the conferences because that's where all the cutting edge technologies like Cisco is going to spill the beans on the next kind of three years out what they're working on. That allows you to pick up on that trend. So I can go to Cisco Live and I can see, oh, Cisco's super hot on DNA. That's going to be the next three years. Maybe is that something I can get passionate about? You can write on that wave. When a company that's big, they bet on something, they're going to put a lot of energy and resources. Whoever learns that stuff is going to be able to write the wave with that, especially if it gets really popular in mainstream. Next is user groups. Join as many user groups online like email threads or forums. This is where you get a lot",
    "metadata": {
      "domain": "IT",
      "topic": "conferences",
      "content_type": "Advice",
      "timestamp": "01:10 - 02:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "of good information. Even joining user group emails are very essential. They're working on some open source project. Being on those email lists allows you to be in the conversation. Tech Field Day is another one. I mentioned it earlier, but Tech Field Day, you can watch YouTube videos also on Tech Field Day. Lots of top manufacturers go to Tech Field Day. I believe it's in Dallas or Austin. They'll introduce a technology to a classroom of top leaders that work in the space. Even some top leaders that have really famous blogs and things like that. They'll bring a key product manager to talk about the new kind of hyperconversions, compute platform or something like that. Tech Field Day is another good resource participating in your local meetups that I mentioned in your areas of interest.",
    "metadata": {
      "domain": "IT",
      "topic": "Leadership",
      "content_type": "Advice",
      "timestamp": "02:04 - 03:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "participating in your local meetups that I mentioned in your areas of interest. Then if you're looking to expand your network and also learn the latest stuff and you can't afford to go to Cisco Live, then you can go to your Cisco local group, which is free. Hopefully you're working in an environment and company where you've got some Cisco technology, so you're a Cisco customer. You can go to those events. Cisco will have a local office and they have all these free events that their customers can attend to learn about something, a new technology. It's like free training. How awesome is that? That's how to really grow and stay sharp in the particular field, find that key conference user group in that particular technology and you get to stay ahead of the curve. Here's some book readings that I would recommend personally and also",
    "metadata": {
      "domain": "IT",
      "topic": "networking",
      "content_type": "Advice",
      "timestamp": "03:00 - 03:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "on the technical side. Two books on the personal side and two books on the technical side. One is Wigging the Giant Within Tony Robbins. At a part in my life, I was like, did a lot of Soul Searching and I had to really get pumped up and motivated. This book really changed my mindset and got me really apt up, so I was going to speak. We all need that kick in the bun with that motivation. I was able to use that book to create my upward spiral. That mindset shift. That stuff started working really awesome for me. How to win friends and influence people? One of David's favorite books. This book has changed the way I think about like influence. This book would help you with your social networking, expanding your networking, creating more opportunities for you and also how to just communicate and how to think about",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "03:57 - 05:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "leveraging key relationships and building an amazing network and surrounding yourself with awesome people. Those are two books that I would recommend in growing and personally. These are some technical books that I recommend that if you want to explore that other ecosystem of bars and manufacturers mastering technical service, it talks about all the deep dive into it, guys. The entire sales cycle process, the build of material, the statement of work, how to go about looking for opportunities and closing a deal with an account manager. It dyes into that bar manufacturing world at a whole another level. I think it's 300 plus pages too. This is a massive book. It's the sales engineer book. If you want to get into sales engineering, it's one of the best books I recommend. Then a novel about IT DevOps and helping your business",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "05:02 - 06:11",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "win helps you really wrap your head around how projects are done in an organization. The Phoenix project is this book and this will actually open up your eyes to a lot of aspects of being involved in a project. I think those two books are really key and you can see my book recommendation. It's not like some Cisco search book. These are skills that you're going to be able to use from a technical perspective and a personal perspective that's going to really make you well-rounded, strong engineer. I promise you. Those are some book readings to grow.",
    "metadata": {
      "domain": "Leadership",
      "topic": "book readings",
      "content_type": "Advice",
      "timestamp": "06:11 - 06:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247265305",
      "source_type": "Course"
    }
  }
]