[
  {
    "chunk_id": "chunk_1",
    "text": "All right guys, let's open it up for Q&A. Any questions on Acing the Interview Module? I was surprised with the section where you said, we'll business casual. Yes. I've never heard that before. Yep. Are there any specific recommendations obviously you said to don't go off with that? I've done that before. I'm not or I've figured that probably was seen as a negative. Is there anything that you would recommend to definitely have? And it's definitely a void. I see. I see. I mean, it really depends on the role but in our field, it's kind of weird if you see someone completely suited up for an engineer role. Does that make sense? It doesn't create red flags. It's okay to dress to impress but it also makes the interviewer uncomfortable.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Example",
      "timestamp": "00:00 - 01:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "It's okay to dress to impress but it also makes the interviewer uncomfortable. That's the key. That's the thing that I'm trying to help you guys avoid is making the other person feel uncomfortable. Because you want them to become, you know that whole psychology, you want to imitate the person that's doing hand gestures or sit like them or react like, why? Because they can relate to that. They like that. They create a decrease of bomb. So if you're kind of polarizing outfit compared to if they're very casual, then it's very awkward. Like Amazon. They say, Amazon's culture is all about being authentic and being very casual. No one dresses up there. Business casual might be even over the top. But business casual, you can get away with.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "00:58 - 01:50",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "But business casual, you can get away with. You know, like having jeans and tucked in but to not show with the time is good. That's clean. Like you want to go in with the clean look but you just don't want to overdo it. I think females can do a little more. Like polished. But guys, definitely, I never recommend completely suited up especially in this role. Unless you're going into a management role. There's so many times like, we were like, whoa, this guy. You know? Like, because I've been there. I've seen people go over the top. And like, it's not a plus checkbox. It's more like, that was kind of weird. No words. People make that mistake.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Business Casual",
      "content_type": "Advice",
      "timestamp": "01:47 - 02:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "No words. People make that mistake. Because they're doing like, I've got to dress like, you know, over the top to make an impression. It's not. You know? People like realism, authenticity. You know? And sometimes when you go over the top, it brings out the unauthenticity. Especially if you can't even pull it off or it doesn't look right. Or it's just kind of a little awkward. You know? If I was going to do a suit, I'd probably lose the tie and do something more casual if I'm going to do a blazer. Or I might just do jeans and a blazer with a nice butt to up inside. So a little more toning it down versus like, all, you know, like, cufflinks and everything. And the less you're going to do, the more management position.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Impression",
      "content_type": "Advice",
      "timestamp": "02:29 - 03:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "And the less you're going to do, the more management position. At the time, the pockets were... Yeah. It's like you're going to go to Wall Street. If you're going to go like, you know, interview for like a sales role, I would say, like, you can do the whole dressing up. Account management. But not if you're going to apply for a network systems engineering or some type of architect world. Don't do that. All right. Cool. All right. Any other questions? I would like to ask more on how to set up your weaknesses to make them look like they're strength also. Yeah. Or maybe like providing a sample. Yeah. So in example, it might be... I take on too much, then I can handle, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "03:11 - 03:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "I take on too much, then I can handle, right? Like, so that could be a weakness. But at spilled, it could be that you're ambitious. So it's reverse, you know, kind of engineering that where it's like, this is kind of my weakness and then make them feel like... Actually, that might not be that bad of a weakness. It's to basically get over the question because they're not going to keep pounding on it. Right? You're going to ask you one time, you know, or name some weaknesses. So you name some weaknesses that are a little bit light, but at the same time, it could be a weakness that where you're being open and honest about it. But at the same time, it's not sabotaging you for the job. Right? You're not shooting yourself in the foot saying, I have the worst time management skills.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "03:50 - 04:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "You know, you can't recover from that. So it's picking up a weakness where it's not too bad, you know. But you are open about it, you say, this is something I know that is a weakness and I'm always striving to work on it and here's how I'm doing it. Right? Follow up. Yes, so you're saying that the more I think not to want to expand, you're just down on that. They won't ask you to like, oh, you can't stand on why you're saying that. You can, so if you all this about preparation, so if you want to bring out a weakness, make sure you have an example of how you're overcoming that. Right? Because that way they can see that you're also addressing the weakness. Okay? So that's very key to you. Yeah.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "04:33 - 05:19",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "Okay? So that's very key to you. Yeah. And what I mean by they won't expand it, they won't just keep pounding on that over and over again. You know, it's just one of the little checkboxes they want to ask. Right? All right. Any other questions? One of the hardest questions that I find to answer is, I'm going to ask you about salad. Because you know, you're kind of trying to figure out, you know, lots of times isn't it like the first person who throws out a number always loses? So when they ask you that question, how do you navigate that? So you can use tools like class store to understand that there is a particular range for that role. And if you're applying for level one, two, three, you would go into the meeting understanding there's a particular range.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "05:15 - 06:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "And then you would say a range versus a particular number. Right? And keep the range a little bit wide. But not too wide. I'm like, I'm like 40 to 120k. But you know, you want to go into a range. And I mean, I wouldn't say avoid the question. Just answer the question. It's like, you know, I'm looking to make from anywhere from, you know, 80 to 100k. Right? So I would like get the range down to 20k based on your research. And what you can actually be suitable for. Right? Because if you're like making 40k now and you're trying to make 120, you're probably not going to have. Okay? And follow up. Yeah. So do you find that companies often ask for salary history when you're a little minor project?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Salary",
      "content_type": "Advice",
      "timestamp": "06:06 - 06:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "You know, when you're trying to earn a fair job? Not in the mid levels of my career. You know, I would say it's salary history is more when you get really high up. Right? So when you're like making 100k and more, they ask for W2s. But it also depends on the company. Some companies will just ask for last two paystubs. And then I've had like a wrist of networks ask for like last three years in my W2s. Right? So it just depends on what their HR process is like. Some will ask for three years W2s. Some will ask for last two paystubs. And they go off the last salary. And why did companies see that? Why would they want to know how much she made the past three years or the past?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Salary",
      "content_type": "Story",
      "timestamp": "06:55 - 07:41",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "Why would they want to know how much she made the past three years or the past? To see if he had consistency to justify the OTE that you're asking for. Okay. So they don't mind like this whatever the market demands. But if you may consistently let's say 125 to 175 for the past three years. And now you've upped your game and you're asking for 200 in order to move. They're not going to flinch on that. If you meet the requirements you can jump from 175 to 225 or even 250. It doesn't matter. But they just want some consistency. And they also don't want to see a gap. Big gap. Because all their red flags if you have a big gap could be whatever medical issues or it could be got fired, unemployable, things like that. You",
    "metadata": {
      "domain": "Leadership",
      "topic": "Salary",
      "content_type": "Advice",
      "timestamp": "07:37 - 08:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521979",
      "source_type": "Course"
    }
  }
]