[
  {
    "chunk_id": "chunk_1",
    "text": "All right guys, let's open up for Q&A, any questions? Go ahead, Juan. So besides Cisco Live and the other conference here, you recommend it. I don't know any other ones that you can recommend. So Cisco Live, I would start there. That would be my number one. I wouldn't go beyond that unless you're going to have a specialty focus around, let's say, learning around cyber security, you know, you want to go to SourceFire or Palo Alto's conference for that. I want you to want to do York and it was great because I was surrounded with people that are like, just geeks into learning about cyber security, information security, like it's that world. It's that group of people that you want to surround yourself.",
    "metadata": {
      "domain": "IT",
      "topic": "Conference",
      "content_type": "Example",
      "timestamp": "00:00 - 01:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "It's that group of people that you want to surround yourself. So unless you want to specialize, I would start off with Cisco and then each manufacturer that's pretty big will have its own conference. Like for Cloud, go to AWS Read event, right? That's another one for Cloud. So each manufacturer has a huge conference. AWS Read event has 20,000 people show up. And at these conferences, you take the manufacturing certifications there as well. And then you get network. Like crazy, you know? A lot of people go there to learn up on the latest technology, but also they make the mistake of not networking enough. Super important. This industry be your top number one priority when you go to these events. Network then learn. All right. Yes.",
    "metadata": {
      "domain": "IT",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "01:02 - 01:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "Network then learn. All right. Yes. So you talked about trying to get to number cruders? Yes. How do you identify which recruiters you should get to know? Because there's so many out there. So there's certain things that you look for, some questions that you would ask a recruiter to determine what you want to build a corporation for. Yes. So I would stick with first one internal recruiters for the company. So every manufacturer or big company will have their own internal recruiter. Then second, then build a relationship with a recruiter that's working at a recruitment agency that is IT focused. Start there next. Don't go to a broad recruitment agency.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Recruiters",
      "content_type": "Advice",
      "timestamp": "01:46 - 02:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Start there next. Don't go to a broad recruitment agency. So like tech systems, for example, focusing, you know that they focus on a lot of network systems engineering, IT related jobs. Right. So there's specific IT recruitment agencies that focus just in that sector. So start there. As recruiters, they're going to get someone who's just starting out. I would say just starting out recruiters is not a good option because if you think about how that business model works, is they get, let's say, 20% of your base. And if you're only making 40,000, then they're only going to bring in 8K versus if they, you know, fill a slot for 100K position, they're going to now make 20,000. Makes sense? Yes.",
    "metadata": {
      "domain": "IT",
      "topic": "Recruitment",
      "content_type": "Advice",
      "timestamp": "02:29 - 03:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Makes sense? Yes. So, you know, same amount of effort, work, and they get two times, three times the commission. So IT recruiters love it when you get to step four, step five when you're a senior network engineer or your assistants engineer in the major mix because it's hard to fill those slots. And they come with big paychecks. Why? Because your base might be, you know, about 25, right? Or OTE might be 175, 225. Right. All right. Any other questions? To be? For those four introverts, what advice do you have for them when it goes to the networking? Yeah. So great question. If you are an introvert, find your extrovert. Taking sign, right? No. No.",
    "metadata": {
      "domain": "IT",
      "topic": "Recruiters",
      "content_type": "Advice",
      "timestamp": "03:20 - 04:12",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "Taking sign, right? No. No. Don't get aside. Like, what I would recommend is really get comfortable being a little more social. And how you can do that is, I would say learn to maybe go to meet us, right? Start there and try to socialize more. If you are afraid of public speaking or communications, you can join like a toast masters club locally. It's free, I believe. And then you, anyone's been in toast masters? No. So you can do that to practice public speaking and to become, you know, a little more extroverted, right? There's not seen wrong with being introverted, but there's a lot of people that are introverts, but then they can work on becoming very sociable and they can flip that on.",
    "metadata": {
      "domain": "Mindset",
      "topic": "Social Skills",
      "content_type": "Advice",
      "timestamp": "04:08 - 05:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "but then they can work on becoming very sociable and they can flip that on. So it's like, you think it's a weakness, but then you actually just turn it on as a tactic, you know, and go into that role, you know. So practice makes perfect. Any other questions? One. When we were talking about the resume, how to kind of structure a problem. Yeah. I want to make sure I got everything. Education, certification, all things statement, experience, promise, and that's it, right? Yes. And then any miscellaneous stuff that you want to highlight, like, for example, me when I was coming out of the military, I put top secret, SCI clearance. Like, why? Because it just makes the resume pop. Oh, this guy's top secret, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Sociability",
      "content_type": "Advice",
      "timestamp": "04:53 - 05:42",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "Oh, this guy's top secret, right? So anything that is like an accomplishment that makes you pop out of the norm, I would highly recommend putting it down in the resume. It could be even volunteer work, guys, right? Anything notable, anything. Make you look more well-rounded as well. And then could you go over what's supposed to be all the cover letter again? So on the cover letter, it's to really highlight, instead of like, this is why I'm awesome. It's more about, this is how I can bring you value. And here's how I've done it in the past. And it's highlighting a project or tying a project or your experience in certain situations and making that resonate with the person that's reading. Okay? All right. Any other questions?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Resume",
      "content_type": "Advice",
      "timestamp": "05:40 - 06:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Okay? All right. Any other questions? How important do you think it needs to be loved one, not only for me, when you come to someone's area to your future, or where are you? Yeah, I think it's super important. So like, again, like, you don't want to travel this road, you know, as a lone wolf, right? You want to surround yourself with a community that believes in you, that inspires you, right? And that holds you each other accountable. So another great thing that we instill in our community is like, like putting out on Facebook on your public feed. Like, you know, I am a full-stack engineer. I am going to do this by X-State. Like, that holds you accountable because you're putting stakes in the ground, right? Because people will call you out.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Community",
      "content_type": "Advice",
      "timestamp": "06:27 - 07:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "Because people will call you out. Like, hey, you said you're going to do this. How's it going? Right? So you want to prove, you know, either the naysayers or people that, you know, don't believe in you and you want to, you know, be part of a community that are marching along the same goals as you. All right? And you never know in your community where one connection, one relationship will open up many doors for you in the future, right? Because guess what? Person sitting next to you might one day work for a company that you want to go work for, right? And if you are part of that community and you've worked together and you've helped each other, I mean, that's the first person I would recommend, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Community",
      "content_type": "Advice",
      "timestamp": "07:20 - 08:02",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "other, I mean, that's the first person I would recommend, right? People in my community and my circle. So the whole thing about LinkedIn, getting to know, and what the hiring managers are, potential, people that you might be working with, what's getting too much information? Because, you know, you don't want to come across as a sort of stocker. Like, hey, I saw this on your Facebook or I read this on your link. So is there a certain thing that as you're trying to study the people that you're going to be the hiring managers, what's too much, what's too little, how do you find that balance? So I would say the balance is making sure that your intentions are good, one, right? And it has to be authentic. So you know, you have intentions to build a relationship because you want to expand your",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "07:58 - 08:50",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "network and there's nothing wrong with that, okay? But don't, you can't do it in a malicious way, so to speak, right? You have to be authentic too, that you are passionate about this industry and you want to expand your network and expand your circle and you're getting career advice, right? You're also networking with peers, you might not be at their level, but believe it or not, lots of people in the industry, once they climb to a certain level of success, they want to like share their knowledge, they want to like help believe it or not. They want to talk about how they got to where they want them, where they got to be, you know? So like I see so many times people will take the meeting, whereas it's not take the meeting, and you can go have coffee at Starbucks and talk about like, you know, like it's like,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "08:50 - 09:42",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "I noticed that you're wearing the same area or I noticed that, you know, you're in a position where I'd love to get to, I know I'm way out, but like you start that conversation and I create one relationship. And what happens is that when an opportunity arises, they're going to think of you before they think of anyone else, because lots of engineers that are in the field, they get asked, like, you know how many times I'm managing 200 clients at Cisco, every high-mile is like, hey Terry, you've got a junior network guide that I can hire and you've got a mid-level network engineer that's looking for a job in X-area. Like, do you know systems engineer? Like, everyone's looking for referrals. That's how this industry works.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Story",
      "timestamp": "09:42 - 10:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "That's how this industry works. They'll take a referral over just trying to interview someone, you know, out the door. So the faster you go into social networking and know someone that's going to open up that opportunity. And then also, go into that meeting where you can maybe give back to. Maybe you volunteer for free on the side or you figure out how to get involved, right? So it's about giving value to your fine ways you can give value in return. All right. You mentioned those measures earlier for the introverts? Yeah. So, I guess, here, a, I guess, hidden community or forum that IT-centric specialists or technicians can be involved and it be included in your resume as, you know, the emphasis on the interests of the industry.",
    "metadata": {
      "domain": "IT",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "10:29 - 11:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "the interests of the industry. the meetups is very important because they're usually done by a group of people that have common same interests, but also there's meetups that are done by the manufacturers where they bring in the customers in an environment to learn about something. Right? So, going to that and volunteering would be cool to be that local ambassador for a manufacturer that can get you on the map, right? So, those are some hacks, right? You can do. And then outside of meetups, I would say, like, going, I don't know, this is more of a closed thing, but like, tech field day is another great resource where I can learn about a lot of cool, amazing, new, emerging technologies.",
    "metadata": {
      "domain": "IT",
      "topic": "Meetups",
      "content_type": "Story",
      "timestamp": "11:23 - 12:12",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "about a lot of cool, amazing, new, emerging technologies. I don't think you can volunteer for that, but like, I would say, I'll talk about this later in some future lessons, but being subscribed to certain news groups and then chiming it on online forums and chiming in here and there and posing, you know, posting, like, really smart questions or answering and helping people with certain things that you know would help with that. I know that went a little side-track, but I would say, as far as what came to mind for being introverted and wanting to speak better publicly and things like that, one thing that helped me a lot was listening and watching a lot of TED Talks. TED Talks are amazing, why? Because in five to ten minutes or whatever, a short amount of time they needed to deliver",
    "metadata": {
      "domain": "Leadership",
      "topic": "public speaking",
      "content_type": "Story",
      "timestamp": "12:12 - 13:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "that most inspiring, awesome pitch ever, right? And concise, you know, amount of time. So, you know, how CompTIO has the webinars or just they have a setup that you can credit to your CEUs. Is there something in the IT field, a certain form that you can put on your resume that you're involved in that, you know, will kind of fill the gap of, you know, the interest or even the longevity of your, probably lack of time and the industry. Well, they're not credits, it would just be basically highlighting your resume and also it creates your social networking, I would say the meetups is the biggest thing. So like, if, if, first thing I would do is volunteer for certain customer events locally from Cisco that they sponsor.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "13:03 - 13:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "from Cisco that they sponsor. Whether it's Cisco user groups in particular area of interest, like maybe it's unified computing system, there's going to be a Cisco user group for that. I get involved in that, volunteer for that. Or when Cisco comes around every year into the local city, they do like a mini Cisco live, free of charge, anyone can attend and people don't know that, you can volunteer for that. And then put that on that one, your resume, right? What about meetups, are those good to put on your resume? I would say if you're a key member of the meetup, so make your job to be a backup designator or some type of important role within that meetup. That's why I said cool things, maybe you can spin up your own meetup, especially if there's a new emerging technology.",
    "metadata": {
      "domain": "IT",
      "topic": "Meetups",
      "content_type": "Advice",
      "timestamp": "13:56 - 14:50",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "a new emerging technology. a new emerging technology. And you don't have to be the expert by means, you bring in the experts, you're just a coordinator, you're the organizer. So got your question about resume slash, talking with a hiring manager. So if you just got your FSNA, a lot of people don't know about what that is. So what would you do to kind of educate recruiters or potential hiring managers about the FSNA, what would you do about that? So one thing that we need to do as a company is that we need to build a strong employer framework that recognizes the actual skills validation we do in the FSNA. So that's something that's maybe not in your control, but in our company's control that we're working on. One way that you can articulate and show the strengths of it is articulating how it's",
    "metadata": {
      "domain": "IT",
      "topic": "Resume",
      "content_type": "Advice",
      "timestamp": "14:48 - 15:41",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "different from a paper cert. You had to actually go through a five day boot camp and configure a design, plan out an entire project on real quick. So it's you vocalizing what you've done intelligently. Saying, I've planned design, configured an entire network from round up on real equipment for five days straight. And I had to get in person qualified and tested on this before they actually certified. I didn't hide behind the computer passing 60 questions Q and A exam. Don't get that. Just plain English. Yeah. You're just speaking to the hiring manager. They're going to see that. I mentioned like, whoa, I didn't know there was such, oh, they're a new starter. They want to disturb tech education.",
    "metadata": {
      "domain": "IT",
      "topic": "Certification",
      "content_type": "Story",
      "timestamp": "15:41 - 16:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "They want to disturb tech education. And they think people that need to be job ready needs to be skills-qualified in person. And there's no shortcuts around that. That's why I decided to take this serve. Right? Is that help? Yeah, I mean, it might be something to put on that PowerPoint, that. It's the man-educated people. Exactly. And one thing that we want to do maybe is this. This is a good, we'll take that as an action item for, you know, Jacob could take good notes on this one. To your point is maybe what we can do on our website, our new website, if you haven't checked out, is beautiful. We'll have a section why like you should hire an FSNA. Maybe we'll have a dedicated page saying our FSNAs have done this.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Education",
      "content_type": "Story",
      "timestamp": "16:31 - 17:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "Maybe we'll have a dedicated page saying our FSNAs have done this. And we'll just, and you could just say, hey, check this out. You know, you can send them a month of follow-up or give you one slide, what the FSNA entails. Right? And that would make it stand out.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Communication",
      "content_type": "Example",
      "timestamp": "17:12 - 17:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247521985",
      "source_type": "Course"
    }
  }
]