[
  {
    "chunk_id": "chunk_1",
    "text": "Last lesson for this module is the strategies for promotion and my top 13 methods that you can apply to actually work on getting promotion after promotion and these are tactics and strategies that I've applied myself. So starting with number one, bringing positive emotions, you know, as basic as it may sound, a lot of people will go into the work environment and be very, let's say, negative or just, you know, not bring the energy, you know. And I would say if you're looking to get promoted rapidly in any environment, right, you want to bring that joy, you want to bring the passion, you want to bring excitement, right, because people want to work with those type of people, right. And when another opportunity comes up where, you know, there's a chance for you to ask for",
    "metadata": {
      "domain": "Leadership",
      "topic": "Promotion",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "something, you know, it's going to favor you, right. So as easy as this may sound, people don't actually do it, okay. So one thing, smiling, smiling, greeting your team, more like team players, you know, your colleagues, like bringing that energy on a project, you know, being upbeat, try, does wonders. Now, showing up early, I mean, this was a grind, like, like, what I had, I had strong motivation, I had clarity, I knew I wanted to get 80, 80K was actually my goal. Right. Because when I got 28,000, my wife was like, oh, man, honey, we're not going to throw them off this, right. Two kids, can you imagine that? It was painful. I live with my parents. So my motivation, I raised them to Sesame, right. And I see clarity.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Motivation",
      "content_type": "Story",
      "timestamp": "01:05 - 02:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "And I see clarity. And once I see clarity, everything just came, right. Using the upward spiral method to make things happen and take massive action. So what I did as I showed up early, this is a strategy, this is a tactic. So everyone, in my environment, I was like, wow, Terry, like, Terry's, like my boss would say, Terry's always the first one in, last one out. So what did I do? It sets a perception or impression, right. A strong one, right. So showing up early is very crucial and then staying last is crucial. You don't have to do this for the longest. I'm just saying do it when you're grinding, man, when you're grinding it out. You know, I didn't do this throughout my career, right. So that's a good strategy. And then journaling your work.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Strategy",
      "content_type": "Advice",
      "timestamp": "01:58 - 02:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "So that's a good strategy. And then journaling your work. So I use every note. Jacob uses one note, Microsoft one note, like, those are, you know, I'm going to do this in my work, our great kind of tools, but also you can use a most skin notebook if you want to go old school. There's nothing wrong with that putting a pen on paper. But journaling your work is very important. And why this is important is I want you to journal your work on a weekly basis. At the end of Friday, journal it. Write down all your accomplishments, all the tickets you've resolved, all the impact you've made, right. Just think of everything for that week and journal it. And also find out which projects you're a task or a type to.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Time Management",
      "content_type": "Advice",
      "timestamp": "02:53 - 03:39",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "And also find out which projects you're a task or a type to. Maybe you're not volunteering or you're leading a project, but I bet you that you worked on something that was impacting a project, right. And it's important to journal that. Why? Because those, we're going to use to roll up to create an executive summary. This is very tackful, okay. It's not just for the sake of journal, all right. Once your journal, you can now create an executive summary. So once a quarter, this is what I want you to do. Take your weekly accomplishments and turn them into major accomplishments, right. It's like a highlight for you. Now you have 12 weeks of stuff you journal, you're going to create, you know, some big kudos to yourself, right.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Journaling",
      "content_type": "Advice",
      "timestamp": "03:33 - 04:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "kudos to yourself, right. You're going to, you're going to, this is all on you. This is key documentation. And this is the same thing that Andy Pratt used to go from like getting that $20,000, $30,000 raised in like six weeks, you know, six to eight weeks, journal, and then creating an executive summary. Super powerful. I used it for all my promotions, working my way up, okay. Then we turn this into a one to page executive summary, talking about all the certifications you've achieved, awards you've received, along with any projects that you've impacted. Makes sense? So awesome as that. You see where that's going? Super powerful. Number five, number five is look ways to go above and beyond at least one-sequator to help",
    "metadata": {
      "domain": "Leadership",
      "topic": "Promotions",
      "content_type": "Advice",
      "timestamp": "04:19 - 05:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "out someone in the team. One of your teammates, right. You purposely do that, right. Because you want to be in good faith and good, you know, perception of others too as a team player. Not someone that, you know, we talked about like that is like stepping on everyone's toes and like pushing them out the way to get into the spotlight. You don't want to be that. So be a team player. I'm a good example of that too. Like if you're on the networking team a lot of that working guys are like, I don't want to do anything with PCs. But maybe your company is going out of new brands and they have to go hand carry 50 computers And as a level engineer or the level administrator, you can volunteer to the system.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Teamwork",
      "content_type": "Advice",
      "timestamp": "05:15 - 05:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "That's just like that. Absolutely. Next is lead a project or two, right. That's step three or four. You can volunteer or if you're ready, you can lead a project or two. And this is very crucial. This is when you actually build up a lot of experience. I want 70, 80 percent. You know, if we did an 80, 20 rule, 80 percent of your effort to go into getting project experience, this is going to give you, you know, the results you want, right. Now seven, take on more responsibility. And like, oh, I'm an interior. I don't want to take out more responsibility. I got too much on my plane. Put out these fires. When I was working at the bank, I purposely took on more responsibility. Why?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "05:54 - 06:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Why? That one creates job security. If you're the only person that's, you know, volunteered to do this other task that just came about, guess what? Only you know about it. Only you know how to do it, you know. And then they have to rely on you more. If you take on more responsibility, guess what? That changes. Guess what? Your job duties. Because they hired you for one reason. Now you're adding on all these additional duties, right? And now guess what? When it comes to creating opportunity or going after four pay rates, now you've got some ammo, right? So this is strategically done. Okay? It's the reverse, right? Fix mindset. Oh, man, I go into jobs.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Security",
      "content_type": "Advice",
      "timestamp": "06:52 - 07:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "Fix mindset. Oh, man, I go into jobs. I'm going to clock out at 4 p.m. 5 p.m. I'm out. Waiting for the weekend. Buh-buh-buh. Right? Fix mindset versus growth. I'm going to take on more responsibility. I'm going to create job security. I'm going to create demand for my skills. I'm going to create justification for pay rates. So I can go confidently into my boss's office. Six months from now. And he's going to have to give you that race. Right? I walk out the door. No one's going to be able to do all this stuff. Right? So number eight, help out with IT budgeting. I mentioned this earlier, but it's so important to understand what's the top initiatives.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "07:41 - 08:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "What makes your boss successful is completing those projects on time, on budget, right? And solving real business challenges for that company. That's why IT teams exist. It's not just to support or keep the lights on. Right? And actually projects that make impact. So help out with IT budgeting. Your boss is like, hey, I remember I walked into my boss's office. Hey Larry, what's the top of my for you? What's some projects that you need help with? What I would ask my boss. And we would say, oh, this is top of my for me. So having these one-on-ones with your manager or even your head of department, it's very important. You can support your supervisor, your manager, but you can talk to the CEO, you can talk",
    "metadata": {
      "domain": "Leadership",
      "topic": "Success",
      "content_type": "Advice",
      "timestamp": "08:21 - 09:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "to the VP of IT, and you can volunteer for stuff. Guess what? Wow. Yeah, you can. So it's like, it's these aha moments that allowed me to flourish in my department and things that's just being proactive, right? Not being shy. You know? They can say, no, we don't need any help. But the best thing that can happen is, yes, we do need something help actually. There's things that I don't have time for, what not. And then, some, like, depending on how big the organization is, there might be already a set IT project. So all you do is just find out what's the top initiative. And then learn around those projects. And then once you lead a project, you actually be looked at as a thought leader. Oh, hey, Jason, I need you.",
    "metadata": {
      "domain": "IT",
      "topic": "Leadership",
      "content_type": "Story",
      "timestamp": "09:09 - 09:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "Oh, hey, Jason, I need you. Can you help me budget out this branch refresh? We're going to do. We're going to roll out a new branch. Next month, can you kind of put the bill and materials together for me? Sure. Right? So like, you know, it creates a relationship. It creates, you know, a bond. Let's see. One way to keep on top of IT, like, technology is in budgeting and things like that, is don't underestimate module two. IT architectures. A lot of people under it, like, they might go through that module and not understand how important it is. Like, look at Keyron, right? From our, I'll just join the program a little over a month ago. And within 30 days, you got a promotion.",
    "metadata": {
      "domain": "IT",
      "topic": "budgeting",
      "content_type": "Story",
      "timestamp": "09:51 - 10:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "And within 30 days, you got a promotion. He joined Google as a data center operations engineer. Junior capacity, but got a huge promotion from printer tech, right? Like, he's set right now. He's like, he went from like, like, first job printer tech, bam, like, right here. He's in step three in like a month from joining our program. I talked to him on the phone and we then went on one mentor session. We had two mentor sessions already. Like, action taker, man, dude, Scott, necessity. He's like on fire, like, upward spiral, Keyron. He's like, on, right? I told him to do something, like, bam, and he turns it around, right? And what I see in Keyron is that he said, I said, what's kind of the insight, the secret that you used to get that promotion?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "10:38 - 11:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "that you used to get that promotion? It's that architectures. It's like, it was like an aha moment for him. When he went through the data center architectures, like lessons, he was like, wow, all this product ties into architectures, ties into like an offering, a solution, right? He was able to speak on that in his interview and they were just like completely impressed. Right? So when I went to interview with Cisco, I need sure I understood all the architectures. Cisco has these key architectures across enterprise networks, across collaboration, across security or data center and virtualization. And there's all these like product sets that come under it. Now there's a new architecture called DNA. It's another trend.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Story",
      "timestamp": "11:22 - 12:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "Now there's a new architecture called DNA. It's another trend. You can write on DNA, alone, and create a lucrative career for yourself, right? Or how about when like cloud networking came about, you know, at Dimension Data, I was on the partner site. When I was on the new Cisco Marockie, it was very brand new. I took the initiative. I reached out to my resources, learn everything I did from Cisco's SCs that focus on Marockie. And then I became an inhouse expert, the SME, the subject matter expert for Marockie. And that's very important. So when it comes to IT budgeting, tap into those resources, understanding architectures, products, things like that. Because that's where the research R&D begins. So if my boss says, I need to do a network access control project.",
    "metadata": {
      "domain": "IT",
      "topic": "IT Budgeting",
      "content_type": "Advice",
      "timestamp": "12:05 - 12:56",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "So if my boss says, I need to do a network access control project. Guess what? If you know architectures, you're able to dive into architectures. If you know products, you're able to dive into products, read data sheets, read design guides, and then you'll be able to budget it as well and even plan and design around it. Next is company awards, right? Look ways to go above and beyond and try to get company awards because they will help with your executive summary, but also justification for our promotion. So getting awards is important, as cheesy as that may sound. Getting those little clear crystal, whatever plaques or a certificate, quarter team VIP or team player, whatever award. Just get as many awards as possible. It's going to help. Number 10.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "12:50 - 13:46",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "It's going to help. Number 10. Get your job description from HR. A lot of people don't even understand what job they applied for with a current position. In your current position, get your job duties and description, just call HR or email them and ask for a copy. Once you get a copy, understand what's in it. Understand what your main duties and responsibilities are and understand how you can expand upon that. Because what I want you to do next is you're going to actually create your own new job. That's what I did when I was at the Bay. I went from network especially and I was like, you know what? I don't want to be a network specialist. Why? Because I did salary market research.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Description",
      "content_type": "Advice",
      "timestamp": "13:42 - 14:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "Why? Because I did salary market research. And if you use salary.com or Glassdoor to figure out what market rates are for different positions and what those job duties and descriptions look like, you can create your own future. And from your own future, you can create your new job and it doesn't even have to exist. That's the beauty about it at the Bay. There was no network engineering job. There was no senior network. There was no network operations team. I made all that. Right? Imagination, right? What's your mind can conceive? You know, you can achieve, right? So create your own new job, create different responsibilities and you can tack on all those",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "14:19 - 15:02",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "new responsibilities I mentioned earlier as a strategy to start moving towards this new\nOkay?\nMaybe it's managing the firewalls.\nMaybe you want to manage the phone system.\nDoes that make sense?\nAnd then you gain those skills to, you know, in order to expand your job.\nStart working on the future job that you desire.\nImmediately.\nStart working towards that.\nResearch salary information.\nThis is very important.\nYou can use, again, like I mentioned, salary.com, Glassdoor.\nAnd then you can decide what's the appropriate rates.\nYou don't want to be like, hey, boss, I'm making 25 bucks an hour.\nCan you pay me 125 an hour?\nThat's not going to fly, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "15:02 - 15:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "Can you pay me 125 an hour? That's not going to fly, right? So you want to tie in that job description to duties, the new job title you want, titles tie to pay. And believe it or not, like, if a company is big, not at a startup environment, but if a company is big, like they can't get away with certain things of giving you certain titles and only pay you a little bit. Does that make sense? Like, you can't pay CIO 18 bucks an hour. Like, they're really kind of CIO didn't have the company. Does that make sense? So research salary info. So you understand, like, what position do you want to create or what position you want to apply for? And understand this. This will help you also with negotiation as well.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Salary",
      "content_type": "Advice",
      "timestamp": "15:38 - 16:29",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "This will help you also with negotiation as well. And then lastly, 13 set up quarterly or buy annual meetings with your supervisor, your manager. And this is very important because you want to get feedback. And also, you've got that gross mindset, right? You want to take criticism. You want to understand how they perceive you. And then you want to fix that. You want to optimize for that. And if you show significant improvement where you're like really accelerating, that's going to also help justify your pay raise and your promotion. Okay? But also it creates a relationship. If you just show up to your boss, like, you have to just talk once a year. It's not going to help you, right? So it's building rapport professionally.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Performance",
      "content_type": "Advice",
      "timestamp": "16:24 - 17:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "So it's building rapport professionally. Not saying you need to kiss your bosses, like hand in just like always just be brown those things. No, there's nothing to do with that. It's just creating rapport, creating expectations, having that conversation. Hey, like, making sure also here that you understand their priorities as well. Because if you can make them successful and make them shine, you're going to shine. So get feedback on like, what do you expect of me? I think it's very important. Understanding your boss's expectation of you. Very critical. And also when you're in an environment, you're in your first job, you worked your way up into a network role. Adapted to the environment, right? Adapted to the environment because you're the new guy.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Building Rapport",
      "content_type": "Advice",
      "timestamp": "17:10 - 18:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_24",
    "text": "Adapted to the environment because you're the new guy. So that's very important and then building that rapport. So there you have it, folks. That is shortcuts to six figures, hoping you learn a lot from these three lessons. As a recap, we talked about the five step guide. We broke it down, built up the pyramid, starting from the foundation all the way up to talking about how do you get to the major leagues? And we talked about a lot of different components of the five step guide. And we moved into talking about the five past six figures and my kind of top two ones that I think is the fastest way to get there. And also we talked about the 13 strategies that you can implement, right? Throughout your career, to get promotion after promotion. Hope you guys enjoyed it.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Communication",
      "content_type": "Story",
      "timestamp": "18:00 - 18:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_25",
    "text": "Hope you guys enjoyed it. Hope this was helpful. And then we'll open it up for Q&A.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Q&A",
      "content_type": "Story",
      "timestamp": "18:47 - 18:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246883089",
      "source_type": "Course"
    }
  }
]