[
  {
    "chunk_id": "chunk_1",
    "text": "Alright, lesson two. Lesson two is a five pass to six figures. So let's talk about that next. So the five pass to six figures. One is you can obtain your CCIe. It's like getting the PhD of all sorts. So Cisco has a pyramid of certs starting off on CCNA, CCNP, and then CCIe. Now if you want to grab your CCIe, you're gonna have to basically have a lot of discipline. Right? Like, like clocking in, you know, several thousand hours is not unheard of. And then also passing it on the first try is very, there's a small chance you'll pass on the first try. Usually people that attempt their CCIe get it on their like second or like third or even fourth attempt. That's how hard it is. Okay? What I recommend if you want to grab your CCIe, you, like, we don't train on CCIe, but there's companies out there like IME that specialize in CCIe training. Clapsert,",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:25",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "Clapsert, upstairs, one of our mentors, if you want to get into voice, right? He has a boot camp that's dedicated for CCIe training. Now CCIe training, you're gonna have to devote anywhere from six months to 18 months. But guess what? I don't recommend obtaining your SCOE even after your CCIe until you get to step four. Okay? Until you don't do it and try to, like, do it in step one or like two. Okay? You're not gonna be ready. Just not. It's gonna be a waste of time. You need to actually get through that P level understanding and then go through. Now, you can climb up the period fast and get there, but do it in, you know, between step three and four when you're at step four. Block out six months to 18 months then just plan on not to have a social",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "01:25 - 02:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "life for a while if you want to go that route. But it will accelerate your past six figures because it's like a big checkbox on a resume, right? From IT recruiters wanting to hire CCIs and companies just wanting to have a CCIe on staff, right? There's some prestigiousness to it. Now, number two, applying for ASC ASR CSAT program for Cisco. So that's an awful. ASC stands for Associate Systems Engineering and ASR stands for Associate Steels Representative. Okay? This is CSAT stands for Cisco Sales Associate Program. Now, the requirement for this is a four-year college degree and I'm not sure if they're picky on the actual major, but it should be related to maybe computer science or electrical engineering, some type of, you know, technical background. But if you do have a",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:17 - 03:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "bachelor's, you can apply for it and this is like a, they get, they basically immerse you into a 12-week kind of like boot camp and get you into the field as an Associate Sales Engineer or as Associate Sales Representative on the sales team of Cisco, selling and designing and, you know, packaging Cisco solutions to customers, right? So it's associate level positions, but it will actually get you to six figures pretty fast. I would say within two years. Okay? Two years. Some may be three, four, but typically two years you can get there because that will fast track you. Within one or two years you'll go from Associate to actually Systems Engineer. Okay? If you're an ASR program, it's going to take you from ASR, from like being an inside sales person to a field rep and account",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "03:16 - 04:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "manager and we'll talk about those worlds as well later because who knows? You might love talking in front of people. You might love presenting. Maybe you'll take your technical learnings and you'll actually shift over to be going into complete technical sales world versus being an engineer going into the leads, right? And knowing all the speeds and speeds. So that's one other program. Step two, step three, getting into technical sales. I just touched on, right? That's a fast track to breaking six figures. Like hands down. You can go from actually step three to step five, really fast if you get into technical sales because you have commission. So your base might be smaller like they might be paying 50 to 80,000 base, right? And then the upside is huge. So here,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:06 - 05:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "if you're looking at technical sales positions where an engineer might make on the pre-sell side is let's say 150 base and they get like 25 to 75 commission. That's for an SC. Whereas for an account manager, you might make 50 to 80 K in base salary, but you might make 100 to like 300 K in commissions if you close a lot of deals. So getting into technical sales is definitely another option. And then number four is joining a manufacturer, right? As an SC, as a systems engineer, right? There is hundreds, if not thousands of manufacturers, right? Up and down the valley, you know, and guess what? They don't just work here, right? Those jobs are just in the valley, valley. They have offices throughout the world. You can go work for like, you know, a manufacturer like, let's say, you know,",
    "metadata": {
      "domain": "IT",
      "topic": "career",
      "content_type": "Story",
      "timestamp": "05:04 - 06:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "paddle all to networks. You want to work on, you know, next generation firewalls and intrusion detection systems, right? They'll have office in Germany. They'll have office in Australia. But you can go work anywhere. So I'll cool this down, right? So you can join a manufacturer as a systems engineer and get them to step five and join the major leads and break six figures easily. Number five is joining a value added reseller as an SC. So the same job will actually be available on the partner side. So selling a manufacturer in product. So there's, you know, tens of thousands of these partners worldwide. So a lot more job opportunities, right? Do the math, you know, you have one company, right? Like Cisco, they have only so many SC positions open, right? But then",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "06:21 - 07:14",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "you have the 20,000 Cisco partners that also have a required, uh, men for SCs, right? In the field, also SCs that actually, um, implement and install the equipment as well. So, um, and I'll dive more into these roles in, in a future lesson. So don't worry about that. We'll dive into what the SC actually does on a day-to-day basis and the different roles of a frosted actually IT ecosystem I'll break down. And then number five is joining a value added reseller, right? I just mentioned. So what are my top favorites? I would say my top favorites are these two. If you want to accelerate the quickest, but it might not be the most optimal pass, it just depends on your given situation. If your ambition and motivation is, you know, tied to a financial freedom or money, then I would say these are some fast tracks to get there.",
    "metadata": {
      "domain": "IT",
      "topic": "Cisco Partners",
      "content_type": "Story",
      "timestamp": "07:14 - 08:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Now, if you want to get into an SC row as soon as possible and work on lots of projects from start to finish, joining the reseller rope is a lot more easier. The reason I say that is, joining a manufacturer is very can become very tricky. So if you want to join a manufacturer like Cisco, one rookie mistake to avoid is joining a VAP VAP bar. Because why? Manufacturers do not want to take away engineers from the partners that are selling their stuff. Does that make sense? So if you want to go work for a VAP bar, it's very rare they will take engineers from the partner side. It's like a big no-no. You don't want to recruit from there. But manufacturers will recruit from people that are on the Fortune 100 side. So when I was at the bank, I was getting",
    "metadata": {
      "domain": "IT",
      "topic": "Career Advice",
      "content_type": "Story",
      "timestamp": "08:14 - 09:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "recruited by Cisco. And we'll talk about those tactics and strategies you can do, but the best way to join a manufacturer is you're actually like the top dog engineer, you got your stuff together, your senior engineer on the customer side, and then working with the manufacturers, they see potential. They're like, whoa, I want to hire this guy. So they recruit you from the customer side. Makes sense. So getting into technical sales or joining a manufacturer or value that a reseller on the partner side is going to make sure that you can actually get to six figures as soon as possible. Those are my five past that I would select and choose from in order to break into six figures as you work your way up, the pyramid jokes. All right.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "09:09 - 09:58",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247004100",
      "source_type": "Course"
    }
  }
]