[
  {
    "chunk_id": "chunk_1",
    "text": "Moving into lesson two is making an impression and you don't want to do it really like this, right? Look at every one of these guys and I think dressed like a little too overboard. So you don't want to be like completely hipster to completely tuxedo or laid back. You don't want to go in there with a hat, you know, things like that. So don't overdo it. How you want to actually show up is clean hygiene. Make sure you brush your teeth. You don't want, you know, make sure you pop some, you know, breath mitts. And you dress business casual. Whatever kind of style that fits you, business casual, you can't go wrong. You're not overdressed, you're not underdressed, you're like kind of in the medium. Because you don't want the interviewer to also be uncomfortable, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Impression",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181115",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "Because you don't want the interviewer to also be uncomfortable, right? You're like super like jeeps you up and they'll make judgments based on how you dress, you know? Based on what you wear, you don't want to overdo it, right? And I'd rather have you not get any like judgment or any like minus points, even though we live in a culture in society where like tattoos is fine and piercing and all that. But like at the same time I think those can work against you too, right? So why take those risks, right? So business casual, you can't go wrong. And here's the top three key takeaways you want to accomplish going into a meeting. So it's important that you don't like rely on their agenda, you go in with an agenda.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "00:59 - 01:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181115",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "You go in with the attention that you're going to highlight some key strengths that you know that you have. Why? Because that's going to be very unique to you and very powerful. So you want to highlight that and highlight it to where it makes a big impact towards the job that you're actually applying for. And give them the impression that you're the best candidate for the job, you know? That's two. And you want that. You want to visualize that. You want to go into that meeting with that intention and you know bringing the passion, super important, very underestimated. Okay? People who remember the person that actually brings the energy, the joy, that passionate into the room. Guess what? You're responsible for that. Like you have complete control over that. So why not take advantage of it?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "01:59 - 02:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181115",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Like you have complete control over that. So why not take advantage of it? Right? So as soon as you go into the room, you use maybe the door as your trigger. And think, I'm going to come into this room, bring my passion, my confidence, why? Because I'm prepared. Right? I'm prepared, I'm confident. Like I'm the best candidate for this and you're going to bring your passion. Okay? You have to up that level. If you're not like a passionate guy or kind of lay back on, you need to bring that passion, bring it out of you for the duration of the meeting. It's going to be huge. You",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "02:52 - 03:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247181115",
      "source_type": "Course"
    }
  }
]