[
  {
    "chunk_id": "chunk_1",
    "text": "So let's move into the different career paths that are available for you. So how I break this down is into what I consider the technical track and then you have the management track. And both of these tracks will reside inside this IT ecosystem. Okay? And they're spread across this ecosystem. So one thing I want to do is take a few of these actual jobs and show you, you know, how you can level up to that position. So technical track, let's talk about the network engineer. That's usually going to reside on the customer operation side. Systems engineer found in the bar side, found on the manufacturing side. Network architect is usually on the customer side. Solution architect could reside on both. Customer, manufacturer, and we're all three, including the value",
    "metadata": {
      "domain": "IT",
      "topic": "Career Paths",
      "content_type": "Example",
      "timestamp": "00:00 - 01:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "added reseller partner. Cloud architect across any of these chambers, security architect,  and management. Okay? The goal here is to get to step five, where I consider the major leads, is to make sure that you get engineer in your title and you get architect. One of those two, right? It's going to be very prestigious. And then moving on to the second row, inside it's still technical. What I consider the technical track is the account management rule, or let's say the technical account management. So one of my rules in my last job on the manufacturing side was joining the risk of networks. I could have joined the risk of networks as a systems engineer, but I decided to join the company as a technical account manager. Now, what was interesting is technical account managers, if you really are super technical, you can",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "01:10 - 02:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "go into that row as long as you have good presentation, good communication, and good client facing kind of skills, right? And if you do have those skills, you can actually demand a six figure base salary and have good commission upside. So more like a 50, 50, 50, or even like a 50, 100 model, meaning 50 percent of my take home pay is going to be 100K, and my commission is going to be 100K. So making 200K, right? Or it could be even a 30, 3070 model, where I like it as a tab, you can be having a six figure base salary at 100K, and then your upside is 300K. That's like a 3070, right? So those are ratios. Once you get into the partner or manufacturing role, they refer this to as OTE, okay? As an acronym on target earnings. So what's your OTE you want? A 19 recruiter might ask. Well, I'm looking at, you know, 225.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:03 - 03:14",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "That's your standard, right? Well, I'm looking at 150. Well, let me tell you the job is 8020, right? With an OTE package of 150. Does that make sense? Right? So those are some acronyms that you'll be wanting to get comfortable with as you look at roles in that world, because you want to be confident. You want them to proceed. You know what you're talking about, and this is not your first rodeo, right? And also the numbers perspective too. So a account manager product specialist is when you can actually go into a manufacturing world. So this is on the manufacturing side, and you specialize in a product, okay? So you could go from systems engineer to a product specialist focusing just on a particular product and become a subject matter expert, a sneak in that particular one product set, getting very granular. Customer support",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "03:14 - 04:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "sneak in that particular one product set, getting very granular. Customer support sneak in that particular one product set, getting very granular. Customer support engineer, being on a technical assistant, you know, center, customer support engineer, inside cells engineer, that's more of like a junior role if you decide to go into, let's say, a bar or a manufacturer, this is a great entry position you could kind of go into, if being an inside cells engineer. And inside cells engineer, and what we'll do is we'll talk about different roles that you're curious about, because we can't cover like all of them, but we'll try to cover as many that you guys want to learn about. Inside cells engineer on a high level, it's going to be that inside guy that usually does a lot of product build out, like build of materials, getting a quote out for an account manager, and speccing something out that's",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:07 - 05:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "very basic, right? Doesn't require an advanced engineer or a field engineer to take care. Systems administration, CISAD, right? That's more on like the server side, you know, like being an active directory or exchange or PC server admin duties. I'd like to stay away from CISADMIT, CISADMIT I think is a good entry level job, just like network administration, but you need to move into an engineering or an architect role sooner or better. And CISADMIT I think there's some actually drawbacks if you get too stuck into that role where it becomes like putting up fires a lot, you know? So DevOps engineers pretty trendy and hot too, right? So like puppets chef Ansible, those are some different manufacturing products that offer software solutions to do a lot of",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "05:00 - 05:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "So puppet chef Ansible, those are kind of things that you can learn and then create your own opportunity to apply for certain DevOps engineering roles where you could be that thought leader, be that specialist of the automates the network. This is a very new kind of role and job in the network engineering role, but you know if you come from a network engineering background, it's great to actually position yourself into this role. And we see also a lot of developers have that coding background go into this role, you know, as well. But it's not an comment for network engineers to move into DevOps. So that kind of makes up the technical track and then your management track is pretty typical. If you could be managing a team of network guys and become a network manager, you could also be an SD manager, which is very popular in the",
    "metadata": {
      "domain": "IT",
      "topic": "Automation",
      "content_type": "Story",
      "timestamp": "05:53 - 06:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "systems or the manufacturing and the borrowers because if you have a group of SCs, who needs a management, a nested manager, right? So IT director usually an IT team on the customer side managing an IT department. Usually you have several business units like help desk network, assist admin, store, like if there's silos of different teams within an IT team, they usually report to an IT director that eventually reports to like a CIO or VP of IT. VP of engineering could be across multiple fields so it could be on the customer side, but usually VP of engineering, I always see more on the manufacturing side and the partner side, right? Managing a lot of the SD managers or directors. You always also have director of engineering as well and I don't have listed here. VP of IT usually reporting to a CIO in",
    "metadata": {
      "domain": "IT",
      "topic": "IT Structure",
      "content_type": "Story",
      "timestamp": "06:49 - 07:44",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "smaller companies that don't have a CIO. VP is kind of the top dog, right? That leads to the entire IT team. Team leader is more of a designated role if you're on a technical track position and you're just like designated as a lead. Does that make sense? So it's not management, but also in a lot of positions, team leader is actually someone that is maybe in apprentice. They make you team lead because they want to see if you have potential to be a manager. And if you take that role, they may give you that opportunity to win that management position and open up. So it depends how you play your card stare. That might be a good way to get it to the management track. Technical sales managers, managing a people, sales managers. But when I say technical is like, you're not going to go work in, you know, I don't know, pharmaceuticals or something",
    "metadata": {
      "domain": "IT",
      "topic": "IT Team",
      "content_type": "Story",
      "timestamp": "07:44 - 08:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "like that, right? Like all these sales positions are in this world of technology that's technically, like, you have to be technical, right? So that's why you can cross boundaries, you know? But when it comes to selling, then you have more opportunities in what? You don't have to sell as an engineer. Now if you become an account manager, you have to sell, right? But even as a systems engineer, you do technically have to sell, but you're more the engineer. You're the brains of putting a design together, putting the specs together, right? Solving business problems, going into a client meeting and whiteboarding, right? Writing down, you know, their challenges, their problems. And then figuring out what solution, technology solutions, going to solve that problem.",
    "metadata": {
      "domain": "IT",
      "topic": "Sales",
      "content_type": "Story",
      "timestamp": "08:40 - 09:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "All right. So that is the technical track. That is the management track. And we'll talk about, well, I want to first of all talk about really quick is what are some roles that you're interested in? I can kind of highlight what that day to day may look like for that particular role. So we'll open it up. Any particular roles that come to mind that maybe you want me to talk about? Yes? Since I have no experience in this industry, you know, I'll be going to kind of junior roles, right? Yes. Now we're systems or maybe you say you have any size, those are like more junior roles. Yeah, so junior roles would be, I don't have a lot of junior roles listed on here, other than like, if we were to add junior network admin, junior system admin, right? Or customer supported",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "09:32 - 10:26",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "engineer or help desk, right? Or technician, which is not on here, right? Those are all entry level jobs. Yup. Sometimes that will give you an administrator, can be as well. Absolutely. Yup. Depending on your background, if you have a certain you can roll right into a network admin position. Especially if it's a smaller, what doesn't really matter? If it's a big organization, they may always be looking for one or two junior network admin guys, right? To manage, you know, keep the lights on, right? All right. Any other roles? Maybe, I'm trying to decide between like management or technical tracks. So maybe like an IT director and then make something on the network architect or switches on the content. So what's your question? Well, I'm your job. Yeah, if you can highlight",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "10:26 - 11:20",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "one on the management track, maybe like an IT director, I don't know which one is better, SC manager, IT director type of. Okay. So I would say there's a lot of responsibility for being an IT director. You definitely want to be a good generalist, no cross-stack, and you're managing, you know, a big team. Whereas if you're an SC manager, you're not managing multiple business units. You're managing a group of SCs, right? So like five to seven SCs in a small, then team, right? First is a IT director. You might be managing like 40 people or you might be managing if you're a co-op of Kola. You might be managing 100 people, right? So the roles kind of, you know, are quite different. Now from a solution architect perspective is that a solution architect usually can live in any of the three worlds, but a solution architect can cross architectures.",
    "metadata": {
      "domain": "IT",
      "topic": "IT Director",
      "content_type": "Story",
      "timestamp": "11:20 - 12:32",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "So it's like 10 plus years of experience and they've done a lot of projects and they've been able to work their way up from like network engineer, network architect, solution architect, but typically solution architect and cross architectures, across, let's say, like networking, cybersecurity or information security to data center virtualization and cross-stack in a room full of systems engineers. So think of, you know, like SCs, like if SCs had this grade of one through three, like level one, level two, level three, and you have these SCs that want to aspire to get to the next level, that next level is usually right here. Okay? So you see that it's kind of the top of the pyramid from an engineering perspective, from a technical track. And they have to be very technical.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Advice",
      "timestamp": "12:32 - 13:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "So if you want to get really technical or you don't want to get as technical, you probably want to move into the management track, which is the SC management. Okay? Any other questions? What are the different between network engineer and systems engineer? Great question. So a network engineer is usually going to reside in the customer side. So network engineer is working in the network operations team and they're going to, you know, like work on projects and then also even maybe lead projects, refresh the network, keep the network, you know, going, making sure there's no network outages. If there is an outage like at a branch, they bring that branch back up, right? They're on call, right? Usually rotating with the team, like when we're at the bank, we're on call, the network team.",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "13:34 - 14:30",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "We're going to, you know, pass that, not a page, but, you know, be on that on call rotation, you know, amongst the team. And if you get a call to in the morning, then it's your job to bring that circuit back up, right? So that's the typical network engineer on the customer side. And you also have, let's say, systems engineers. So that's the network engineer. The system engineer is going to reside on the manufacturer or the partner side. And the systems engineer is actually two roles for systems engineers. So a systems engineer is going to understand already how to plan, design, configure an entire project from ground up, right? So first of all, they're very competent to take a whole project from start to finish. And a systems engineer is going to be either pre-cells, post-cells, or they're going to be a hybrid.",
    "metadata": {
      "domain": "IT",
      "topic": "on call",
      "content_type": "Example",
      "timestamp": "14:30 - 15:23",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "So what do I mean by pre-cells, post-cells, and hybrid? So if I'm a manufacturer like Cisco, and I do a lot of the pre-architecture design configure, or not design, just design plan design, right? Building a solution set, I spec it out, and I architect it, I will hand it off to working with a partner, SC, who actually validates it. So in a lot of case, where I would actually be the Cisco, SC, I get a design, all wrapped up, good to go, right? I spec it out everything based on the customer's requirements. So let's say it's a branch refresh, right? They're going to like refresh the entire switching, routing, firewalls, all that. And based on all the specs, the requirements, like how many people are over there with the bandwidth requirements, what's the disaster recovery requirements, things like that? I design a solution,",
    "metadata": {
      "domain": "IT",
      "topic": "solution design",
      "content_type": "Story",
      "timestamp": "15:41 - 16:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "I build it, build the materials, right? Statement of work, I might even do a Statement of work, but in most cases, if you're on the manufacturing side as an SC, you're going to design and build the build the materials, and that's it, okay? It's handed off to an account manager who's tied to maybe another engineer on the partner side. Sometimes there's not even an engineer on the partner side, just an account manager. So he takes this solution, gives the customer, well that would be $256,000, and the consulting is going to be $25,800 in some change in labor, right? So you get the hardware solutions, hardware software, bill and materials, and then professional services. The partner takes that quote and delivers it to the customer, customer buys off on that, and now the project",
    "metadata": {
      "domain": "IT",
      "topic": "Project",
      "content_type": "Story",
      "timestamp": "16:48 - 17:51",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "gets implemented. So depending on how big the organization is, the customer can install it, or you have the var, you have what they call consulting systems engineer, or just a systems engineer, right? That actually implements the work. That's the post sales, that's the implementation. Now in some cases, if the project is not that advanced and it's just like replacing three access points in this, you're boss or you might say, hey I'm just going to knock that out. So you're the network engineer at the company and you just knock it out, you just buy the hardware and the software. Make sense? So post sales, post sales, or you could be a hybrid. Like Jacob was a hybrid systems engineer at TechLinks where he got to design, build out everything, and then install it. Sometimes the Cisco is C, doesn't need to do any of this",
    "metadata": {
      "domain": "IT",
      "topic": "Implementation",
      "content_type": "Story",
      "timestamp": "17:51 - 18:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "because Jacob already does a good job on the partner side. He doesn't need my help. I'm an over-played SC toward partners that need that help, that need that extra guidance. But also, Jacob might be like, hey, Cisco, can you please validate my bomb? Make sure it's designed properly. But oh, you're actually missing this because we're going to discontinue this, you know, or there's some insight, right? That I have to change up the bomb to make it better, right? And then they pass it along. So there's that kind of case. So, pre-sales, post sales, hybrid, hope that answers your question. Any other roles? What's the doing with the cloud architect in this career? So, these are just really guys that reach the highest level in their career where they're a subject matter",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "18:47 - 19:42",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "expert like a cloud architect, could be someone that is a cloud architect for Amazon Web Services, and it could be kind of maybe even across the stack, or it could be in a special area like serverless framework, like Lambda. There might be a salute cloud architect that just focuses on that, one technology. Or there might be someone that's a cloud architect and Microsoft is sure, right? Because they're one of the biggest cloud providers as well, right? Top three, I believe, Amazon, Azure, Google, right? So there's cloud architects and those kind of domains and areas, or even on the partner side that sells cloud services. So someone that could be at dimension data, and they could be the cloud architect there, that when a customer wants to migrate to the cloud, they bring in Jason who's a cloud architect to teach and talk about that.",
    "metadata": {
      "domain": "IT",
      "topic": "Cloud Architect",
      "content_type": "Story",
      "timestamp": "19:42 - 20:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "they bring in Jason who's a cloud architect to teach and talk about that. Safety and security architect, safety, like you could be a security architect working at McCaffey, right, as the highest architect there on their technical team, who's responsible for working on the bigger projects. Usually, architect gets pulled in not like the $50,000 projects, but the $78 figured projects, you know? It's like a $2.5 million dollar, or maybe it's a $20 million dollar project. Architect starts coming in, right? So it's a very advanced, and you have to have seen a lot to be able to come up with a solution, to be able to address technical questions, things like that. Makes sense? All right. Sweet. So next, let's talk about, there's no questions. We'll talk about some different career paths,",
    "metadata": {
      "domain": "IT",
      "topic": "Career Paths",
      "content_type": "Story",
      "timestamp": "20:29 - 21:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "options, or tracks. So taking the previous kind of positions, and then I want to talk about the actual career paths. So for example, let's say if you want to become a systems engineer, right? And you started off on the manufacturing side. So let's say you work at TAC, right? You got your CCNA, Network Plus, you know, you got your first job working at TAC, right? And you're here for one, two years. Maybe longer. Some people go up in TAC because there's different support to your one, two, two, and you can level up. And your pay will level up. You might start at 30K and work your way up to 80K. Like, there's nothing wrong also, within just getting really good at one area as well. If you're passionate about it, right? So it's not about just continuously moving on, right? Like, that's why my advice to Juan or Jason is completely different,",
    "metadata": {
      "domain": "IT",
      "topic": "Career Paths",
      "content_type": "Advice",
      "timestamp": "21:22 - 22:23",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_24",
    "text": "depending on your passion, your interest, where you're at in your career. Typical track like this could be that if I want to, if my career aspiration is to become a systems engineer, that's my dream goal. I'm going to go from TAC, let's say, to consulting systems engineer, right? Working at advanced services. So I can go from consulting systems engineer and then I'm here for like, you know, two to four years. And I really like it, right? I'm working on different projects and different customer sites. But then I'm like, man, I really want to be an SC, right? And I want to work in enterprise sales. So now I'm moving away from like post-engineered, like implementation engineer as a CSE to actually a presale engineer. I'm never really configuring my deploying stuff. I design, I'm the architect, I lay out the blueprint, but I don't, you know, implement it.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "22:23 - 23:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_25",
    "text": "Makes sense? So I can go from SC to a lot of different roles. I can become a product specialist. I can become an architect. I can become an SC manager. Or I could level up to SC2, SC3, and work my way up until I become a distinguished engineer. And I'll be a manager, right? So those are some different career paths. Or what if you actually started on the help desk, right? move your way into a network admin position and then you became a network engineer or senior network engineer and you can become an SC right? or from here you could become a network manager network manager you can be an IT director and then from an IT director you could eventually become a CIO and then from an IT director you could eventually become a CIO so it's like endless opportunities right? depending on where you start",
    "metadata": {
      "domain": "IT",
      "topic": "Career Paths",
      "content_type": "Story",
      "timestamp": "23:34 - 25:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_26",
    "text": "depending on where you start and depending on what your career aspirations is you may or may not want to start in a particular kind of domain whether it's customer, manufacturer or your value added to the other world",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "25:25 - 25:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247006256",
      "source_type": "Course"
    }
  }
]