[
  {
    "chunk_id": "chunk_1",
    "text": "Let's open up for Q&A. Yes, to be? Let's say you have an entry-level job as a... As an admin, you know, you're going to need some... sirly, pros and cons. And you're working hard-costing. What would be your advice to that person to be the next 90 days? What should they do to be able to jump to the next level as fast as possible? Yeah, so that's an interesting question, which we'll cover in Module 7 actually. First 90 days on the job, but, you know, to share a quick nugget there is that in order to really accelerate and ramp up, you do want to go in to your first job and basically ramp up as quickly as possible, but the biggest advice I would share is find someone that could mentor you during the first 90 days. Because that is key. Someone's not going to sign you a mentor, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advice",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "Someone's not going to sign you a mentor, right? That's highly, you know, unlikely. Maybe, but highly unlikely. You find someone that's an A player, find that person and say, Hey, can you mentor me? I want to learn the ropes, right? And then that will help you ramp up the 90 days really fast. Cool. So how would you... What kinds of questions would you ask yourself to determine whether you want to stay up, pursue like a technical track or hopover to the management track? Yeah, so great question. So I ponder this myself. And I was looking at becoming an SD manager at one point in my career. And what really inspired me to be an SD manager was I found that when I was actually inspiring people or guiding them and mentoring them, it really made me happy.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mentorship",
      "content_type": "Advice",
      "timestamp": "01:07 - 02:04",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "inspiring people or guiding them and mentoring them, it really made me happy. I found that I was getting a lot of fulfillment from it. So the question is, you know, do you want to stay technical? Are you passionate about like digging into the actual like the leads, right? And going into understanding the speeds and feeds of new technology and designing stuff and then implementing it? Or would you rather just, you know, manage a team and empower a team and pass along your knowledge and get a team to gel together and to inspire and motivate them, right? So it's kind of two different worlds, so to speak, but I would start with those questions, right? Do I want to lead? Do I... Am I ready to lead? Right? Can I set a good example for these guys? Do I have the ability to recruit?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Choice",
      "content_type": "Story",
      "timestamp": "01:59 - 02:54",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Do I have the ability to recruit? Right? Do I have the ability to motivate and do I have the ability skills and strengths? If not, then guess what? It's back to the drawing board, right? Getting some books, learning, getting your... Because you might have some weaknesses around being able to lead a team. So you need to work on those strengths. And then when you're ready, then you can move into the management track, but it has to be something that fulfills you at the end of the day. You can't just go into a management track due to financial reasons. A lot of people make that mistake. All of the fact that you become a manager and you can make more money. No, you can make more managers just staying on the technical track, especially in our field.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "02:52 - 03:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "So don't do it for the money. Do it for fulfillment. And you know, just what's making lighting you up more, right? So, does that help? Yeah. Can I ask you a follow-up question? Yeah, absolutely. So if you do want to go to the management track, like if you're a manager of a series, does that mean that you have to be the smartest essay to be the manager? Or could you have people that work under you that know more than you? But you're just federal people and management and recruiting them at the same time? Yeah, great question. So, a lot of people make the mistake is that they will hire someone that low-nose less than them, right? Even as a manager. Or like they feel threatened that fixed mindset, right? Fear of others, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "03:34 - 04:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "Fear of others, right? Being successful versus being inspired and motivated by them. What's important is that if you want to especially lead a team, you want to hire someone that's smarter than you every time, okay? Like on my team, I know people like my team, like they're better at certain things that I've tasked them to do. I'll always look to hire people that are better than me. So as an essay manager, you don't have to be the smartest essay to become an essay manager. You have to have the capabilities as a leader to inspire, to lead, to be able to be personable, to have the patience, right? To have empathy. If you're bad at those kind of names, then you should question yourself, and my fit to lead now, and my fit to manage. And not everyone's perfect.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Leading a Team",
      "content_type": "Advice",
      "timestamp": "04:22 - 05:18",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "And not everyone's perfect. In those new kind of attempts to lead or manage, I was horrible. Like my first startup didn't know anything about growing a startup or, you know, inspiring or leading a team or, you know, making, you know, the right hiring decisions, making all the mistakes. So you have to just be open to learn from them, embrace your failures, and improve, right? But how would it ask those questions? Yep. Any other questions? I guess it's more asking for a little bit more insight on the industry, the public side. I've heard the term jackpot trade is master none, but it does make more sense to have a general understanding. So, you know, companies will hire one person that knows a lot about different areas, and say, four or five people that are just specific to one.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Leadership",
      "content_type": "Story",
      "timestamp": "05:16 - 06:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "and say, four or five people that are just specific to one. Yep. How is the industry going forward with that with all these new technologies? Are they looking for someone that has a broad range, or five people that are specific and just a certain area? So, I think there's room for both. Where the industry makes the mistake is when a person thinks that they're a generalist, they'll say, I'm a generalist, you know, is that they're really not a generalist from my perspective. What I mean when I say you guys should all strive to become, what's on our manifesto? I am a full stack network engineer, right? How do you become full stack? It's not that you just know a little bit of each topic or technology. You actually have put a whole project under your belt in voice or wireless or firewalls.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Industry",
      "content_type": "Advice",
      "timestamp": "06:11 - 07:05",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "Like, I worked across the stack throughout my career, right? Now it's like getting to that PhD level of your game, right? In when you specialize. But you're not entry level, you're professional level across the stack. Does that make sense? And a lot of people make that mistake is they call themselves a generalist, and really they don't know like the elementary stuff. Like, I remember going into client offices and people don't even know how to back up a switch. Literally, they don't know how to use like FTP or they don't even know how to make a poor hot, like some really basic stuff and they call them a generalist. No, they're just like someone that's just getting a paycheck there. They're not trying to learn new stuff.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "07:05 - 07:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "They're not trying to learn new stuff. So where the industry is headed in that regards is that you do, you can be a generalist and actually have a lot of demand in skills is if you want to become like a solution architect and talk across the stack, okay? Or you say, I'm going to specialize in one area, I'm just going to be super good at this, one area. So there's room for both, especially even at Cisco's world. So when we talk about the SCs that cover a particular territory or region, let's say there's six, seven SCs on the team. Like each SC will pick a specialty, but then you'll see one or two SCs that are good across the stack. What makes them special, and I was one of them, there was two SCs that were really good generalists, is the count management team could take me or the other person to any appointment",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "07:53 - 08:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "is the count management team could take me or the other person to any appointment and we don't have to understand who we're going to talk about because we can talk across the stack, right? But then for a bigger project that's really advanced, I might not know all the different codecs and different things that I need to, like whiteboard, if I'm going to go into a big meeting where we're selling a $10 million video telepresence solution, I'm not the guy, right? You're going to bring in a specialist SC that really knows that stuff inside and out on a way deeper level. Right? Makes sense? Yes. Cool. What other questions? Big IT ecosystem career path, and then building your future. What would you recommend, say I want to give it to the technical part?",
    "metadata": {
      "domain": "IT",
      "topic": "Career Path",
      "content_type": "Advice",
      "timestamp": "08:42 - 09:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "What would you recommend, say I want to give it to the technical part? What would you recommend for a start? What would you recommend as a starting point to get really into the technical weeds? I would say striving to become a systems engineer would be crucial because once you become at an SC level, you can actually take any technology that comes out to market and really understand how to become an expert at that really fast. Right? The basics, like, you know, some people don't understand, actually I can pull up any product set on Cisco's website and pull up a data sheet, and instantly know through the data sheet, the specs, the speeds and feeds of that, and I'll try to memorize it. Right? Okay, like I need this product, if I need X amount of bandwidth, or I need this product, if this is the pain point and a customer.",
    "metadata": {
      "domain": "IT",
      "topic": "Career Advice",
      "content_type": "Story",
      "timestamp": "09:37 - 10:33",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "How do I do that? I read through case studies. Right? Case studies, data sheets, and things like that, that gets me really into the weeds and then design guides, valid in design guides. So diving deep into those will get you really technical, really fast. Yeah? Yes. Why do people get stuck other individual doubts? And what is your advice of getting unstuck from your individual doubt? So, why do people get stuck? And what's my advice to get unstuck? So people get stuck is because they don't have enough ambition or motivation where they go into that fixed mindset at the end of the day. They don't have the ambition or the motivation, right? They haven't raised necessity or seek clarity.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Getting Unstuck",
      "content_type": "Advice",
      "timestamp": "10:33 - 11:23",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "They haven't raised necessity or seek clarity. So they're happy with making 18 bucks an hour and you know, binging on Netflix or playing World of Warcraft until 200 morning. Right? So they stay stuck in a position. They have no aspiration to become a senior engineer or to be the best at their career because it's just a patient. They have other passions that they're pursuing. And that's fine. Maybe they are. And they're like, I was like that. We're counter-strike meant more importance than my actual job. So it depends on your situation. When you have your back against the wall and your wife and your kids are like, well, that changes your game. They're like, we can't go out to eat like other families. How does that make me feel?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "11:19 - 12:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "How does that make me feel? Doesn't make me feel good because now, you know, I can't take my family out to eat where they're wanting to go out any. Now that changes my priorities. And that helps me get unstuck because my ambitions now grow because I know this entry-level job is not going to provide a better future for my kids and my family. Right? So it's, you know, looking beyond my own selfish desires or laziness or other interests that doesn't really help my family. So it starts there going for fixed-to-girls mindset and raising necessity based on your motivation and raising your ambitions and then creating opportunity. Creating opportunity within your organization or moving to another opportunity. Right? Hanging around with different people that have higher aspirations. Right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "12:12 - 13:06",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "Right? And then moving out of that role that you're in that's making you stuck. Alright? Any other questions? Alright guys, that's it right.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advice",
      "content_type": "Advice",
      "timestamp": "13:05 - 13:17",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522206",
      "source_type": "Course"
    }
  }
]