[
  {
    "chunk_id": "chunk_1",
    "text": "So let's talk about strengths and weaknesses. So strengths and weaknesses is very important because you'll also be interviewing about your strengths and weaknesses. One of the number one questions, was to tell me about your strengths, who's been asked at in the interview. Tell me about your weaknesses. So it's more important. This all has to do with self-realization as well. So let's talk about some strengths. Like, you know, all kickings off. Like, one of my strengths is that I can be inspiring. That's one of my strengths. So, how about you guys? Names and strengths. Will. Another one. Personal. Exactly. All right. Some more. Humble.",
    "metadata": {
      "domain": "Leadership",
      "topic": "strengths weaknesses",
      "content_type": "Story",
      "timestamp": "00:00 - 01:25",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "All right. Some more. Humble. Being humble. Awesome. How about having a discipline? Being patient. Being patient. All right. What else? Integrity. Integrity. Love. What else? Diligent. Diligent. Being courageous. Like, you can go on and on, right? So you want to go ahead and, you know, write down all your strengths that come to mind, right? As an exercise. So, in your notebook or in your notes, just write down some strengths that you feel that, that you have, right? And you'll see a bunch may come to mind. And then, what you want to do is talk about your weaknesses.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Growth",
      "content_type": "Advice",
      "timestamp": "01:20 - 02:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "And then, what you want to do is talk about your weaknesses. So what some weaknesses people can have. Like an experience. Okay. Ladies and gentlemen. Yep. What else? All the time management. I try to teach my daughter my oldest. Some time management skills right now. It's definitely one of her weaknesses. Negative self-taught. It's a good one. I think. What else? I mean, lack of focus. Procrastination. Procrastination. Oh, I love that. I procrastinate on this course. You know, procrastination is huge. Like when you're doing something, everyone, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Weaknesses",
      "content_type": "Advice",
      "timestamp": "02:19 - 03:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "Like when you're doing something, everyone, right? It's about, you know, understanding your weaknesses also really helps you. Like believe it or not, you have to own it. You have to be vulnerable. Right? Don't let your ego get in the way and not be afraid to understand that you have strengths. You have weaknesses. Okay? Because if you sometimes people don't want to be exposed, they think they want to be like, I'm going to everything. You know, I have no weaknesses. You know? And that, you know, will affect them. That's being closed minded. Close minded. Very good. Exactly. Fixed mindset. You know? Right? So, these are all great examples.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "03:37 - 04:21",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "You know? Right? So, these are all great examples. Fun. Crazy. So, here we go. Right? Some other things right here. Right? And this is super important. Because you want to identify your strengths and you want to identify your weaknesses. And once you identify your strengths and you do these weaknesses, exercise, you're going to also understand that it's, you're not done here. Okay? Because this is what you think your strengths and weaknesses are. We're going to go through some activities that's going to help identify your really key strengths. And also your really, you know, key weaknesses. Like, if you're a superman, like, what superman's biggest weakness? Yeah.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "04:15 - 05:19",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "Yeah. So, how would you like to understand, you know, your superman's strengths and also what's your kryptonite? Right? It's very important because if I understand, if I self-realize my kryptonite, I can leverage that. Right? I can leverage my weaknesses and understand and avoid that or actually work on how to get over my course. And get over my weaknesses or fix my weaknesses. So, do you guys believe that you can double up or go all in on your strengths if you are aware of it? Yes. Right? That's going to make you stronger. Right? First is if you just focus on your weaknesses. So, what I do recommend is that you always focus on your strengths. You double triple, go all in on your strengths.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "05:18 - 06:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "You double triple, go all in on your strengths. That's the first thing that's going to give you results really fast. Right? So, when you're looking for that dream job, you want to focus on your strengths and you want to highlight those strengths. Right? Whether it's in the search process, whether it's in the interview process, whether you're making an impression. Maybe your strengths is social networking. You can talk. You can tell stories, you know, personable. Right? So, if you're a personable, you can use that as a strength and go all in with that. And depending on what one of the 13 or many of the 13 strategies that you use to get promotion, you'll line up your strengths and you'll figure out which tactic, which strategy you'll be able to use and get results immediately.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Strengths",
      "content_type": "Advice",
      "timestamp": "06:05 - 06:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "The weakness is also important because if you're like, if you're lazy, I mean, that's a big cryptidite. You know, so you want to figure out what's the bad habit that's making you lazy. Right? So, for example, let's say if you know you're lazy, is it lack of sleep? Right? Or is it lack of motivation? Like, just start thinking about what is it causing you to be lazy? Okay? In most cases, people that are lazy, it's like lack of motivation or ambition. You know, they're complacent. Right? And we'll talk about how to overcome that. Here's some great exercises that you can do in order to find out, you know, your strengths is ask yourself, the things I like best about myself are. Okay?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Motivation",
      "content_type": "Advice",
      "timestamp": "06:57 - 07:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "the things I like best about myself are. Okay? And if you go through this exercise, you're going to start writing down what you're, you know, like for me, I like that I'm inspiring, I can motivate others to take action. Right? I really love that about myself, you know. The best time in my life was when, you know, think about key moments. Right? It could be like at work, it could be in the home, it could be, you know, when you got that job offer. Right? Like, I know the best time in one of my life periods was when I got to go on my cruise for the first time to the Bahamas and take my entire family. One of the best moments I enjoyed in 2015 and I'll actually share a story around that a little bit later. But, you know, gold through this, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Self-Discovery",
      "content_type": "Story",
      "timestamp": "07:48 - 08:39",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "But, you know, gold through this, right? And then three, my most fulfilling experience was, right? And that kind of can bring out maybe some strengths where you were super passionate about something. Okay? And the best job a project I ever had was, think about that moment. Right? And I remember when I worked on the Voice Over IP project at the Bay. Like, it's one of my best projects I worked on. I was fascinated over making these telephones rain over Ethernet. It was just so cool. And I was obsessed with it. And I got so zoned and I was so passionate, you know? My mind opened up and I was just having all the energy and eagerness to learn. And just amazing. The best time in my life was, oh, I had that twice. Do it again.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "08:37 - 09:36",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "The best time in my life was, oh, I had that twice. Do it again. What I enjoyed doing the most, right? And then finishing off, I know my weaknesses are, right? And I'm really, really proud of the fact that I was super important. Now, I'll share with you, like, another way to tap into your strengths. So that exercise is great, but here's another way to actually find out your strengths from a more analytical or tool approach. So there's a book called Strength Finder's, two point up. We did this activity ourselves here at an exchange with the whole team. We found out about each other's strengths, you know? And as a leader for me, it was very important to understand, like, I wanted to know what my team's strengths are. Why? Because I want to double up.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Strengths",
      "content_type": "Story",
      "timestamp": "09:29 - 10:25",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "Why? Because I want to double up. I want to go all in. I want to empower the team to be able to leverage your strengths so the team can come together, right? And bring something to the table where they're super passionate and where their strengths lie. Okay? So this is, I believe, 1995 this book, at the back of this book, there's a coupon code. You apply the coupon code on your website and you can activate this test. It takes about 30 minutes and you go through a series of questions. And at the end, it'll give you a summary of who you are, like, your strengths, and it's going to give you your top five strengths. Okay? So mine, let's start off, activator. So what's an activator? These are different themes. There's 34 themes.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Strengths",
      "content_type": "Story",
      "timestamp": "10:23 - 11:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "These are different themes. There's 34 themes. It will categorize you. So activator is that I actually make things happen. I could take thoughts and turn it into action. And it's really, like, one of my key strengths, right? I could do this all the time, whether it's, you know, taking an idea, making it come to life, I love doing that. And I could actually pump up about it, you know? And we were at the conference a couple of weeks ago and I saw that mannequin video challenge, you know? I was like, wow, a dog like, whoa, we actually have this boot camp coming up. Made it happen, right? So I'm good at that. That's one of my strengths. I can make things happen really fast. You ask anyone of my team members, you know, I'm not a shy from that, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Strengths",
      "content_type": "Story",
      "timestamp": "11:07 - 11:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "You ask anyone of my team members, you know, I'm not a shy from that, right? So this is super important. Now, learner, what's learner? Great desire to learn and continuously improve. And one of my favorite Japanese words is kaisen, right? And they used that in more of a business sense, but I like to apply it to my personal life as well, right? Always looking to improve, continuously improve. Okay? So I'm a learner. My top three, self assurance. Like, and I think I've always had this even when I was a little child, possessing that inner compass, like always being confident in the road I'm on, I'm always committed like that. Right? Kind of like my DNA. So, you know, and it was just kind of a shock.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "11:49 - 12:37",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "Kind of like my DNA. So, you know, and it was just kind of a shock. I think all of us in our team was like, when we did this, we were like, wow, like this really nailed a lot of strengths. You know, maybe we knew or didn't know where they described you really well. Right? Number four, individualization. Entrieved with unique qualities of each person. That's what that means. So, like, I really am passionate about that. I'm passionate about like each and every one of you how you're unique in your own abilities and how you can adapt and learn at your own levels and how, like, I don't know what the ripple effect from this course, this class will protect your career and your life. And I'm always intrigued about that. I really am. Right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Personal Growth",
      "content_type": "Story",
      "timestamp": "12:32 - 13:22",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "I really am. Right? So, I'm intrigued with qualities of different people and disfastinated about life. Command is taking control. You know, as being a leader and CEO of a training company or other endeavors, like, I've always, you know, was good at making decisions really fast. Right? And taking control of a situation. And something I do. And these are my top five. But I wanted to share those, my top five. So, it gives you context into understanding, you know, more about, it's not about just you identifying your strengths and weaknesses. It's also taking, you know, a more analytical approach and figuring out what other systems say about you based on going through 30 minutes of question. Right? So, super powerful stuff here. Another question.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Leadership",
      "content_type": "Story",
      "timestamp": "13:20 - 14:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/246618551",
      "source_type": "Course"
    }
  }
]