[
  {
    "chunk_id": "chunk_1",
    "text": "Alright guys, that is a wrap for Module 1 but I want to open up for Q&A. So let's take any questions. Okay, so I noticed that in your strengths and weaknesses chart and the slide that you had you could address in this as a weakness. I want to know why you chose that. Great question. So, aggressiveness like kid, fire like back on you meaning that if you have an aggressive let's say personality and you're working in a team and it kind of ties with impatience as well but let's say your personality is very aggressive towards the team or towards the project. It could really sort of speak sabotage the energy and your aggressiveness brings kind of this negative kind of energy whereas you could like work on pushing the boundaries and being aggressive but with more I guess tactfulness.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Module 1",
      "content_type": "Story",
      "timestamp": "00:00 - 01:19",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "being aggressive but with more I guess tactfulness. So the weakness here is really about how you get maybe too aggressive in a non-tackful way if that makes sense. Does that make sense? Yeah, so for example I can get super aggressive with my team or with the project and there's a tactfulness way because I could look at it as a weakness for me because maybe I'm like no it's not a weakness man I'm aggressive because I like to get stuff done. I could go about it that way or I could hit feedback from my team and say Terry you're a little too aggressive. There's a tactful way right? Giving context to the team why we have to hit this deadline and here's why guys. So there's a way you can reverse engineer that where you're less, look at that as less aggressive that makes sense.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Aggression",
      "content_type": "Advice",
      "timestamp": "01:13 - 02:10",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "aggressive that makes sense. Yeah, I haven't had all that question. Yes. So the industry kind of, in our industry kind of has become the norm to be aggressive in a way that you're always like looking into kind of like a capital kind of mentality where everybody's telling how I'll do each other in order to keep leveling up. Has that become the standard in our industry? So the question is like is our industry is it normal that it's like very competitive? Yeah, competitive and aggressive in a way that you know you step on people's toes all the time and it's kind of like the way that you have to do it in order to succeed in order to go out for the ladder. Yeah, so great question. So it's not, it's how you kind of, there's people that will actually like you know like",
    "metadata": {
      "domain": "Leadership",
      "topic": "Industry Norms",
      "content_type": "Story",
      "timestamp": "02:08 - 03:07",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "bummer someone pushing out the way to get to a spot and then there's a way where you can actually be more humble and more ambitious at the same time and not have to step on toes. Meaning that if you are able to acquire the most independent skills or specialize in an area where you become a subject matter expert, which I actually, I talk about in one of the key lessons is becoming a SME. Is that you don't need to be cutthroat in order to move up. So I don't like when people leverage you know aggressiveness to get what they want to level up. So you know to answer your question, I would say it's experience and being in the man and being a team player could get you to where you want without being cutthroat. Because there's plenty of opportunity and the people think it's like a pyramid.",
    "metadata": {
      "domain": "Leadership",
      "topic": "ambition",
      "content_type": "Advice",
      "timestamp": "03:07 - 04:09",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Because there's plenty of opportunity and the people think it's like a pyramid. There's only a certain amount of jobs. No, like all the jobs like like that I wanted to be a systems engineer like an architect rolls like they're all open. There's not enough people that actually have the right skills to fill those jobs actually. So they look for BC players. There's not enough A players. So right now I don't see in our industry where there's a lack of you know A player open opportunities. It's the people that don't want to put in the effort or the hard work to become an A player to get into those roles. So then it becomes maybe cutthroat in politics and all that comes into play. Whereas you can rise to the top and push the politics down and not even let it affect you.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:06 - 04:52",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "you. You know. Makes sense? Yeah. And that's always been my play. It's not kissing the boss or like you know Brown knows it. Like I hate that. And there's people that do that to get to certain levels. You don't need to use those tactics ever. You know. Yep. Well. On the top five kind of tying it in with having the cyclical upward mobility. Would you figure that the top five would be dynamic that you would need to reassess every couple of months or every year since your situation will most likely change as your woman upward. And you wouldn't you would find other positive attributes that you've gained during your hard work mobility. Yes. Absolutely.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mobility",
      "content_type": "Story",
      "timestamp": "04:51 - 05:50",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "hard work mobility. Yes. Absolutely. So if we were to look at some type of goal like as a shiny object, right? Some type of goal you want to achieve. And you're like here, right? You're starting off here. There's all this struggle and to reach it. And you have all your different strengths, but understand that this is one phase meaning this is one chapter of your life. A lot of people make the mistake that they go here, hit this goal and they're like I'm good. They're like, you know. They're like, man, and they get frustrated because if they have another goal and they don't achieve it fast enough, you know, they give up, you know, or they feel like they're too good to do this again. And that's your question.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Goal Setting",
      "content_type": "Story",
      "timestamp": "05:46 - 06:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "good to do this again. And that's your question. If that makes sense is that when we have that gross mindset and always want that upward mobility, we need to make sure that whatever goal we set, new goals we set, that we also reevaluate. What do I need to study? What do I need to embrace? Like new challenges, obstacles? And understand there's struggle along the way. There's like failure and like risk we have to take. Like big risk, big reward, things like that. And you're going along the way and you're looking at what your strengths and weaknesses are again. You're reevaluating, right? Because new goals may require a different set of skills or different things that you need",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "06:50 - 07:42",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "to tap into or different weaknesses you need to plug up to achieve that goal. Does that help answer your question? Yes. Cool. Yeah. I constantly do this all the time. It's good. All right. Any question about that? Yeah. So, you know, taking tests like the strength is fine and you're at your point now. Yeah. I did that in the past one time. And how do you get out? Because lots of times when you answer these questions, you kind of answer in a way that you kind of want a certain result, right? Yeah. Like I want to be seen as somebody who's a command. So how do you kind of prepare yourself to answer these kind of questions honestly in a way",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Advice",
      "timestamp": "07:42 - 08:24",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "that you can truly identify what your strengths are? Yes. That's a great question. So, like, I gave this kind of talk to the team as well is that when you're taking this test, like for you, you don't have the peer pressure of your manager telling you to take the test. Because you want to, like in Joe's case, it's like you want to maybe portray a certain trait. So, certain questions. It's a good feeling. So what I would advise is you go with your gut feeling of integrity. Bring out that integrity, right? And answer to your question 100% with integrity as if no one was going to look at this. Why? Because you have to forget. You have to basically not give a crap if someone's going to judge you.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Self Awareness",
      "content_type": "Advice",
      "timestamp": "08:24 - 09:16",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "You have to basically not give a crap if someone's going to judge you. Like, don't worry about what others might think of you. Like this is for your eyes only, okay? So, if you go in with that mindset, like I was willing to share with the team after, that's how I reset my brain. It's like, first, I don't care if someone judges me because I don't care what they think. And this is for me, myself, for reasons, I want to better myself. I'm going to go into this with an open mind and answer every question honestly with integrity. So, you go, you do that with every question that pops on the screen and then you're going to get something that's more, you know, cold truth and weight versus like, there's so many people that take personal tests and they take it to just ace the exam and doesn't",
    "metadata": {
      "domain": "Mindset",
      "topic": "Self-Improvement",
      "content_type": "Advice",
      "timestamp": "09:10 - 10:01",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "do you any good. And that's why I combine string finders and also the 10 people, right? And then you mix that with family and also friends and colleagues. So those are the three kind of groups that you want in that 10. Cool? All right. Good question, man. Love it. Any other questions? Anything we talked about? So you have to use selfishness versus that weakness category a part of this field. For that particular exercise. Yeah. For sure. And that particular exercise. You know, like, I think sometimes like a week, something that you look as a weakness could actually be also a strength. But you definitely don't, like, it's okay to be selfish but not selfish where it actually hurts others.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Selfishness",
      "content_type": "Advice",
      "timestamp": "10:01 - 10:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "hurts others. Because one thing I always recommend is that like if you want to take care of your loved ones, your family, right? Like you have to selfishly take care of yourself first. Okay? If you're not selfishly taking care of your mind, your body, your wellness, you know, then it's going to affect all those around you. So that's where I'm really selfish. I'm going to sleep, I can't exercise, I'm there. You know, it's going to benefit others, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "SelfCare",
      "content_type": "Advice",
      "timestamp": "10:53 - 11:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247522055",
      "source_type": "Course"
    }
  }
]