[
  {
    "chunk_id": "chunk_1",
    "text": "Welcome back, Terry Kim, your instructor and mentor here. And congratulations. Now that you've crushed Module 6, you've got that job offer, we're going to move into Module 7 where you get to actually learn how to become a rockstar engineer. And we're going to dive into, let me go ahead and break down this module. So we're going to first start off by showing you what you need to do for your first 90 days on a job. Super important, when you, it doesn't matter what you know step you are in your career, like this is so important. And we're going to talk about what you need to do in the first 90 days to really set yourself up for success. And moving into the second lesson is how to stay, how to grow and stay sharp in the field because it's an ever changing career field.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Advancement",
      "content_type": "Advice",
      "timestamp": "00:00 - 01:03",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "because it's an ever changing career field. But like how do you continue to grow and be in demand? And we're going to cover that in this lesson. And we're going to wrap up this module in how to become a subject matter expert and why that's important. And you're going to see why that's going to help you in your career. So let's dive in. So the first 90 days on the job, understand, first of all, what makes your manager successful? Have that one-on-one conversation and understand what is his kind of priorities? What are things that he needs to accomplish in order to be successful? Because what you want to do is align with that. You want to align with that. And that's going to be super, super powerful when it comes to promotion time when only a",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Growth",
      "content_type": "Advice",
      "timestamp": "01:00 - 01:53",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "few slots of SC, the next SC level positions open up or when a new position opens up. It's super important. And also network with your peers, have lunch or coffee with many of your peers within the first 90 days. This is to build a relationship, start to being contributing as a team player. And then you want to learn the culture. You want to adapt. You want to understand the company's history and basically go into the environment where you can not make too much noise, so to speak. You want to be an asset to the team. You want to be a person that brings more energy and joy to the team. You want to be all important to understand. To do this all in the first 90 days, you want to ramp up with a mentor too. This is key.",
    "metadata": {
      "domain": "Leadership",
      "topic": "First 90 Days",
      "content_type": "Advice",
      "timestamp": "01:53 - 02:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "This is key. If you network with your peers and take them out for lunch, find someone that you joe well like you get really comfortable with. Find that buddy, so to speak. And then ask them to mentor you. That's going to help you. But preferably pick someone that's an A player. In any organization, there's always B.C. players and you don't want them to mentor you. Because they're going to be having that fixed mindset. They're going to bring all this negativity to you. They're like, man, there's not that much opportunity here. You don't want to be hanging out with the actors. You want to hang out with the person that's making impact, creating opportunities, shining, getting promotion after promotion. Hang out with that person.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "02:54 - 03:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "getting promotion after promotion. Hang out with that person. And how you find that mentor is that networking with the peers. Because guess what? Coffee, 10 minutes with someone, you learn a lot about that. Lunch, one lunch, you learn a lot about that person. And no going to that. Like selling yourself, learn about that person. So flip the script, get to know that person. Then set up regular one-on-ones with your manager. This is very important. Why? Because you don't want to deliver above and beyond. You want to deliver like you want to impress your managers so much that after 90 days you're like, wow, this guy's a rock star. And you can do that in the first quarter.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "03:36 - 04:28",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "And you can do that in the first quarter. Because if you can show that you've done so much than any other hiring employed they've hired, they're going to be so impressive. It's going to kind of set in the pressure in their brain like, wow, I just hired a rock star. So set up one-on-ones, understand what's going to make them successful and have build a relationship early on. And this is like you being proactive. You don't want to wait for them to say, hey, can we get together? Like the manager asking, can we get together next week? No, you're proactively reaching out and setting up these meetings. And that's how you get more quality time with your manager. And you want to document, optimize, and just really crush it the first 90 days.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Hiring",
      "content_type": "Advice",
      "timestamp": "04:26 - 05:15",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "And you want to document, optimize, and just really crush it the first 90 days. This is kind of like where you actually stop watching TV. This is where you stop playing games. Your first 90 days super important doesn't matter what job. Because that sets the impression. Remember those kind of things that we talked about where you set yourself up for promotion? Like showing up early, like being a team player, like going above and beyond, volunteering for stuff? Like this is when you get to shine, okay? And I would say this is the most important time to be looked at as like, wow, this guy knows, like this guy, I'm glad I hired him. You want to have the manager think that, right? And also the other people were like, wow, Terry's so awesome.",
    "metadata": {
      "domain": "Leadership",
      "topic": "First 90 Days",
      "content_type": "Advice",
      "timestamp": "05:10 - 05:59",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "And also the other people were like, wow, Terry's so awesome. Terry, that's why that peer in, that networking with your peers is important too. Because they're going to talk about that. Why do managers think, hey, what do you think about Joe that we just hired? What's your opinion? What's your take? So you want to create an awesome onboarding experience for your team, your manager, and just absolutely crush it. Now, the one on one is very important because you want to ask yourself, like, what do you expect of me in the next 90 days? And you write it down, right? Journal everything, you know? What they expect of you. And then deliver a bond beyond, right? And then document and journal that and wrote on the quarterly report.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Onboarding",
      "content_type": "Advice",
      "timestamp": "05:55 - 06:40",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "And then document and journal that and wrote on the quarterly report. Like this is what I did in the 90 days, keep track of that. That's going to set you up for real success into the job. And what a lot of people don't understand is that when you're on the job, you know, you have the opportunity to get promoted when an opportunity rises, when a new engineer position opens when the company grows. Because most companies, they either grow or they close business, right? Hopefully you join a company that's thriving. And if you are, guess what? There's new opportunities always that is happening. New projects, new opportunities, new job rules. Okay? So very important.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "06:36 - 07:19",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247198630",
      "source_type": "Course"
    }
  }
]