[
  {
    "chunk_id": "chunk_1",
    "text": "Last, accepting the offer. Once you get the offer and you accept the offer, make sure everything isn't writing, let her email, and only accept it if it meets all your needs and you mutually agreed on the terms and things. So if you demanded all those things, make sure it's not writing. Because they can say, yes, we'll do this for you, we'll do that for you, but if it's writing, if it's not in writing, then you need to correct that. And it's like, hey, we talked about a sign on bonus, I don't see it in the offer letter. Can you put that in there? Then they get them to put it in there. Because lastly, you want to do a sign of paper, there's nothing in writing. So only accept if it meets all your needs.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Offer",
      "content_type": "Advice",
      "timestamp": "00:00 - 00:56",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "So only accept if it meets all your needs. And if you effectively negotiate in terms, leveraging that, it's like that whole Kevin Spacey, I think I'm in very good position to negotiate. So negotiate once you do that, except if everything is good, then accept verbally and then also on paper. So if we look at accepting the offer verbally, I can say, hey, John, this is Terry, I'm calling to formally accept my offer to join company X. I've signed email by offer, you can expect it to receive it with it. Some people actually want you to physically mail the offer letter and the paper or some people who can electronically just e-sign everything. And then, is there anything else I need to do at this point? Ask them. There's always some next steps.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Negotiation",
      "content_type": "Advice",
      "timestamp": "00:53 - 01:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "Ask them. There's always some next steps. I want you to want to start things like that. You want to give two weeks notice. In a lot of IT positions, what I found is that you could give in two weeks notice, you get terminated immediately. It's just security. You know, you might have some keys to the castle and you might do some stuff and they're just like paranoid. But what's good for you is that you actually get that two weeks paycheck, even though you don't work. One thing that I told Jacob, when he was leaving one of his jobs, I'd be big. You're going to get extra paycheck. Every job that I've been in IT, you get that extra paycheck, which is cool. So accepting the offer or declining the offer, remember, go into it.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Offers",
      "content_type": "Advice",
      "timestamp": "01:45 - 02:34",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "So accepting the offer or declining the offer, remember, go into it. Building a pipeline where you get two or three offers, but usually two is good, right? Aim for two or more. And, you know, same thing here is I'm calling your response to the job offer. I was excited to receive from your overnight. Unfortunately, I'm calling the lets you know that I decided not to accept the offer or maybe you use this as a leverage point to say, I'm not accepting the offer because X, but maybe you want them to up their package, up their game, you know? So one thing that you have to understand is that the goal of the hiring manager and the company is to give you the lowest package possible to bring you in. Believe it or not, it's their game. They're playing.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Offers",
      "content_type": "Advice",
      "timestamp": "02:27 - 03:13",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Believe it or not, it's their game. They're playing. Now, for you, you understand, because I'm teaching you this, there's a range. So like if there's an SE position open, like I don't have to go all the way to the CEO. The hiring SE manager has and his boss have the power to fluctuate or authorize a base salary of let's say, you know, I'm going to have it from 120 to 150, right? That's my wiggle room, you know? So depending on the amount of years of experience, what we can bring unique to the table, they're going to say yes or no. And if they really want you, it becomes almost like a bidding war. So space and I go like crazy back and forth, but my go back and forth a couple of times where you will get like a 10, 20% buck in your total overall package. So you want to leverage that.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Salary Negotiation",
      "content_type": "Advice",
      "timestamp": "03:10 - 04:08",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So you want to leverage that. And lastly, thank you follow ups, right? Super important. Because remember all those tactics I taught you in the previous modules and lessons around networking, creating opportunities at events and other social networking tools I linked into build an expansion network? Is that somehow in some way you may have got that offer or that opportunity, right? You're somebody. This is where you show character. This is where you follow up with that thank you email. I'm excited to tell you that I've accepted this offer by blah, blah, blah without your help during the recruitment. Like, you know, I wouldn't have been able to get this job. Thank you so much. Look forward to working with you in the future.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Follow Ups",
      "content_type": "Advice",
      "timestamp": "04:06 - 04:55",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "Thank you so much. Look forward to working with you in the future. IT Recreator, friend, call a new name. Right? Customize a thank you email and send it out. Okay? Pay it forward, right? Because you never know what's going to happen in front of that. And congratulations. Now you can party like a rock star, right? So that's party. You can celebrate, right? You got that job now it's done, it's paperwork sign. You can, you know, be relieved and celebrate with your family and loved ones. So there you have it. That is module six. Recap.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Offer",
      "content_type": "Story",
      "timestamp": "04:52 - 05:35",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "about the processes and what to expect during, you know, or after that interview is done and you get that offer and how to negotiate that, how to leverage that and how to negotiate properly on certain things and how to go about accepting and declining that offer as well. So hope you guys enjoyed that module and hope you guys can actually take the homework assignments and worksheets and also all the templates to be able to leverage that when you are getting that job offer and when you do need to negotiate is going to be super powerful. All right? Thank you guys.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Interview",
      "content_type": "Example",
      "timestamp": "05:35 - 06:12",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247193822",
      "source_type": "Course"
    }
  }
]