[
  {
    "chunk_id": "chunk_1",
    "text": "Alright, Terry came here, your instructor and mentor. Welcome back to Module 4. And in Module 4, we're going to actually learn about preparing and networking. So, I'm going to start by preparing yourself for the interview process. So, this is an exciting module. Let's go ahead and break down what the module looks like. So, we'll start off by showing you how to research and study your employers and talk about that framework, how to conduct that research, and to study efficiently in order to ace that interview later. And we'll move into the second lesson in preparing your application. So, I'm going to go through the ideal template of how you should set up your resume.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Module 4",
      "content_type": "Story",
      "timestamp": "00:00 - 00:57",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "And then we'll talk about your cover letter briefly. But then, ultimately, I'm going to share with you a secret way to get even more attention for hiring managers with using presentations. And then we'll wrap up this module with social networking, how to network for opportunities and build a pipeline of amazing jobs that no one can really tap into. And then we'll also have a bonus lesson about how to build personal brand. Alright? So, let's dive right in. So, first, lesson is researching and studying employers is very crucial in the preparation phase. Okay? And in the preparation phase, I recommend two key websites and get very familiar with these websites. The first one is Glassdoor.com. And it's Glassdoor. I can pull up any company at any given size, right?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Search",
      "content_type": "Advice",
      "timestamp": "00:57 - 02:00",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "If they're not, you know, if they're like a small mom and pops, you won't find them on here. But all the big players are going to be on this website. And you're going to be able to see jobs on Glassdoor. You're going to be able to see reviews of how people like that company. They're going to leave reviews because sometimes it's important for you to do your due diligence at a company and figure out if you want to be there. If you want to go work there, is that your culture, is that you're, you know, is that you're tried like, did you want to spend your next three to five years there? You have to ask yourself that. So, reviewing, taking the time to new reviews, looking at the reviews, looking at jobs, looking at all different types of jobs that company has to offer.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Advice",
      "timestamp": "02:00 - 02:43",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "And you can go into the duties and descriptions of the requirements for the job and look at even salary information, which is very awesome for Glassdoor. I can look at different systems and engineering jobs that Cisco pays. And I can see the range. I can see if they offer bonuses, offer commissions, any fixed stock options. Also, the interview process is well documented there. People will leave actually reviews of what type of interview process they went through. Don't even document what type of interview questions was asked. Right. So how cool is that? You can get that. You can see the benefits. There's a lot of photos and things like that. But that kind of makes up most of it. But you can use Glassdoor to search for jobs. Look at company reviews.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Example",
      "timestamp": "02:43 - 03:31",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Because look at salary information. You can learn about different interview style questions and things like that. And this is one of my main go to places when I'm looking for job hunting. The next website is LinkedIn. Okay. LinkedIn does similar things, but I use LinkedIn really for looking at jobs and applying for jobs via LinkedIn. Why? Because a lot of IT recruiters look at this. This is another, let's say entry point into if I have an open job instead of getting, you know, let's say resumes, you know, via email. Like you might have the hiring manager or recruiter, one of them directly looking at all the applicants on LinkedIn as a higher priority. Right. Less noise. Less noise. Right. Why? Because everyone's flooding the typical traditional, you know, inbox. Right. Or applying through like career builder monster and you know all these other places. Right.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Hunting",
      "content_type": "Advice",
      "timestamp": "03:31 - 04:38",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "So I highly recommend using LinkedIn to find the opportunities. And then you can also use LinkedIn to basically find out who your coworkers are, who your hiring managers are, who the recruiters are. And more we see companies actually have dedicated recruiting full time employees in house that actually their job 24, 7, 365 is to find like potential employees. Okay. So getting their information on LinkedIn and upgrading your account to a premium level will allow you to actually direct message people that you're not even connected to. So I'll crazy is that. So from a networking perspective, that LinkedIn can be a very powerful tool if you leverage it right. So you can see the big difference between Glassdoor and LinkedIn right. So Glassdoor is all your recon work right before you go on that mission to mail your interview or go land, you know, land your dream job.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Networking",
      "content_type": "Advice",
      "timestamp": "04:38 - 05:48",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "You do that prepper on Glassdoor your recon work. You come here to do all your networking. Okay. And then also use it to apply for jobs and what I'm not sure if they changed this or not. I used to never see that how many people actually apply for jobs. Yeah. Yeah. So how awesome is that you can see like, you know, what your actual percentage, you know, likely that is low is a high life. And that's awesome as well. Okay.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Example",
      "timestamp": "05:48 - 06:27",
      "reference_link": "https://vimeo.com/reviews/48b3efa2-8184-4747-aaf2-e2591f669f92/videos/247073281",
      "source_type": "Course"
    }
  }
]