[
  {
    "chunk_id": "chunk_1",
    "text": "Working in tech is not what you think. You've probably seen influencers showing off their lifestyle and bragging about making six figures talking about how easy it is. But the reality is very different. Look, I've been in tech for over 25 years and I've seen the tech industry build people up and I've seen it absolutely break them. There's thousands of people right now on Reddit and YouTube who went to college for tech or taught themselves how to code and now they're unemployed or drowning in student loan debt. And it's not because they weren't capable or smart. Instead, it's because no one told them the reality of getting into tech, which is what I'm going to expose in this video.",
    "metadata": {
      "domain": "IT",
      "topic": "Reality Check",
      "content_type": "Story",
      "timestamp": "00:00 - 00:42",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "what I'm going to expose in this video. The truth about the tech industry that colleges, influencers, and advertisements aren't telling you. For years, coding boot camps, LinkedIn influencers, and even colleges have sold the same dream. Just learn to code. You'll make six figures in six months. Everywhere you turn, the story was the same. There was someone on YouTube telling you how they landed a six-figure remote job after just 3 months of learning JavaScript. Now, let's look at Instagram influencers also showing off tropical workplaces, claiming they're living and working in Bali with just a laptop, Wi-Fi, and a tech job. Even universities started revamping their",
    "metadata": {
      "domain": "IT",
      "topic": "Tech Industry",
      "content_type": "Story",
      "timestamp": "00:38 - 01:22",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "universities started revamping their computer science marketing, promising you a degree in tech was the safest investment you could make. Now, in 2025, the industry is flooded. Everyone learned to code, but everyone got the same certificate and everyone applied to the same 10 jobs on LinkedIn. On top of that, AI is starting to do the work for you. And we're starting to see even Mark Zuckerberg talk about this. We at Meta, as well as the other companies that are basically working on this, are going to have an AI that can effectively be a sort of mid-level engineer that you have at your company that can write code. And then over time we'll get to the point where a lot of the code in our apps and",
    "metadata": {
      "domain": "IT",
      "topic": "education",
      "content_type": "Story",
      "timestamp": "01:19 - 02:04",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "where a lot of the code in our apps and and including the AI that we generate is actually going to be built by AI engineers instead of people engineers. How crazy is that? And GitHub Copilot is autocompleting code right now. Chat GPT can even write simple functions and tasks that were once entry to even medium level is being offloaded to these AI agents and these machines. The Washington Post reported in 2025 that more than a quarter of all computer programming jobs have vanished in the past 2 years. Even seasoned developers getting laid off. Applications for entry-level jobs are overflowing with tens of thousands of nearly identical resumes. Hiring freezes are hitting both",
    "metadata": {
      "domain": "IT",
      "topic": "AI Impact",
      "content_type": "Story",
      "timestamp": "01:57 - 02:44",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "resumes. Hiring freezes are hitting both startups and big tech companies. And this is why you see lots of coding boot camps shutting their doors. >> Local coding boot camp closed up shop. Microsoft announcing it is laying off nearly 4% of its workforce as it >> speaking of layoffs IBM is set to lay off about 1 and a half% of its workforce about 3,900 folk and that the influencer once who posted from the beach if you scroll a little bit further you'll see that video from them now about battling burnout pivoting to a new purpose and some tech influencers are even unemployed now and it's no surprise why because the unemployment rate in information technology sector jumped",
    "metadata": {
      "domain": "IT",
      "topic": "layoffs",
      "content_type": "Story",
      "timestamp": "02:39 - 03:25",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "information technology sector jumped  from 3.9% in December to 5.7% in January  alone, according to the Wall Street  Journal report. This isn't a U problem.  It's a supply and demand problem. The  pipeline of copy and paste resumes has  exploded, but the job openings haven't  kept up. So, let's call it what it is.  The lifestyle you were sold was a lie,  but tech isn't dead. You just have to  stop chasing trends and start chasing  where the future is actually headed.  Like this boom of AI revolution that's  happening right in front of your eyes. I  love this quote by Wayne Gretzky, a  hockey player that talks about you need  to go where the puck is. And so this is  where we need to focus on because what",
    "metadata": {
      "domain": "IT",
      "topic": "IT sector",
      "content_type": "Story",
      "timestamp": "03:18 - 04:03",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "where we need to focus on because what you're seeing right now is a death of a fantasy you were sold one time. The truth of the matter is that you can't just skip the hard parts, follow a formula, and coast into a dream IT job making six figures working wherever you want. That was just people selling you a dream. And it was a trap because it made a lot of people believe that you didn't have to think critically about your path. You just needed to learn up a coding language and next thing you know, you were set for life. But real safety really only comes from being able to confidently predict what's going to happen in the tech sector next and where the world is actually going. And based",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "04:00 - 04:45",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "the world is actually going. And based on the World Economic Forum's future of jobs report 2025 makes it painfully clear the future isn't just tech, it's a specific kinds of tech. You see 40% of current skills are expected to become obsolete by 2030. This means that your degree or your boot camp certificate has an expiration date unless you're constantly reskilling and leveling up. They've laid out the top 10 highly demand skills that employers are looking for by 2030. And what we're seeing at number one is AI and big data. But guess what? Also number two is networks and cyber security. Companies know this change is happening and can see the future and which is why they're now",
    "metadata": {
      "domain": "Leadership",
      "topic": "Future Jobs",
      "content_type": "Story",
      "timestamp": "04:40 - 05:30",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "future and which is why they're now desperate for AI specialists, cyber security experts, and data and network security experts, and data and network security experts, And you see, according to this World Economic Forum's future of job report, the fastest growing jobs from 2025 to 2030 include AI and machine learning specialists, network engineers and cyber security experts, cloud computing and automation engineers. But let's say you wanted to get into one of these tech path. So you went to college, passed your exams, learned the theory and concepts, and maybe you even built a project around them. You walked across the stage thinking you were set. But months later, your inbox is still filled with autorejections and you can't even",
    "metadata": {
      "domain": "IT",
      "topic": "future jobs",
      "content_type": "Story",
      "timestamp": "05:26 - 06:10",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "with autorejections and you can't even get a job. And if you're one of those lucky ones who made it through the interview stages, especially the tech interview, you've probably heard this phrase at least once. We're looking for someone with more hands-on experience. But the problem is, you can't even get hands-on experience for an entry-level job cuz they won't let you touch the mission critical stuff. If you can't get an entry-level job, then you're going to be stuck in this endless vicious loop. But even for the companies, most of them don't have a choice because they don't have the luxury to take chances on trainable employees anymore. That takes way too much time. The pace of business",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Market",
      "content_type": "Story",
      "timestamp": "06:06 - 06:47",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "way too much time. The pace of business has accelerated due to technology and the pressure is higher now with AI and the technology stacks are evolving so fast that onboarding someone without practical skill sets is a financial liability. They need people who can actually jump into a live environment and start contributing immediately. In fact, an analyst of LinkedIn job postings from January 2024 revealed that the average number of years required for software development positions labeled as entry level was 4.5. And a survey by generation.org found that 94% of employers across all industries said that entry-level tech hires must have some work experience in a related field.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Advice",
      "timestamp": "06:42 - 07:30",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "some work experience in a related field. So entry-level now means already experience and the reason is simple. Companies are overwhelmed with applications, so they raise the bar to filter out the noise. If you don't prove that you can do the work, your degree is just paper waste. Which is why a lot of jobs even are removing the traditional degree requirements from them. Because think of it this way, when a company hires someone, they want a problem to be solved. And degrees don't solve problems. Experience does. That's why the people who are getting hired despite not coming from an Ivy League school or bigname university have one thing in common. They built something. Not a",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Market",
      "content_type": "Advice",
      "timestamp": "07:25 - 08:10",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "common. They built something. Not a school project, not a group assignment where you carried your teammates. I'm talking about real world hands-on IT experience. You see, this portfolio can prove that you know exactly how to build IT infrastructure, how to troubleshoot it, how to architect it, and how to deploy it. and certifications prove that you understand standards and can pass a formal evaluation. And no, you don't need a job to build out your first portfolio. You can build it on your own and solve real problems. You can recreate business solutions. Think about this for example. Imagine you got hired as a network architect for a big insurance company with 200 locations,",
    "metadata": {
      "domain": "IT",
      "topic": "portfolio",
      "content_type": "Advice",
      "timestamp": "08:05 - 08:57",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "insurance company with 200 locations, but they want to support wireless access for all their insurance agents cuz they come in and out and they all have laptops. Imagine that you are able to architect an entire Wi-Fi infrastructure that's centrally organized and private and secure. I mean, think about it. How cool is that? the concept of just setting up Wi-Fi at your home but doing it at a larger scale. That's what's going to pay you the big bucks. And these are projects that you can simulate and you can start creating in your home labs or in cloud environments. And what's important next is to pursue certifications that fit the role instead of chasing that fancy degree. There are",
    "metadata": {
      "domain": "IT",
      "topic": "Wi-Fi",
      "content_type": "Story",
      "timestamp": "08:47 - 09:31",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "of chasing that fancy degree. There are specific certifications that are designed to help you open that door and then you prove yourself with your portfolio of projects. But let's get this straight now. Certifications is just another checkbox. They're a commodity. And that's why at our school, we don't focus on the certifications. We focus on those kind of as a afterthought cuz they are just a checkbox for the resume. The real experience that you need is this portfolio of IT projects that gets you the real hands-on training. And this is how you escape the I have a degree, but no one will hire me trap. So now let's say you've built this portfolio of IT projects. You've got",
    "metadata": {
      "domain": "IT",
      "topic": "IT Projects",
      "content_type": "Advice",
      "timestamp": "09:26 - 10:14",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "portfolio of IT projects. You've got three solid projects under your belt, a few respected IT certifications, and you can confidently walk into an interview and explain all of your experience and your work. But this is still not enough to land a six-figure or multi6figure job in today's market. Why? Because you're not the only one who's figured this out. And right now, tens of thousands of people, including fresh grads, boot camp alumni, and self-taught coders, are all applying to the same roles. But that's not the scariest part. What should scare you is the huge number of layoffs of senior professionals now flooding these entry-level job markets. People with 5, 10, 15 years of experience and people",
    "metadata": {
      "domain": "IT",
      "topic": "Job Market",
      "content_type": "Story",
      "timestamp": "10:09 - 10:56",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "10, 15 years of experience and people who used to lead teams or even architect systems. People were desperate to get back into work and willing to accept junior level pay just to survive. When Meta, Google, Amazon cut tens of thousands of jobs. They didn't just lay off bad performers. They laid off entire departments often with great people with expertise. Now those people are directly competing with you with the same roles. And the hiring managers sees two resumes. one from you, a brighteyed with three projects, and one from a laid-off senior engineer who built data pipelines at scale. So, the question is, how do you win in a job market like that? Simple. Don't compete where the market",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Market",
      "content_type": "Advice",
      "timestamp": "10:50 - 11:35",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "Simple. Don't compete where the market is flooded. Don't keep throwing your resume into these black holes and software engineer and business analyst roles that gets hundreds, if not thousands of jobs in the first hour. You go where the demand outpaces supply. This is a real strategy no one teaches in school. market arbitrage, finding underrated roles that are less saturated, but still pay well and get your foot in the door, but also offer remote work and have long-term career growth. For example, fields like network engineering and data center architecture and cyber security and IT engineering support. There's over 450,000 open jobs. For example, everyone wants to be a data",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Strategy",
      "content_type": "Advice",
      "timestamp": "11:31 - 12:17",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "For example, everyone wants to be a data scientist, but few realize that data quality analysts and ETL developers are in higher demand and face less competition. These roles are critical to businesses, but aren't glamorized on LinkedIn, so fewer people chase them. You see, take cyber security for example, which is built on top of network engineering. And right now, there's 3.5 million unfilled cyber and networking jobs globally. You don't need to have the coolest job title. You just need to have the role where your odds of breaking in is actually real. So yes, build that portfolio of IT projects, get your certifications, and get a mentor that's been there and done that. You",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "12:13 - 12:59",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "that's been there and done that. You need to apply those skills in fields where you're not drowning in competition and where employers are still begging for talent. But how do you know where to actually begin? because there's tons of pathways and you probably aren't sure what you're really interested in. And that's why we built a free quiz that tells you exactly which high-paying tech path you should pursue based on your personality, lifestyle goals, and your current skill level. It takes 3 minutes and it will help you figure out exactly which high-paying tech path actually fits you better. So you don't waste years chasing the wrong thing or end up competing against hundreds of laid-off",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Advice",
      "timestamp": "12:55 - 13:40",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "competing against hundreds of laid-off seniors for the same job. It's 100% free. Just tap the link below on your screen or in the description to get your custom tech career path now.",
    "metadata": {
      "domain": "IT",
      "topic": "Career Path",
      "content_type": "Example",
      "timestamp": "13:36 - 13:50",
      "reference_link": "https://www.youtube.com/watch?v=NsBPccfsG-E",
      "source_type": "YouTube"
    }
  }
]