[
  {
    "chunk_id": "chunk_1",
    "text": "Hello, my name is Terry Kim and I wish I wasn't making this video. But after what I've discovered, I don't have a choice to be honest. You see, over a decade ago, I founded a tech school that's now one of the largest in the world. We've trained over 40,000 students across IT technologies and even the US military with my background in instruction and with a top secret clearance. You see, 6 months ago, I received an internal memo from a former student who is now an engineer at Cisco. And what I read has kept me awake ever since. I'm not supposed to be recording this video. You see, making this public could cost me my business, opportunities, and maybe even worse. But something is coming.",
    "metadata": {
      "domain": "IT",
      "topic": "My Story",
      "content_type": "Story",
      "timestamp": "00:00 - 00:54",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "worse. But something is coming. Something that could bring America to its knees. Not through violence or politics or war, but through technological and economic disruption unlike anything in the history of our country. And when your job vanishes, when your bank account becomes inaccessible, and when the entire middle class evaporates, most Americans will be caught completely unprepared. And this fundamental shift isn't coming anytime soon. It's already begun. It all started with a recent release by Goldman Sachs, a 150year-old hedge fund corporation with over $3.1 trillion under management. the same corporation",
    "metadata": {
      "domain": "IT",
      "topic": "Disruption",
      "content_type": "Story",
      "timestamp": "00:46 - 01:49",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "under management. the same corporation that predicted the 2008 housing collapse and made billions from it. The co market rebound, AI, and many more. And they just predicted the next big event. 300 million jobs erased. So, put that into perspective. Now, in the Great Depression, the most devastating economic collapse in American history, unemployment reached 25%. And 15 million jobs were lost. This predicts 300 million globally. The depression lasted over a decade and forced millions of middle class families to lose their homes and stand in bread lines just to eat. So, what happens when it's 10x worse this time? And why aren't people talking about this?",
    "metadata": {
      "domain": "Leadership",
      "topic": "Economic Collapse",
      "content_type": "Story",
      "timestamp": "01:44 - 02:38",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "worse this time? And why aren't people\nBecause this time, the threat isn't\nInstead, it's something far more\npowerful, disguised as humanity's\nArtificial\nintelligence\nhas arrived.\n300 million jobs will be erased by AI\nalone. But what scares me the most that\nthis isn't just a prediction anymore.\nIt's already happening in front of our\neyes. AI is writing legal briefs in\nminutes that lawyers used to take for\nweeks to complete. Self-driving taxis\nare already replacing drivers. We're\nseeing Whimo on the streets. And in a\nrecent survey by Bold, a 260 million per",
    "metadata": {
      "domain": "IT",
      "topic": "AI threat",
      "content_type": "Story",
      "timestamp": "02:29 - 03:26",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "recent survey by Bold, a 260 million per year company that has helped 150 million people find jobs, found that one in four companies have already replaced a 75,000 a year worker with a $20 ChatGpt subscription. But this is just the beginning. And what happens next is the most concerning because it allows a scary pattern that has happened before. Ray Dalio, American billionaire and manager of the world's largest hedge fund, Bridgewater Associates, just shared a study revealing the current state of America and why we are in big trouble. You see, over the last 1,000 years, without exception, the world's biggest superpowers all follow a predictable cycle that lasts just about 250 years",
    "metadata": {
      "domain": "Leadership",
      "topic": "Future Work",
      "content_type": "Story",
      "timestamp": "03:18 - 04:24",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "cycle that lasts just about 250 years\n\neach. The Dutch Empire in the 1700s, the\n\nBritish Empire in the early 1900s.\n\nFirst, a country rises to global power\n\nand enters a golden era. As a result,\n\ncitizens get more wealth, freedom than\n\nthey ever had before. But instead of\n\nbeing happy about it, they feel entitled\n\nto more and more money, more salary, and\n\nmore payraises.\n\nSo manufacturing in that country becomes\n\ntoo expensive, and they ship those jobs\n\noverseas. And in an effort to try to\n\nmaintain the global superpower status,\n\nthe country starts borrowing and\n\nprinting money. But this devalues the\n\ncurrency. Prices rise, wages freeze, the\n\nrich stay ahead while the poor and the",
    "metadata": {
      "domain": "Leadership",
      "topic": "Cycles",
      "content_type": "Story",
      "timestamp": "04:10 - 05:00",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "rich stay ahead while the poor and the middle class fall behind. And this divide leads to internal conflicts. And eventually it all becomes unsustainable. And the reserve currency status and the global influence collapses and another world superpower begins its rise. It happened to the Dutch. It happened to the British. And now it's happening to America. But here's why I wish I wasn't making this video right now. Because this cycle happens every 250 years. And America declared independence in 1776. Which means we're now at year 249. [Music] But this time, we're not shipping our jobs and losing them to another country and its citizens. We're losing them to",
    "metadata": {
      "domain": "Leadership",
      "topic": "Economic Cycle",
      "content_type": "Story",
      "timestamp": "04:56 - 05:46",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "and its citizens. We're losing them to the companies who are developing this AI technology. which means the paychecks that used to go to the middle class workers and families will now go to tech CEOs and shareholders. And if you look closely enough, this has happened before, too. Because during every economic collapse, there's always a group of people who benefit. [Music] In a private meeting room in Davos, Switzerland, thousands of the most wealthy, powerful people in the world like Bill Gates, Jeff Bezos, and Claude Schwab gather to decide how the entire global economy will run the future. It's called the World Economic Forum. And in their last meeting, they shared exactly",
    "metadata": {
      "domain": "Leadership",
      "topic": "Economic Collapse",
      "content_type": "Story",
      "timestamp": "05:41 - 06:36",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "their last meeting, they shared exactly what happens next. Now, just to give you an example of just how powerful this small group is, the people in that one room have more money than 4.6 billion people on the earth combined. But they said something at their last event that I wasn't expecting. When empires decline, not everyone suffers equally. People who recognize the shift early and adapt to the new emerging systems not only survive, but thrive. When the Dutch Empire was declining, those who pivoted towards an industrial revolution in Britain actually did great. And when the British Empire was fading, the business leaders who recognize America's rising dominance and",
    "metadata": {
      "domain": "Leadership",
      "topic": "Empire Decline",
      "content_type": "Advice",
      "timestamp": "06:30 - 07:21",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "recognize America's rising dominance and invested their early built generational wealth. And that's why what was said at the World Economic Forum was so significant because at their last meeting they admitted that yes AI will eliminate jobs but it will actually create 3 to x times more AI jobs than it eliminates. And this has happened before. Back in the end of the 1800s, the invention of the car eliminated 250,000 horse carriage jobs, but it replaced horse and carriage jobs with over 7 million new US auto jobs by 1940. And today, the same thing is happening with AI, but bigger. A study by Asenture, a 200 billion global consulting firm that advises governments, Fortune 100s, and entire",
    "metadata": {
      "domain": "Leadership",
      "topic": "Rising Dominance",
      "content_type": "Story",
      "timestamp": "07:14 - 08:04",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "consulting firm that advises governments, Fortune 100s, and entire industries on what's coming next, shared a projection that artificial intelligence could add 14 trillion to the global economy by 2035. That's 10x greater than the auto industry's yearly GDP. But what's not included in that study is the ecosystems AI will create. Because the car didn't just replace the horse. It basically created the entire modern economy with thousands of industries that could exist before like the oil and gas industry, trucking and transportation. Even fast food chains today like McDonald's or Burger King. But the average person in 1910 just saw cars replacing carriages",
    "metadata": {
      "domain": "Strategy",
      "topic": "AI Impact",
      "content_type": "Story",
      "timestamp": "08:02 - 08:54",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "1910 just saw cars replacing carriages and taking their jobs. Just like how most people only see AI taking jobs. They couldn't imagine the future. But one day you'll wake up and find AI has transformed the hospital where your doctor works, the bank where your money is stored, and even the school where your kids learn. Everything will be changed. And it's already happening. So, just like carriage makers in the early 1900s who struggled and disappeared into the past if they didn't even get into the auto industry and just like the Dutch and the British Empire if you don't want to get left behind, you need to adapt and pivot into tech and AI. For example, two brothers named John",
    "metadata": {
      "domain": "Leadership",
      "topic": "Future",
      "content_type": "Story",
      "timestamp": "08:48 - 09:42",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "AI. For example, two brothers named John and Horus used to work on carriages in the late 1800s and were making about $10 a day doing that. But once cars started appearing on the streets, they noticed a shift and decided to pivot industries. And it paid off. A few years later, they were making 1,600 per day, which equals about 50,000 per day in today's money. You might even know these brothers. They were John and Horus Dodge, the founders of Dodge, the iconic American muscle car brand that still exists today. But most people back then thought cars were just a passing trend and they got left behind. And today, this will happen to 300 million people. Which is why if you",
    "metadata": {
      "domain": "Leadership",
      "topic": "Mindset",
      "content_type": "Story",
      "timestamp": "09:36 - 10:25",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "300 million people. Which is why if you don't want to get left behind, you need to consider how to get into tech. And it might be a lot easier than you think. Companies already know this is coming and are pivoting really fast. Trump just announced a 500 billion investment into Project Stargate, fueling the need for AI infrastructure. 500 billion 500 billion. The intention to put 500 billion dollars at least. The largest AI infrastructure project by far in history. And it's all taking place right here in America. creating over 100,000 American jobs almost immediately. Apple has also committed $500 billion to build out data centers for this change.",
    "metadata": {
      "domain": "IT",
      "topic": "Future Tech",
      "content_type": "Story",
      "timestamp": "10:20 - 11:13",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "build out data centers for this change. And Amazon has already invested hundreds of millions of dollars into robots and technology and AI. Even transportation companies are investing into AI vehicles. But just like with the carriages, this will result in new jobs and new opportunities in new industries. Data centers will be the new oil rigs. AI technicians, analysts, and prompters and engineers are the new electricians. And cyber security experts will police the new police force. But there's a big problem with this shift. It's happening faster than any person or traditional institution can keep up with. Astroteller, the man who runs Google's most secretive lab called Google X,",
    "metadata": {
      "domain": "IT",
      "topic": "AI Shift",
      "content_type": "Story",
      "timestamp": "11:07 - 11:57",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "most secretive lab called Google X, where they attempt to redefine the limits of reality and create confidential projects like self-eing AI, machines that can outthink humans, and many more. Astro also confirmed the trouble we're in. This is a graph right here that Astro drew, which shows the rate of technological change has now surpassed the rate of human adaptation. And as history shows us, that's when bad things happen. For example, when the horse and carriage replace cars, it happens slowly over 30 years. So people had time to pivot into the auto industry. But when it happens too fast, it's disastrous. Like in the textile factory in England in the early 19th",
    "metadata": {
      "domain": "Leadership",
      "topic": "Technological Change",
      "content_type": "Story",
      "timestamp": "11:52 - 12:38",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_17",
    "text": "factory in England in the early 19th century, in an effort to keep up with century, in an effort to keep up with technology and competition, they implemented automated machines. But the change was so fast that workers were replaced overnight. So this group violently protested, killing business owners and destroying machines. But eventually the government stepped in and stopped it. But the damage was already done. Those workers, those ludites were replaced by machines and struggled to provide for and feed their families. And they lived in complete poverty for the next generation. This was the start of an industrial revolution which massively increased GDP, jobs, and access to goods. But it happened so fast that most",
    "metadata": {
      "domain": "Leadership",
      "topic": "Industrial Revolution",
      "content_type": "Story",
      "timestamp": "12:34 - 13:19",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_18",
    "text": "goods. But it happened so fast that most of the gains only went to the factory owners and not to the workers. And the same thing is happening right now. But in England, the lites didn't even have access to education like we do today. So they didn't really have a way out. But the problem Astro shares is that the traditional institutions like colleges and universities, the ones that are supposed to educate us and train us and get us job ready, can't keep up with the rate technology is advancing. And according to IBM, the 200 billion tech giant that works directly with governments and Fortune 500s ran a study and found the following. By the time a tech professional graduates college,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Economy",
      "content_type": "Story",
      "timestamp": "13:14 - 14:02",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_19",
    "text": "tech professional graduates college, over half of what they learn will be completely obsolete. For those most people, college isn't worth it because it puts you in debt and doesn't even guarantee you a job, especially in tech. For example, this is a job posting for a tech position. And here's a college curriculum compared to that. You see, college doesn't even cover any of the actual job requirements. So, even a degree, no one's going to hire you because employers want you to have experience. We've all seen the stories of college grads working minimum wage jobs. The tech is moving way too fast and colleges just can't keep up. But behind the scenes, there's something",
    "metadata": {
      "domain": "IT",
      "topic": "College",
      "content_type": "Story",
      "timestamp": "13:57 - 14:45",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_20",
    "text": "behind the scenes, there's something people created that people are calling the quiet revolution. And no one is talking about it. But large corporations and governments know that college is unable to keep up. Brazil, Bahrain, a country in Asia and even here in the US, these governments are experimenting with new ways to train future workers and have created programs where they partner with private companies to train people faster than college. So although the traditional education pipeline is broken, the new one is being forged and education and hiring is going skills first, especially in tech where most companies have removed bachelor degree requirements for",
    "metadata": {
      "domain": "Leadership",
      "topic": "Quiet Revolution",
      "content_type": "Story",
      "timestamp": "14:40 - 15:29",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_21",
    "text": "removed bachelor degree requirements for their roles and 72% now prioritized skills over diplomas. And the message is loud and clear. If you can do the job, it doesn't matter where you learned how to do it. So now online certifications, vocational schools, boot camps, and trade schools for tech are starting to explode to meet the skills demand, and they're working. In 2015, fewer than 20,000 people graduated with an alternative tech education. Today, that number is over 380,000. These alternative schools give people everything they need in 12 to 16 weeks, compared to 4 years of traditional education. But most people won't take this path. And the reason is something",
    "metadata": {
      "domain": "IT",
      "topic": "Skills",
      "content_type": "Story",
      "timestamp": "15:24 - 16:02",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_22",
    "text": "this path. And the reason is something that no one wants to admit. See, when the first cars appeared on the streets, the public was skeptical and doubted them. When the Dutch and the British empires declined was because they struggled to keep up with a changing world. And exactly like those events, what's happening right now in America isn't about a lack of intelligence or education opportunities. It's about our hardwired resistance to abandon the old world that we know, the old America. You see, the brutal truth is that this change is happening now. And the American dream that we were all sold, the idea of our entire nation was built on. And one of our parents taught us,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Change",
      "content_type": "Story",
      "timestamp": "16:07 - 16:51",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_23",
    "text": "on. And one of our parents taught us, the one that promised if you just followed the rules, got a stable job, get an education, buy a house, get 401k, and retire at 65, that's gone. And it makes me sad to say this, but if you're watching this, America's not ending. It's already dead. But throughout history, when empires fell and economies collapsed, there were two types of people. The ones who tried to hold on to the way things were, hoping and waiting for the government to save them. And the ones who were willing to adapt to change. The ones who were willing to leave the past behind. The ones who crossed the oceans with nothing but hope in their pockets. These were",
    "metadata": {
      "domain": "Leadership",
      "topic": "Change",
      "content_type": "Story",
      "timestamp": "16:46 - 17:36",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_24",
    "text": "but hope in their pockets. These were the people that built America. And for them, the risktakers. What we're trying to convey is a message of hope and optimism. Optimism that is based on actual physics. Earth can and will move to a sustainable energy economy. The visionaries. Is this the best time ever to be starting a technology company? Let's at least say it's the best time yet. The hard workers. The work ethic that I have came from survival and realizing nobody was going to give me anything. America will never die because they'll redefine and rebuild the new America and the new American dream. And it's already happening right now in the tech industry.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Risk Takers",
      "content_type": "Story",
      "timestamp": "17:31 - 18:16",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_25",
    "text": "dream. And it's already happening right  now in the tech industry. That's why during co my tech school donated over 5 million in IT scholarships to help people impacted by the sudden shifts in employment because I see the future of America. But the hardest part about the new America isn't going to be getting a job because there's going to be a ton of paths getting into the tech industry. Instead, the hard part will be choosing the right one because every career path in IT is rapidly changing and most schools are still teaching skills from 10 years ago or focus on concepts and theories. You see, picking the wrong path means wasting 2 to 5 years of your life. So to",
    "metadata": {
      "domain": "IT",
      "topic": "Future America",
      "content_type": "Advice",
      "timestamp": "18:09 - 18:58",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_26",
    "text": "wasting 2 to 5 years of your life. So to help with that, we made a free quiz to help anyone who wants to enter the new America to find the right tech career path for them based on your personality, lifestyle preferences, income goals, and current skills. So you can find a highpaying IT career in the tech industry and survive the new America. It's 100% free and it's in the description.",
    "metadata": {
      "domain": "IT",
      "topic": "new America",
      "content_type": "Story",
      "timestamp": "18:52 - 19:22",
      "reference_link": "https://www.youtube.com/watch?v=AK5QSMY340E",
      "source_type": "YouTube"
    }
  }
]