[
  {
    "chunk_id": "chunk_1",
    "text": "immigration and fake job listings on\nLinkedIn. You might not think there's a\nconnection between these two topics, but\nmy team and I spent months researching\nthe job problem on platforms like\nLinkedIn, Indeed, and Zip Recruiter,\nwhere there's millions of fake job\nopenings. Jobs that have been open for\nmonths, even years, with hundreds of\nthousands of people applying, but no\nAmerican, even those who are perfectly\nqualified, ever get a response because\nthese job listings are fake.\nWall Street Journal is recognizing that\njob listings abound, but many are fake.\n>> This is crazy, but frankly, not that\nsurprising from the experience I've had\nso far in the last few weeks. I've been",
    "metadata": {
      "domain": "IT",
      "topic": "Fake Jobs",
      "content_type": "Story",
      "timestamp": "00:00 - 00:44",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "so far in the last few weeks. I've been looking for new clients or maybe a full-time or part-time gig to help supplement my income. >> And after digging around, we found a really a weird link to an immigration crisis. So, I want to unpack this all because first off, this whole fake job listing thing has been sort of an epidemic happening for years. 40% of companies posted fake jobs within the last year and three in 10 companies still have them up. But 70% of hiring managers believe posting fake jobs is morally acceptable. The reasons why hiring managers do this is plentiful. Some use it to signal the burned out employees that help is on the way, while others do it to test the market,",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Listing",
      "content_type": "Story",
      "timestamp": "00:40 - 01:19",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "others do it to test the market,\nbenchmark salaries and benefits among\ncompetitors, and make it appear as if\nthey're staying on top of DEI\ninitiatives.\n>> And where it gets crazy is behind every\none of these fake job posts, someone is\nprofiting and making money. And it's\nbecome a hundred billion dollar\nindustry. And it's causing some of the\nmost recent immigration tension. Let me\nexplain what's happening. So, right now,\nif you go to LinkedIn looking for a job,\nyou'll find over 1.7 million ghost jobs\nposts that aren't real. But why do\ncompanies do this? I'll get to the real\nreason in a second, because first of\nall, I want to share some of the easier\nto understand reasons why a company",
    "metadata": {
      "domain": "Leadership",
      "topic": "Fake Jobs",
      "content_type": "Story",
      "timestamp": "01:17 - 01:57",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "to understand reasons why a company would do this. First, some companies make fake job listings to create an illusion of growth. Because when investors or partners see a lot of open roles, it signals that the company is growing, which builds investor confidence and can lead to more funding, better press, and even a boost in stock prices, which can be hundreds of millions of dollars. Another reason is some companies just want resumes because by collecting hundreds or thousands of applications, they build a massive candidate database that they can use for future job roles or even market research. But this can be pretty dangerous because some of those",
    "metadata": {
      "domain": "Leadership",
      "topic": "company growth",
      "content_type": "Story",
      "timestamp": "01:54 - 02:34",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "research. But this can be pretty dangerous because some of those companies turn around and sell your data which is creating a huge problem that I'll explain in about a second. But then there's a third reason and it's 100% legal and it's a big big problem. In the US, if a company wants to hire a foreign worker, they need what's called an H1B visa. But to get an H-1B visa, they are legally required to show that they first try to hire an American. So they must post a job. people apply but they never hire anyone. They never intended to hire anyone either. They just needed an American applicants to apply. So they can say they tried and then they hire someone from overseas often for much",
    "metadata": {
      "domain": "IT",
      "topic": "data",
      "content_type": "Story",
      "timestamp": "02:28 - 03:13",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "someone from overseas often for much\nlower lower pay. This has become such a\nbig problem that the US government is\nnow trying to crack down on it. Check\nCompanies pay to sponsor H1B applicants\n$100,000.\nThis will ensure that the people they're\nbringing in are actually very highly\nskilled and that they're not replaceable\nby American workers.\nAnd the crazy part is this has been\nhappening for hundreds of years. Back in\nthe 1800s, Andrew Carnegie, who\neventually became the richest man in the\nworld through his steel company, ran\nfake job ads, too. His reason was a bit\ndifferent, though. Basically during\nunion strikes he would run a bunch of",
    "metadata": {
      "domain": "IT",
      "topic": "H1B",
      "content_type": "Story",
      "timestamp": "03:08 - 03:56",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "union strikes he would run a bunch of job openings in the newspaper to try to demoralize the workers that were on strike [music] and it worked. So then during the civil rights era companies started doing the same thing. They'd post job ads in all black newspapers but never actually called anyone back and it would demoralize people. And today the same thing is happening. Companies are posting fake jobs for so many different reasons. If you're sending out resumes and hearing nothing back, it doesn't mean you failed. It's just that sometimes that job was never there to win in the first place. And now that's happening on the surface. But underneath it all, it's not just a few shady",
    "metadata": {
      "domain": "Leadership",
      "topic": "union strikes",
      "content_type": "Story",
      "timestamp": "03:46 - 04:29",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "it all, it's not just a few shady companies tricking job seekers. Instead, what's really happening is part of a major, larger system. [music] Third-party firms are being hired by big companies to basically create shell companies that are meant entirely to build and flood job boards with fake listings at [music] scale. And they're getting very, very rich from it. Some of these big corporations in the world are paying these shell companies, sometimes millions, to flood the internet with fake job listings, gather resumes, and sell those to recruiters while also quietly bringing in cheap labor from overseas. It's an entire industry, but some of the companies are tricking",
    "metadata": {
      "domain": "IT",
      "topic": "Fake Jobs",
      "content_type": "Story",
      "timestamp": "04:24 - 05:07",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "some of the companies are tricking everyone and taking advantage of a lot of innocent people. Most of the companies doing this actually don't even exist. And they're not trying to inflate investor confidence or even collect resumes to sell it to recruiters. Instead, they're stealing something so much more valuable. [music] When you apply for a job, on a lot of these application systems, you put in information like name, email, employment history, salary expectations, [music] your phone number, and sometimes these sensitive details like social security numbers, address, or you even create an account on websites with passports. And what these fake companies do is collect",
    "metadata": {
      "domain": "IT",
      "topic": "Job Scams",
      "content_type": "Story",
      "timestamp": "05:02 - 05:45",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "what these fake companies do is collect all that information and they sell it to data brokers or even criminal hackers who end up stealing people's identity, taking out loans and ruining people's lives. And the platforms everyone trusts with their information and data are allowing this stuff to happen. And because they're making money, too. I'm talking about LinkedIn, Indeed, Zip Recruiter. These platforms aren't just job boards. They're ad platforms. And they make more money when there's people on these platform. They're allowing these fake job postings because it means more people will log on to them in their search and they're making billions. LinkedIn alone pulled in a record 16.3",
    "metadata": {
      "domain": "IT",
      "topic": "Fake Jobs",
      "content_type": "Story",
      "timestamp": "05:40 - 06:33",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "LinkedIn alone pulled in a record 16.3 billion in revenue in 2024. And even if just 20% of that came from job postings, that still amounts to over 3 billion per year. That's billions generated from listings, authentic or not, because more listings drive more platform revenue. Now, the good part is that these fake job listings often follow a pattern and if you know what to look for, you can avoid wasting your time. First, watch for the long running listings with zero activity for months. Secondly, check the job description. Fake listings often include unrealistic or contradictory requirements like asking for 10 years of experience in a technology that's only existed for five. They also never",
    "metadata": {
      "domain": "IT",
      "topic": "Fake Listings",
      "content_type": "Advice",
      "timestamp": "06:21 - 07:08",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "existed for five. They also never mention details for an actual recruiter or hiring manager, making it impossible to verify who's behind the role. And sometimes you'll see the same company post dozens of jobs and not a single hire goes public. >> What if I told you that at least half of the jobs you're applying to are fake job postings and that company is not hiring at all? Fake job postings have been around forever, but there is a very real uptick in the last 6 to 8 months. There are two kinds of fake job postings. Fake postings from real companies because they're trying to save face and make it look like they are in a strong financial position when the reality is they're",
    "metadata": {
      "domain": "IT",
      "topic": "Fake Jobs",
      "content_type": "Story",
      "timestamp": "07:04 - 07:38",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "position when the reality is they're probably doing layoffs. The second is fake postings from fake companies. Here's how you can tell that job posting might be fake. Emphasis on the mic cuz you never know. It's a non-niche role. So, it's a generally simple role to hire for and it's been posted for 12 or more months. The exact same job posting has been unposted and reposted back to back to back, maybe every 30 days for about 8 months to a year. Fake postings from fake companies are even more dangerous. You can tell these are fake because they're really vague, poorly written, probably riddled with typos, and they request some of your personal information. For example, you should",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Posting",
      "content_type": "Advice",
      "timestamp": "07:35 - 08:05",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "request some of your personal information. For example, you should never have to log into Facebook to book an interview meeting. That person is trying to hack you. >> What can you do to actually get hired then? And avoid these scam posts. If you're looking for a job, the best way to go is beyond the public job listings. Because most of the best jobs out there, even in my career, don't even get filled by a job listing. Instead, studies also show that 76% of jobs actually get filled through referrals and insider connection. Now, that doesn't mean you need a personal connection, but if you're around massively applying to thousands of jobs, you're wasting your",
    "metadata": {
      "domain": "Leadership",
      "topic": "Job Search",
      "content_type": "Advice",
      "timestamp": "08:01 - 08:41",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "thousands of jobs, you're wasting your time. Skip the job portal. Start networking with people in your industry. I'm talking about hiring managers, friends, people with connections. Secondly, you want to make sure you're in the right industry that's growing, hiring, and has a lot of new opportunities being made every year because then there's enough real job listings to apply for, for example, information technology. The IT industry is growing faster than nearly every other industry, and there's over 356,000 new real jobs being created every year in this industry. In the tech industry, the problem there isn't sorting through fake listings or trying to get a job.",
    "metadata": {
      "domain": "IT",
      "topic": "Job Search",
      "content_type": "Advice",
      "timestamp": "08:37 - 09:19",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_16",
    "text": "fake listings or trying to get a job. But that's also the problem because there's so many options to get into tech. So, to help with that, we made a free quiz to help anyone who wants to start a new career in tech. This quiz will reveal the perfect tech job that's based on your personality, your lifestyle preferences, and your current passions and skills.  It takes three minutes, it's personalized, and it's 100% free. Tap the link on your screen or in the description to get your custom tech career path blueprint",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Example",
      "timestamp": "09:16 - 09:46",
      "reference_link": "https://www.youtube.com/watch?v=RlDje47aBkU",
      "source_type": "YouTube"
    }
  }
]