[
  {
    "chunk_id": "chunk_1",
    "text": "July 1st, 2005. You turn on the TV and see this. >> My education has turned my life around completely. So, I have time to do things I really enjoy. I would like to think that my family's very proud of me cuz I've started with nothing and I've had to work my way up. >> We are educators helping people build a foundation for the rest of their lives. ITT Technical Institute, education for the future. But then without any warning, over 40,000 ITT tech students who invested 40, 50, even $85,000 in their [music] education had everything stolen from them. Tonight, 40,000 students and 8,000 employees are studying their next move because ITT Tech, one of the largest",
    "metadata": {
      "domain": "Leadership",
      "topic": "Education",
      "content_type": "Story",
      "timestamp": "00:00 - 00:48",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "because ITT Tech, one of the largest for-profit colleges, shut down yesterday with little warning. Families were devastated and left not only with huge amounts of debt, but also useless IT Tech college credits. >> Was in shock really. You know, I had a lot of classmates. I had to take a quarter off, but I had a lot of classmates that were halfway through or further. And now, you know, finishing is not an option. Credits aren't supposed to transfer. >> This is how ITT Tech became one of the biggest education scams in the history of America. Imagine everyone recommending you [music] to go to ITD Tech. And on the surface, it seems like a great idea, especially for",
    "metadata": {
      "domain": "IT",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "00:43 - 01:23",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "a great idea, especially for working-class Americans, veterans, single parents, and even kids straight out of high school, because [music] ITT ITT ads offered flexible classes online, fast [music] programs for accelerated bachelor's degree, and high-paying IT jobs would be the [music] result. And it was perfect for people who were already working during the day because ITT offered night and evening classes and even weekend classes. Something most colleges at [music] the time didn't do. And because ITT Tech knew this, they knew exactly who they [music] were targeting. Their pitch wasn't about just education. They",
    "metadata": {
      "domain": "IT",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "01:19 - 01:58",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "pitch wasn't about just education. They were offering IT [music] jobs of the future. And that strategy worked. By nearly 2010, ITT Tech had over 130 campuses across the [music] US and was worth now billions. Tens of thousands of students were enrolled at any given time and it looked like everything was going great. [music] But the reality was very different. Back in 2013, ITT graduation rate was just 31%. Over half of the students never finished. And the ones who did, the jobs weren't there. In fact, many ended up working in different careers in retail or [music] food service or completely unrelated fields.  Two years after graduation, Michelle Zoover does not know how her college",
    "metadata": {
      "domain": "Leadership",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "01:53 - 02:40",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Zoover does not know how her college debt reached $86,000. She was told the cost would be less and all for a criminal justice degree she says many police agencies don't recognize. But the real problem and the real scam was the funding. More than 80% of ITT's revenue came from federal student aid and other programs like Pell Grants that were to help lowincome students pay for college. In other words, taxpayers money was being used at this for-profit school whose tuition was higher than most public universities. The government simply handed out these loans to people because they thought ITT Tech was helping people. But behind the scenes, ITT Tech was gaming the",
    "metadata": {
      "domain": "IT",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "02:36 - 03:21",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "scenes, ITT Tech was gaming the government system and operated more like a sales company than a college. They were just enrolling students to get their financial aid approved and provide subpar IT [music] educational training. And since federal laws didn't allow student loan debt to be wiped out in bankruptcy, once you join ITT Tech, you were stuck. [music] They were making billions from this revenue stream alone. And they got greedy. Eventually, ITT launched their own loan programs and [music] called it Peaks and Cuso. These were private and highinterest loans designed to fill the gap when federal money ran out and students were pressured into signing them without",
    "metadata": {
      "domain": "IT",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "03:16 - 03:57",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "money ran out and students were pressured into signing them without really understanding what they were getting into. Later on, internal documents showed that an expected large chunk of students defaulted because of this, but they didn't care because their goal was to keep students enrolled and let that money keep coming in. But eventually, it caught up to them and the investigation folded. In 2014, ITT was sued for predatory lending. It exposed that the school pushed students into loans that they didn't understand and couldn't even afford and just to keep the federal money flowing. And a year later in 2015, the SEC charged ITT top executives, including the CEO Kevin",
    "metadata": {
      "domain": "IT",
      "topic": "ITT scandal",
      "content_type": "Story",
      "timestamp": "03:52 - 04:36",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "executives, including the CEO Kevin  Mandeni with fraud. That same year, the Department of Education started cracking  down and putting tighter rules on ITT's  access to federal aid. So, ITT was  access to federal aid. So, ITT was  gradually failing. But the people  running it didn't care. In fact, they  made sure that their pockets were full.  Mundanei made over $7 million in a  single year while thousands of his  students were defaulting on their loans  and stuck working retail jobs amidst  this crisis. Finally, in 2016, the whole  thing finally collapsed and ITT Tech was  shut down overnight. But this was a  nightmare for its students. Over 35,000  students were stranded with a ton of  debt, no degree, no job, and no way to",
    "metadata": {
      "domain": "Leadership",
      "topic": "corporate failure",
      "content_type": "Story",
      "timestamp": "04:31 - 05:18",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "debt, no degree, no job, and no way to transfer to another school. And 8,000 employees lost their jobs, too. [music] by the way, and no one came to their help. But ITT Tech wasn't the only one. It was just one of the biggest players in a long line of for-profit schools built on the same model. Corinthian colleges collapsed the same way. So did Everest and parts of University of Phoenix. Even there's this whole wave for-profit schools that promised fast careers. They ran out of debt and they vanished when [music] things got too messed up.  >> I quit my job. like I had a full-time job and I quit my job because they assured me that I would be able to finish my program and then I would move",
    "metadata": {
      "domain": "IT",
      "topic": "ITT Tech",
      "content_type": "Story",
      "timestamp": "05:12 - 05:58",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "finish my program and then I would move forward and then I would be certified and then we come to class today and it's like nope your your last date was yesterday and no one says anything other than there's nothing we can do for you. You have to file a claim. You have to do this. You have to do that. They don't they don't care about the debt that we put ourselves into. They don't care.  And they all had one thing in common. They were built on a broken system based on unchecked funding from the government and student aid from the government to these schools without accounting for how schools use that funding. Over a 100,000 people were affected by the ITT tech scam. And so when I saw that, I knew I",
    "metadata": {
      "domain": "IT",
      "topic": "ITT tech",
      "content_type": "Story",
      "timestamp": "05:53 - 06:33",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "scam. And so when I saw that, I knew I had to do something different. At that time, I was working as a systems engineer at Arista [music] making 350,000 a year. And since I knew a lot about this IT field being 20 years in it and trained thousands of people in the United States Air Force, I knew that there was a better way to train people to become IT professionals. I decided to try and help and I created one of these free courses on Udemy on how to be a Cisco engineer and earn six figures. and tens of thousands of people enrolled into my free Udemy course and was leveled up and broke into the IT industry and I started getting tons of thank you emails where people",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "06:28 - 07:12",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "emails, thank you emails where people were landing jobs and that's when I realized I had something here that could help people. So what I did was I actually quit my job and I went from a 350k salary to a 60k salary along with my co-founder and Air Force veteran Jacob Hess who also quit his job. And so we poured everything into this idea and started our own IT tech school called NGT Academy. And today, I'm proud to say we've helped over 12,000 plus students with our immersive programs, 40,000 with our courses and created a pathway for people to break into the IT industry without going into massive student loan debt like ITT Tech students and without them needing to spend four years",
    "metadata": {
      "domain": "IT",
      "topic": "Career",
      "content_type": "Story",
      "timestamp": "07:08 - 07:56",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "them needing to spend four years at a college or university. Now, the thing is there are a ton of career options in IT. There's networking, cyber security, data analytics, cloud, and DevOps, and many more. And so, to help you out with this, I created a quiz that helps you figure out which career path in tech is best for you based on your unique personality, your skills, your goals, and where you're at right now. It just takes 3 minutes, and it's 100% free. So, if you're interested in working in tech but don't want to go to college for four years, then tap that link below in the description and get your custom IT career path Today.",
    "metadata": {
      "domain": "IT",
      "topic": "career options",
      "content_type": "Advice",
      "timestamp": "07:52 - 08:33",
      "reference_link": "https://www.youtube.com/watch?v=GPbXQqBFUNM",
      "source_type": "YouTube"
    }
  }
]