[
  {
    "chunk_id": "chunk_1",
    "text": "Is the middle class collapsing? Or are the people just overspending and living above their means? Well, numbers don't lie. And honestly, what's happening is crazy. Because in the '90s, if you made $100,000 a year, you were living a really good lifestyle. But now, things are different. Check this out.  You don't have to be an economist to know that the middle class salary is now $100,000. In 2019, $40 to $50,000 would buy you a middle class life. In 2024, it's 100 grand. Even if you look at my life, our bills, monthly bills are $7,000 a month, and we have no credit cards, no student loans, and we don't have children. I can't imagine when people tell me that their daycare is",
    "metadata": {
      "domain": "Leadership",
      "topic": "Middle Class",
      "content_type": "Story",
      "timestamp": "00:00 - 00:40",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "people tell me that their daycare is\n2500 and their student loan is 500. I'm\nlike, that would make our monthly bills\n$10,000. What? So, the reason we keep\nnot to see a repeat in the next 5 years of\nit going to 150 or $200,000 for the\nmiddle class. Like, we're watching the\nmiddle class just be pushed right out.\nAnd the comments under this video are\ncrazy. It seems like everyone feels the\nsame way. But is it actually your fault?\nWell, a lot of people are saying yeah,\nand that you need to just stop eating\nout, cancel your subscriptions. But when\nwe look at the actual math, there's\nsomething deeper going on. And honestly,\nit looks like the system is about to",
    "metadata": {
      "domain": "Leadership",
      "topic": "Financial",
      "content_type": "Story",
      "timestamp": "00:37 - 01:15",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "it looks like the system is about to break. Because first of all, salaries haven't kept pace with the rising inflation. So today, six figures isn't wealth anymore. It's just basic survival. And anyone below that is barely above poverty. But it's not really about the number in your paycheck. It's about how far it goes. Because these days, it's barely to get you through the month. And that thing is nobody warned you about this shift. You just woke up one day and like, \"Wow, I can't even buy a dream house anymore.\" And so even if you make double what your parents did, you'll still be struggling. And here's basically how this all happened. So a long time ago, everyone",
    "metadata": {
      "domain": "IT",
      "topic": "System Break",
      "content_type": "Story",
      "timestamp": "01:10 - 01:52",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "happened. So a long time ago, everyone struggled with a lack of employment opportunities. But for us, the employment rate improved a lot. It's a lot more than what it used to be. Watch this. Between 1949 and 1979, the actual unemployment rate was cumulatively 15.3% below the natural rate of unemployment. In contrast, the unemployment rate was cumulatively 35.7% above the natural rate of unemployment between 1979 and 2017. But we are still barely able to afford a comfortable living. But what's happening isn't just a budgeting issue. That whole narrative, you're broke because you're wasting money on a latte, was built to make you feel guilty for something the system broke.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Employment",
      "content_type": "Story",
      "timestamp": "01:47 - 02:35",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "was built to make you feel guilty for something the system broke. And that system hasn't just shifted, it's been malfunctioning. Wages in most fields have been remained flat for the past 40 years when adjusted for inflation. Meanwhile, housing costs have skyrocketed. food, gas, college, education, especially also health care, all exploding. From 2000 to 2024, the cost of living went up around a 77%, but wages have only risen by about 17%. Here's why that's a problem. So, for decades, minimum wage was a livable wage. We're just trying to get back to that. In 1980, the minimum wage was $310. you would make about $530 a month, but the average onebedroom was around",
    "metadata": {
      "domain": "Leadership",
      "topic": "Wages",
      "content_type": "Story",
      "timestamp": "02:27 - 03:22",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "but the average onebedroom was around\n$243. So, if you split that with a\nroommate, it would only take 23% of your\nincome to live in that apartment. Less\nthan one weeks of work could actually\npay for your apartment. Now, you moved\nto the year 2000, minimum wage went up\nto $5.15, which is about $900 a month.\nThe average onebedroom went up to 600.\nSo, if you split that with a roommate,\nit's about 300, which is about 30%. So,\ngone up a little bit, but still kind of\ndoable. In 2025, the minimum wage is\n$7.25. 25 cents an hour, which is only\n$1,250 a month. The average onebedroom\nin this country is $1,600. So, if you\nwere to split that with a roommate, it\nwould take 64% of your income. And",
    "metadata": {
      "domain": "IT",
      "topic": "affordability",
      "content_type": "Story",
      "timestamp": "03:13 - 03:58",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "would take 64% of your income. And studies back this up. We're not making enough, guys. But it's not our fault. People out here are being shamed for not managing their money better. But saving $10 on a coffee won't close a $3,000 month gap between your income and your bills. It's nonsense. And the more this gap widens, the more people blame themselves. Like maybe I'm just not working hard enough, you might think. But you already are. And this will affect your mental health. And if you're wondering where retirement fits into all of this, it doesn't. Because when you're barely surviving now, saving for the future becomes a joke. So retirement now feels like another bill you can't pay.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Money",
      "content_type": "Advice",
      "timestamp": "03:48 - 04:33",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "feels like another bill you can't pay. Most people don't even have an emergency fund. So, we're all living inside a version of America that stopped supporting the average worker for decades ago. And until we admit that the entire equation has changed, we're just going to keep blaming ourselves for systems that's fundamentally broken. But the truth is, you can break out of it. But it means rethinking everything that you've been told about jobs, career, money, and forgetting the old definition of success. Because if the system doesn't serve you, maybe your only option is to outpace it. So, first of all, you need to stop confusing income with freedom. Because even with a",
    "metadata": {
      "domain": "Leadership",
      "topic": "Financial",
      "content_type": "Advice",
      "timestamp": "04:28 - 05:16",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "income with freedom. Because even with a six-f figureure income, you're just one emergency away from being broke. That's why the game isn't about just making money. It's about making margin. Margin is the gap between what you earn and what your life actually costs. But most Americans don't have that gap anymore because of inflation. Which is why the answer is to simply make more money. Your survival now depends on which part of the economy you're playing in. So the most powerful thing you can do is to earn more. But that's only possible if you're in the right environment with the right people. Which is why the most important thing is to choose jobs in career fields where you could actually",
    "metadata": {
      "domain": "Leadership",
      "topic": "income freedom",
      "content_type": "Advice",
      "timestamp": "05:11 - 05:55",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "career fields where you could actually earn multiple six figures without any ceilings. One example is tech because tech doesn't just offer higher salaries, it offers the margin. Check this out. >> A huge fan of salary transparency. So, let's take a look at what each state is paying by tech salary. There's a couple things that jump out at me on this list. The first thing is check out Arizona. Arizona people are seeing a massive uptick in tech salaries, 20% over the last 2 years. That's some big money. >> Also, you can work remotely. This cuts down commute costs, gas, daycare, and things like that and saves you a ton of time. You don't have to travel to work. Unlike traditional jobs, the right tech",
    "metadata": {
      "domain": "IT",
      "topic": "career fields",
      "content_type": "Example",
      "timestamp": "05:50 - 06:32",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "Unlike traditional jobs, the right tech job doesn't demand also a master's degree. There's a lot of trade schools out there that can get you started pretty quick. And it's not just tech trade schools. There's a ton like nursing or even bluecollar jobs like plumbing or electrician jobs. The only problem is that most people don't know how to start because it's not the traditional path like college. That's why we made a free quiz to help you figure out which trade school path might be the right one to break into tech. It takes 3 minutes. It's personalized and it's 100% free. At the end of this, you'll receive a customized career plan based on your unique personality,",
    "metadata": {
      "domain": "IT",
      "topic": "trade schools",
      "content_type": "Advice",
      "timestamp": "06:27 - 07:12",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "based on your unique personality, skills, and passions that tells you the fastest path to a new IT career that pays you well and that you can get started very quickly. Tap the link on your screen or in the description and get your custom tech career path now.",
    "metadata": {
      "domain": "IT",
      "topic": "career path",
      "content_type": "Example",
      "timestamp": "07:06 - 07:25",
      "reference_link": "https://www.youtube.com/watch?v=FMq-Ljr3LDI",
      "source_type": "YouTube"
    }
  }
]