[
  {
    "chunk_id": "chunk_1",
    "text": "For two decades, Silicon Valley was a center of the universe and known for six figure salaries in the tech industry. But now that might be changing. Right now, layoffs in Silicon Valley are everywhere. Capital is flowing out. Startups aren't being gatekeeping located in the valley or even in the US in general. And everything is going global. And for the first time in history, you don't have to stay in Silicon Valley to win in tech anymore. When Silicon Valley was peaking like 2016 to 2018, it was unlike anyone has ever seen. Companies like Meta, Amazon, Google, Twitter went on some historic hiring sprees with hundreds of thousands of IT jobs being created and all the",
    "metadata": {
      "domain": "IT",
      "topic": "Silicon Valley",
      "content_type": "Story",
      "timestamp": "00:00 - 00:48",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "of IT jobs being created and all the young people flooded into coding boot camps and computer science degrees with a dream to reach one of these jobs in Silicon Valley. For a moment, tech felt futurep proof. But then by the end of 2023, Amazon had slashed 27,000 jobs. Google and Meta followed, cutting tens of thousands of more. >> Twitter, Facebook owner Meta, now Amazon. The big tech job cuts continue. The e-commerce giants confirmed it's acting 18,000 jobs this month. They said it was because of the pandemic overhiring, but that wasn't the full story because while they were laying off people, they were quietly pouring billions into something else and it was",
    "metadata": {
      "domain": "IT",
      "topic": "job cuts",
      "content_type": "Story",
      "timestamp": "00:44 - 01:35",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "billions into something else and it was AI. In 2024 alone, over $74 billion in venture funding went straight into AI startups. So, the result is this. >> There is backlash today after this young woman recorded herself getting fired. >> Yeah, I'm going to stop you right there. >> Chat bots are answering customers. LLMs are writing production code and AI hiring tools are doing interviews without a single recruiter. Interesting, right? But this isn't just Silicon Valley falling behind. It's the rest of the world catching up. Silicon Valley was a gatekeeper of the future for",
    "metadata": {
      "domain": "IT",
      "topic": "AI",
      "content_type": "Story",
      "timestamp": "01:27 - 02:12",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "was a gatekeeper of the future for years, but now the gate is wide open. Why? Because AI doesn't care where you live. Anyone with the internet connection can access the same tools and platforms. As a result, companies are going global faster than you can ever imagine. Remote teams in the rest of the worlds are being hired because they're cheaper and just as skilled. 200,000 for a US engineer or 20,000 for someone in Brazil isn't a hard choice when budget matters. Now, while the US was laying off engineers, China was laying down servers. Have a look at this. They were pretty serious about it, too. Alibaba alone dropped over 53 billion to cloud and AI infrastructure. And Beijing",
    "metadata": {
      "domain": "IT",
      "topic": "Future",
      "content_type": "Story",
      "timestamp": "02:07 - 02:55",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "and AI infrastructure. And Beijing  launched the 8.2 billion national AI  fund, a direct shot at breaking US chip  dominance. By mid 2024, China had over  250 AI data centers online or under  construction, placing it among the most  AI ready nations on Earth. Now, America  is just one node in a global tech  network that moves without it. So, if  the old tech dream is fading, that means  there's going to be a new dream, but  it's not building another delivery app  or chasing remote software jobs that  might vanish within the next algorithm  update. Instead, the next big  opportunity is the infrastructure, the  physical backbone of the AI revolution.  Because AI may be global, but its",
    "metadata": {
      "domain": "IT",
      "topic": "AI",
      "content_type": "Story",
      "timestamp": "02:49 - 03:41",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "Because AI may be global, but its foundation isn't. And that's where the next race is already underway. data center, cyber security, national cloud infrastructure is where the future is being built. Right now, the US still dominate. Amazon, Microsoft, Google control over twothirds of the global cloud market, which means most of the world's AI is running on America's infrastructure. That's why also cyber security is exploding. With the rise of AI, threats are becoming more and more relevant. And with over 3.5 million jobs unfilled globally, let that grab your attention because AI systems bring new kinds of risk like deep fakes and hacking at scale. And you just can't",
    "metadata": {
      "domain": "IT",
      "topic": "AI Future",
      "content_type": "Story",
      "timestamp": "03:36 - 04:24",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "hacking at scale. And you just can't outsource your national defense. Roles like AI operations, clouds site reliability, data governance are hard to automate and nearly impossible to offshore, especially when the Pentagon, the CIA are pumping billions into building hardened digital defenses. Trump alone announced Project Stargate, which is a $500 billion investment in data center infrastructure. 500 billion 500 billion. the intention to put 500 billion to put 500 billion dollars at least the largest AI infrastructure project by far in history creating over 100,000 American jobs almost immediately  Microsoft pledged over 80 billion to build out AI data centers across South",
    "metadata": {
      "domain": "IT",
      "topic": "hacking",
      "content_type": "Story",
      "timestamp": "04:19 - 05:08",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "build out AI data centers across South and the Midwest and companies like Palunteer, Crowdstrike, Cloudfare are quietly staffing up for the long global cyber war. Also, the tech race with China only makes this more urgent now because the global power will shift to whoever controls the systems. Have a take a look at the job market trend in cyber security. This skill is getting more and more in demand. So yes, the old tech dream is ending, but the next one is already here and the next elite class in tech will be the ones who secure, scale, and defend the infrastructure that AI runs on. And that's exactly why we built a free quiz that helps you figure out exactly which are the",
    "metadata": {
      "domain": "IT",
      "topic": "cyber war",
      "content_type": "Story",
      "timestamp": "05:04 - 05:49",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "figure out exactly which are the high-paying tech career path like cyber data center that you actually would thrive in that meets your personality and your passion interests. It takes 3 minutes. It's personalized and it's 100% free. Tap the link on your screen or in the description and take the quiz and get your custom tech career path blueprint.",
    "metadata": {
      "domain": "IT",
      "topic": "career path",
      "content_type": "Example",
      "timestamp": "05:44 - 06:09",
      "reference_link": "https://www.youtube.com/watch?v=3n6o2n3hZOA",
      "source_type": "YouTube"
    }
  }
]