[
  {
    "chunk_id": "chunk_1",
    "text": "Can I be honest with you? College is a trap and it was designed that way. And now we have the proof. This is how much money I owe in student debt. I'm literally applying for like minimum wage jobs and some of them are being like we're not hiring. And it's like what? I graduated college with two degrees in communications and acting. I speak three languages. Oh, this sucks. of student loans was the singlehandedly worst mistake I've ever made in my entire life. I've been paying on my student loans for more than 13 years now, and I've more than paid back the amount that I took out and then some because of interest. And still, college enrollments are",
    "metadata": {
      "domain": "Leadership",
      "topic": "Student Loans",
      "content_type": "Story",
      "timestamp": "00:00 - 00:49",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_2",
    "text": "because of interest. >> And still, college enrollments are rising. But why? Each year, millions of Americans are taking out student loans, racking up college credit card debt, and going to university. But the problem is the job market is now declining in a lot of different jobs and it has been. So millions of people basically will be stuck with hundreds of thousands of debt in loans, struggling to get good jobs and working the rest of their lives trying to pay off their student loans. And someone is getting very, very rich off this system. But it's not you or me. Here's how the college degree trap was designed. and who's profiting off of it. So, first of all, to understand what's",
    "metadata": {
      "domain": "Leadership",
      "topic": "College Degree",
      "content_type": "Story",
      "timestamp": "00:42 - 01:31",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_3",
    "text": "So, first of all, to understand what's happening, you have to understand that originally college was never designed to get you a job in the first place. Back in 700 BC, the purpose of higher education wasn't to get a career. It was to teach you how to think critically, to question, to understand the world more deeply. But then fast forward to the 1980s and because of shrinking funding, colleges have become considered a personal investment instead of a public benefit. So as a result, education started to become more privatized and costs went super high compared to countries like maybe Norway or the Netherlands where colleges actually paid for like fully by the government. But in",
    "metadata": {
      "domain": "Leadership",
      "topic": "Higher Education",
      "content_type": "Story",
      "timestamp": "01:27 - 02:12",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_4",
    "text": "for like fully by the government. But in the USA, it's quite different. At first, colleges actually made sense because back then, tuition was relatively affordable in the 80s. College cost was around 2,000 per year, and graduates made around 20,000 starting out. The math worked out, so most could finish school with little to no debt. And most importantly, the degree actually led them a stable job and career, so it was worth it. Now, fast forward 40 years. The old American dream of working hard in school, going to college for four years, getting an internship and working and building a career and working the corporate ladder and getting a good job. Really, that dream is like a coin toss.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Education",
      "content_type": "Story",
      "timestamp": "02:07 - 02:51",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_5",
    "text": "Really, that dream is like a coin toss. First off, college costs have skyrocketed higher than inflation. In fact, in the past decade, we've accumulated $1 trillion in student loan debt. How crazy is that? Something is broken. On top of that, wages have pretty much remained the same. And now today, unless you've got a h 100,000 in cash sitting around, and if you're working a full-time job, you're forced to take out several more student loans. But these loans aren't like car loans or even credit card debt. Student loans follow you for life. And you can't declare bankruptcy to get rid of them. >> There's literally no legal way for you to get out of paying your student loans.",
    "metadata": {
      "domain": "Leadership",
      "topic": "Student Loans",
      "content_type": "Story",
      "timestamp": "02:47 - 03:30",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_6",
    "text": "to get out of paying your student loans. You cannot. You are in a prison. It's the same as debtor's prison. And I'm watching these people send their kids to debtor's prison for jobs that they don't need to buy degrees for. And it's wild. But they've convinced them that they have to do that to get any good jobs. But the reality is very few jobs are going to be good enough to get them out of this. >> That's why so many college grads are pissed off. And that's why you see all the demos and riots and things like that happening. And now for our parents, this deal was fine because your college degree used to pay for itself. But what happens when the economy is so bad you",
    "metadata": {
      "domain": "Leadership",
      "topic": "Student Loans",
      "content_type": "Advice",
      "timestamp": "03:25 - 04:04",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_7",
    "text": "happens when the economy is so bad you\nFor the first time\nin decades, new college grads are facing\nhigher unemployment rates than the\ngeneral population. So even if you have\na degree, you're pretty much screwed.\nBut let's say you do get a job. With the\ncost of living so high, the salary\nstaying the same, you're going to have\nto spend 15 years paying off your\nstudent loan. And while you're doing\nthat, interest rates are also piling up.\nSo a bubble is being created. But where\nit gets messed up is all of this is\ndesigned to be this way. Because while\nmillions of students are sinking into\ndebt, somebody's getting rich off it.\nThe universities know the market is",
    "metadata": {
      "domain": "Leadership",
      "topic": "Economy",
      "content_type": "Story",
      "timestamp": "04:00 - 04:41",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_8",
    "text": "The universities know the market is broken. They see companies choosing experience over degrees. They know fresh grads are struggling. But they don't slow down enrollment. Instead, they double down because the money keeps flowing from the government. And it's not just universities who's profiting. It goes deeper than that. First, the federal government makes money when students don't pay their loans. So, it's easy to see why it's in the best interest to let this keep happening because earning billions in profits through edtech and universities and colleges is a big money-making system. And interest on these student loans are very profitable. And there are also loan",
    "metadata": {
      "domain": "Leadership",
      "topic": "Higher Ed",
      "content_type": "Story",
      "timestamp": "04:38 - 05:20",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_9",
    "text": "very profitable. And there are also loan servicesers that are making a ton in the middle. Loan services are private companies contracted by the government to manage these loans and they make money even when the borrowers default. This means that every step of the system is built to profit off you while keeping you in debt enslaved into the system and relying on that college degree to save you. And the worst part with all this money flowing into higher education systems like universities and colleges the cost are going up a,000%. The quality of college hasn't gotten much better. You're fed outdated coursework taught by professors who haven't worked in the actual IT industries in decades.",
    "metadata": {
      "domain": "IT",
      "topic": "Higher Education",
      "content_type": "Story",
      "timestamp": "05:15 - 06:02",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_10",
    "text": "in the actual IT industries in decades. And by the time any modern tool reaches the classroom, it's already two versions behind or more. And if the curriculum was up to date, employers don't care about degrees anymore. What they want is proof of skill, not a frame degree. Like I mentioned before, colleges used to be about education and critical thinking. When it first started, not employment, but then once colleges started selling themselves like a business, talking about getting a job or a career, that opened the door to competition. And in capitalism, competition shows up where there's inefficiency. So now, luckily, that's exactly what could save us because capitalism is now creating trade",
    "metadata": {
      "domain": "IT",
      "topic": "Education",
      "content_type": "Story",
      "timestamp": "05:55 - 06:38",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_11",
    "text": "because capitalism is now creating trade schools, vocational schools, skills-based schools. These schools are designed to get you the job, and they're competing directly with colleges. This is why trade schools are getting more popular. Don't learn anything in trade school. I heard that a number of times. I can tell you in the last 15 months that I've been here, I've learned a ton. The National Student Clearing House Research Center finds total enrollment at 2-year vocational focus schools grew. Look at the number there. 13.6% this past fall. Just take a look at this. Because trade schools and vocational schools aren't just about plumbing and welding anymore. There are",
    "metadata": {
      "domain": "IT",
      "topic": "trade schools",
      "content_type": "Story",
      "timestamp": "06:34 - 07:15",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_12",
    "text": "plumbing and welding anymore. There are now a dozens of in- demand career path like tech, cyber security, marketing, and so many more. Many of them paying 80,000 starting out to even breaking six figures just getting started. Often within months of hands-on training and certification versus wasting 4 years of college. You see, the problem is with so many options and the system pushing colleges down our younger generation is the norm. Now, it's very hard to pick the right one because unlike in college where you can easily change your major, trade schools are harder to switch. Why? Cuz you need to have the clarity before you start training at a trade school or vocational school. You need to",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Paths",
      "content_type": "Advice",
      "timestamp": "07:10 - 07:57",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_13",
    "text": "vocational school. You need to understand exactly what career you want to get into. Do you want to be a welder? Do you want to be a plumber? Do you want to be an electrician? Do you want to be a network engineer? Do you want to be a cyber security analyst? That clarity starts with you. And as a result, so many people don't even consider trade schools because college is sold as a safe path. But the truth is that is not the safe path any longer. It's more costly and less efficient in terms of training and completely misaligned with what employers want. In fact, Google, Apple, IBM, Netflix, Bank of America, and dozens of Fortune 500 companies have dropped the college degree requirement",
    "metadata": {
      "domain": "Leadership",
      "topic": "vocational school",
      "content_type": "Advice",
      "timestamp": "07:53 - 08:36",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_14",
    "text": "dropped the college degree requirement  entirely. So the reality is that in  today's economy, degrees are losing  value over time and they're trapping  people in the broken loop of massive  consumer debt. And trade schools on the  other hand are becoming the new smarter  path and costefficient path to break in  to your next career. But like I said  before, you need to have clarity on what  you want to do in your career before you  enroll into a trade or vocational  school. This is exactly why we've  created a free quiz. This quiz will help  you find your career path into a tech  trade school based on your personality,  your goals, and your current skills. And  if you're not sure if a trade school is",
    "metadata": {
      "domain": "Leadership",
      "topic": "Career Path",
      "content_type": "Advice",
      "timestamp": "08:32 - 09:16",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  },
  {
    "chunk_id": "chunk_15",
    "text": "if you're not sure if a trade school is right for you and not sure what path to take, then take this free quiz. It just takes 3 minutes. It's personalized and it's 100% free. It will show you the fastest path to making six figures or more from a tech trade school customized to your personality and your current skill set. Tap the link below on the screen or in the description to take the quiz",
    "metadata": {
      "domain": "IT",
      "topic": "trade school",
      "content_type": "Example",
      "timestamp": "09:12 - 09:36",
      "reference_link": "https://www.youtube.com/watch?v=MljPuOz_jMc",
      "source_type": "YouTube"
    }
  }
]